<
   ir_version: 10,
   opset_import: ["" : 18]
>
task340_edgepair_rebuild_1173 (float[1,10,30,30] input) => (int8[1,10,30,30] output) 
   <float[30] e1f =  {0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}, float[10] colorf =  {0,1,2,3,4,5,6,7,8,9}, float[10] nzf =  {0,1,1,1,1,1,1,1,1,1}, uint8[1] one1b = ..., float[1,1] oneMM =  {1}, int8[6,9,1] ACTable = ..., int32[1,10] inv_baseI =  {0,5,5,5,5,5,5,5,5,5}, int32[1,4] role_idsI =  {1,2,3,4}, int8[4] rowUpd = ..., int8[4] colUpd = ..., uint8[1] zero1b = ..., float[30] sharedw =  {-2,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,0,0,0,0,0,0,0,0,0,0}>
{
   Wf = Einsum <equation: string = "bkrc,r->b"> (input, e1f)
   Hf = Einsum <equation: string = "bkrc,c->b"> (input, e1f)
   W = Cast <to: int = 2> (Wf)
   H = Cast <to: int = 2> (Hf)
   Wm1 = Sub (W, one1b)
   Wm2 = Sub (Wm1, one1b)
   Hm1 = Sub (H, one1b)
   Hm2 = Sub (Hm1, one1b)
   TBS = Einsum <equation: string = "bkrc,c,k,bx->bx"> (input, e1f, colorf, oneMM)
   TBQ = Einsum <equation: string = "bkrc,r,c,k,bx->bx"> (input, sharedw, e1f, colorf, oneMM)
   CTf = Gemm <alpha: float = 0.601562, beta: float = -0.199219> (TBS, oneMM, TBQ)
   CT = Cast <to: int = 2> (CTf)
   TBSu = Cast <to: int = 2> (TBS)
   CB = Sub (TBSu, CT)
   LRS = Einsum <equation: string = "bkrc,r,k,bx->bx"> (input, e1f, colorf, oneMM)
   LRQ = Einsum <equation: string = "bkrc,r,c,k,bx->bx"> (input, e1f, sharedw, colorf, oneMM)
   CLf = Gemm <alpha: float = 0.601562, beta: float = -0.199219> (LRS, oneMM, LRQ)
   CL = Cast <to: int = 2> (CLf)
   LRSu = Cast <to: int = 2> (LRS)
   CR = Sub (LRSu, CL)
   colBaseF = Einsum <equation: string = "bkrc,r,c,bkij,k->j"> (input, sharedw, e1f, input, nzf)
   colBase = Cast <to: int = 3> (colBaseF)
   colIdxU = Concat <axis: int = 0> (zero1b, one1b, Wm2, Wm1)
   colIdxI4 = Cast <to: int = 6> (colIdxU)
   colMask = ScatterElements <axis: int = 0> (colBase, colIdxI4, colUpd)
   rowBaseF = Einsum <equation: string = "bkrc,r,c,bkij,k->i"> (input, e1f, sharedw, input, nzf)
   rowBase = Cast <to: int = 3> (rowBaseF)
   rowIdxU = Concat <axis: int = 0> (zero1b, one1b, Hm2, Hm1)
   rowIdxI4 = Cast <to: int = 6> (rowIdxU)
   rowU = ScatterElements <axis: int = 0> (rowBase, rowIdxI4, rowUpd)
   rowI = Cast <to: int = 6> (rowU)
   roles = Concat <axis: int = 1> (CT, CR, CB, CL)
   rolesI = Cast <to: int = 6> (roles)
   invI = ScatterElements <axis: int = 1> (inv_baseI, rolesI, role_idsI)
   roleTable = Gather <axis: int = 0> (ACTable, invI)
   AR = Gather <axis: int = 2> (roleTable, rowI)
   output = BitwiseAnd (AR, colMask)
}
