<
   ir_version: 10,
   opset_import: ["" : 21],
   producer_name: "task354_ccp12_identity_s1span"
>
task354_ground_up_baseline127 (float[1,10,30,30] input) => (uint8[1,1,1,1] output) 
   <uint8[1,10,1,1] code = ..., bool[1,1,3,10] band = ..., float s1 =  {1}, float s255 =  {1530}, uint8 z0 = ..., uint8 z127 = ..., uint8[1,1,1,5] w_right = ..., uint8[1,1,1,5] w_left = ..., float[6] gray_roi =  {0.555556,0.0689655,0,0.555556,0.310345,0.310345}, int64[3] gray_sizes =  {1,8,10}, float[10] scale_clear =  {1,1,1,1,1,0,1,1,1,1}, int32[1] target12_i32 =  {12}, uint8[1,1,1,1] one = ..., float[1,1,1,1] gn_f, uint8[1,1,1,1] qi, float[1,1,1,1] data_clear_f, uint8[1,1,1,1] data_clear, uint8[1,1,1,1] idx_hid, int32[1,1,1,1] idx_i32, uint8[1,1,1,10] top_rev>
{
   [gn_f] gn_f = GroupNormalization <epsilon: float = 0.989012, num_groups: int = 1> (input, s1, s1)
   [qi] qi = CastLike (gn_f, z0)
   [gray] gray = Resize <axes: ints = [1, 2, 3], coordinate_transformation_mode: string = "tf_crop_and_resize", extrapolation_value: float = 0, mode: string = "nearest", nearest_mode: string = "round_prefer_floor"> (qi, gray_roi, "", gray_sizes)
   [top_rev] top_rev = QLinearConv <kernel_shape: ints = [30, 30], pads: ints = [0, 9, 29, 29]> (code, s1, z0, qi, s1, z0, s1, z0)
   [top] top = QLinearConv <kernel_shape: ints = [1, 10], pads: ints = [0, 9, 0, 9]> (one, s1, z0, top_rev, s1, z0, s1, z0)
   [band_code] band_code = Where (band, top, z127)
   [band_code_t] band_code_t = Transpose <perm: ints = [0, 1, 3, 2]> (band_code)
   [row_color] row_color = QLinearMatMul (gray, s1, z0, band_code_t, s1, z127, s1, z127)
   [row_color_t] row_color_t = Transpose <perm: ints = [0, 1, 3, 2]> (row_color)
   [candidate] candidate = QLinearMatMul (row_color_t, s255, z127, gray, s1, z0, s1, z0)
   [seeded_span] seeded_span = BitwiseAnd (candidate, band_code)
   [span_right] span_right = QLinearConv <kernel_shape: ints = [1, 5], pads: ints = [0, 4, 0, 0]> (seeded_span, s255, z127, w_right, s1, z0, s1, z0)
   [span_left] span_left = QLinearConv <kernel_shape: ints = [1, 5], pads: ints = [0, 0, 0, 4]> (seeded_span, s255, z127, w_left, s1, z0, s1, z0)
   [span] span = Max (span_right, span_left)
   [idx8] idx8 = QLinearMatMul (row_color, s1, z127, span, s1, z0, s255, z0)
   [shape12_dyn] shape12_dyn = CastLike (target12_i32, gray_sizes)
   [idx_hid] idx_hid = CenterCropPad <axes: ints = [2]> (idx8, shape12_dyn)
   [idx_i32] idx_i32 = CastLike (idx_hid, target12_i32)
   [data_clear_f] data_clear_f = GroupNormalization <epsilon: float = 0.989012, num_groups: int = 1> (input, scale_clear, scale_clear)
   [data_clear] data_clear = CastLike (data_clear_f, z0)
   [output] output = ScatterElements <axis: int = 1, reduction: string = "add"> (data_clear, idx_i32, idx_hid)
}
