<
   ir_version: 8,
   opset_import: ["" : 18],
   producer_name: "task196_combined_axes"
>
task196_where_current_combined_axes (float[1,10,30,30] input) => (uint8[1,1,1,1] output) 
   <float q_scale =  {0.00404865}, uint8 zero_u8 = ..., int8 zero_i8 = ..., bool bool_zero = ..., int8[3,1,5,5] h_w = ..., int8[1,3,5,5] mask_w = ..., int64[1] c1 =  {1}, int64[1] c2 =  {2}, int64[1] c3 =  {3}, int64[1] c4 =  {4}, int64[1] c5 =  {5}, int64[1] c6 =  {6}, int64[1] c7 =  {7}, float[1,1,1,1] cloak_f, uint8[1,1,1,1] input_u8, uint8[1,7,1,1] ch7, uint8[1,6,1,1] ch6, uint8[1,5,1,1] ch5, uint8[1,4,1,1] ch4, uint8[1,3,1,1] ch3, uint8[1,2,1,1] ch2, uint8[1,1,1,1] blue30, uint8[1,3,1,1] h_raw, uint8[1,1,1,1] g_raw, bool[1,1,1,1] g_bool, int64[2] shape_hw, int64[2] n29_hw, int64[2] n28_hw, int64[2] half_hw, uint8[1,1,1,1] shS00, uint8[1,1,1,1] shS01, uint8[1,1,1,1] shS02, uint8[1,1,1,1] shS03, uint8[1,1,1,1] shS04, uint8[1,1,1,1] shS05, uint8[1,1,1,1] shS06, uint8[1,1,1,1] shS07, uint8[1,1,1,1] shS08, uint8[1,1,1,1] shS09, uint8[1,1,1,1] shS10, uint8[1,1,1,1] shS11, uint8[1,1,1,1] shS12, uint8[1,1,1,1] shS13, uint8[1,1,1,1] shS14, uint8[1,1,1,1] shS15, uint8[1,1,1,1] shS16, uint8[1,1,1,1] shS17, uint8[1,1,1,1] shS18, uint8[1,1,1,1] shS19, uint8[1,1,1,1] blue3, bool[1,1,1,1] mkS00, bool[1,1,1,1] mkS01, bool[1,1,1,1] mkS02, bool[1,1,1,1] mkS03, bool[1,1,1,1] mkS04, bool[1,1,1,1] mkS05, bool[1,1,1,1] mkS06, bool[1,1,1,1] mkS07, bool[1,1,1,1] mkS08, bool[1,1,1,1] mkS09, bool[1,1,1,1] mkS10, bool[1,1,1,1] mkS11, bool[1,1,1,1] mkS12, bool[1,1,1,1] mkS13, bool[1,1,1,1] mkS14, bool[1,1,1,1] mkS15, bool[1,1,1,1] mkS16, bool[1,1,1,1] mkS17, bool[1,1,1,1] mkS18, bool[1,1,1,1] mkS19, bool[1,1,1,1] MaskHWShift6c, int64[1] shape_c, uint8[1,1,1,1] green_shift>
{
   [ShapeHW] shape_hw = Shape <start: int = 2> (input)
   [n29_hw] n29_hw = Sub (shape_hw, c1)
   [n28_hw] n28_hw = Sub (shape_hw, c2)
   [half_hw] half_hw = Div (shape_hw, c2)
   [CloakF] cloak_f = CenterCropPad <axes: ints = [2, 3]> (input, shape_hw)
   [CastInputU8] input_u8 = CastLike (cloak_f, zero_u8)
   [ch7] ch7 = CenterCropPad <axes: ints = [1]> (input_u8, c7)
   [ch6] ch6 = CenterCropPad <axes: ints = [1]> (ch7, c6)
   [ch5] ch5 = CenterCropPad <axes: ints = [1]> (ch6, c5)
   [ch4] ch4 = CenterCropPad <axes: ints = [1]> (ch5, c4)
   [ch3] ch3 = CenterCropPad <axes: ints = [1]> (ch4, c3)
   [ch2] ch2 = CenterCropPad <axes: ints = [1]> (ch3, c2)
   [blue30] blue30 = CenterCropPad <axes: ints = [1]> (ch2, c1)
   [shS00] shS00 = CenterCropPad <axes: ints = [2, 3]> (blue30, n29_hw)
   [shS01] shS01 = CenterCropPad <axes: ints = [2, 3]> (shS00, n28_hw)
   [shS02] shS02 = CenterCropPad <axes: ints = [2, 3]> (shS01, shape_hw)
   [shS03] shS03 = CenterCropPad <axes: ints = [2, 3]> (shS02, n29_hw)
   [shS04] shS04 = CenterCropPad <axes: ints = [2, 3]> (shS03, n28_hw)
   [shS05] shS05 = CenterCropPad <axes: ints = [2, 3]> (shS04, shape_hw)
   [shS06] shS06 = CenterCropPad <axes: ints = [2, 3]> (shS05, n29_hw)
   [shS07] shS07 = CenterCropPad <axes: ints = [2, 3]> (shS06, n28_hw)
   [shS08] shS08 = CenterCropPad <axes: ints = [2, 3]> (shS07, shape_hw)
   [shS09] shS09 = CenterCropPad <axes: ints = [2, 3]> (shS08, n29_hw)
   [shS10] shS10 = CenterCropPad <axes: ints = [2, 3]> (shS09, n28_hw)
   [shS11] shS11 = CenterCropPad <axes: ints = [2, 3]> (shS10, shape_hw)
   [shS12] shS12 = CenterCropPad <axes: ints = [2, 3]> (shS11, n29_hw)
   [shS13] shS13 = CenterCropPad <axes: ints = [2, 3]> (shS12, n28_hw)
   [shS14] shS14 = CenterCropPad <axes: ints = [2, 3]> (shS13, shape_hw)
   [shS15] shS15 = CenterCropPad <axes: ints = [2, 3]> (shS14, n29_hw)
   [shS16] shS16 = CenterCropPad <axes: ints = [2, 3]> (shS15, n28_hw)
   [shS17] shS17 = CenterCropPad <axes: ints = [2, 3]> (shS16, shape_hw)
   [shS18] shS18 = CenterCropPad <axes: ints = [2, 3]> (shS17, n29_hw)
   [shS19] shS19 = CenterCropPad <axes: ints = [2, 3]> (shS18, n28_hw)
   [blue3] blue3 = CenterCropPad <axes: ints = [2, 3]> (shS19, half_hw)
   [QLinearConvH] h_raw = QLinearConv <pads: ints = [0, 0, 4, 4]> (blue3, q_scale, zero_u8, h_w, q_scale, zero_i8, q_scale, zero_u8)
   [QLinearConvG] g_raw = QLinearConv <pads: ints = [4, 4, 0, 0]> (h_raw, q_scale, zero_u8, mask_w, q_scale, zero_i8, q_scale, zero_u8)
   [CastGBool] g_bool = CastLike (g_raw, bool_zero)
   [mkS00] mkS00 = CenterCropPad <axes: ints = [2, 3]> (g_bool, n28_hw)
   [mkS01] mkS01 = CenterCropPad <axes: ints = [2, 3]> (mkS00, n29_hw)
   [mkS02] mkS02 = CenterCropPad <axes: ints = [2, 3]> (mkS01, shape_hw)
   [mkS03] mkS03 = CenterCropPad <axes: ints = [2, 3]> (mkS02, n28_hw)
   [mkS04] mkS04 = CenterCropPad <axes: ints = [2, 3]> (mkS03, n29_hw)
   [mkS05] mkS05 = CenterCropPad <axes: ints = [2, 3]> (mkS04, shape_hw)
   [mkS06] mkS06 = CenterCropPad <axes: ints = [2, 3]> (mkS05, n28_hw)
   [mkS07] mkS07 = CenterCropPad <axes: ints = [2, 3]> (mkS06, n29_hw)
   [mkS08] mkS08 = CenterCropPad <axes: ints = [2, 3]> (mkS07, shape_hw)
   [mkS09] mkS09 = CenterCropPad <axes: ints = [2, 3]> (mkS08, n28_hw)
   [mkS10] mkS10 = CenterCropPad <axes: ints = [2, 3]> (mkS09, n29_hw)
   [mkS11] mkS11 = CenterCropPad <axes: ints = [2, 3]> (mkS10, shape_hw)
   [mkS12] mkS12 = CenterCropPad <axes: ints = [2, 3]> (mkS11, n28_hw)
   [mkS13] mkS13 = CenterCropPad <axes: ints = [2, 3]> (mkS12, n29_hw)
   [mkS14] mkS14 = CenterCropPad <axes: ints = [2, 3]> (mkS13, shape_hw)
   [mkS15] mkS15 = CenterCropPad <axes: ints = [2, 3]> (mkS14, n28_hw)
   [mkS16] mkS16 = CenterCropPad <axes: ints = [2, 3]> (mkS15, n29_hw)
   [mkS17] mkS17 = CenterCropPad <axes: ints = [2, 3]> (mkS16, shape_hw)
   [mkS18] mkS18 = CenterCropPad <axes: ints = [2, 3]> (mkS17, n28_hw)
   [mkS19] mkS19 = CenterCropPad <axes: ints = [2, 3]> (mkS18, n29_hw)
   [MaskHWShift6c] MaskHWShift6c = CenterCropPad <axes: ints = [2, 3]> (mkS19, shape_hw)
   [ShapeC] shape_c = Shape <end: int = 2, start: int = 1> (input)
   [GreenShift] green_shift = CenterCropPad <axes: ints = [1]> (ch4, shape_c)
   [WhereGreen] output = Where (MaskHWShift6c, green_shift, input_u8)
}
