<
   ir_version: 9,
   opset_import: ["" : 18],
   producer_name: "task080_improved_4d_size_flags"
>
task080_improved2 (float[1,10,30,30] input) => (bool[1,10,30,30] output) 
   <float[1] qs =  {1}, uint8[1,1,3,3] kplus = ..., float[1,10,1,1] wcol =  {2,3,4,5,6,7,8,9,10,11}, int32[5,30] idx_table =  {0,0,10,1,1,10,2,2,10,3,3,10,4,4,10,5,5,10,6,6,10,7,7,10,8,8,11,11,11,11,0,0,10,1,1,10,2,2,10,3,3,10,4,4,10,5,5,10,6,6,10,7,7,10,8,8,10,9,9,11,0,0,0,10,1,1,1,10,2,2,2,10,3,3,3,10,4,4,4,10,5,5,5,10,6,6,6,11,11,11,0,0,0,0,10,1,1,1,1,10,2,2,2,2,10,3,3,3,3,10,4,4,4,4,11,11,11,11,11,11,0,0,0,0,10,1,1,1,1,10,2,2,2,2,10,3,3,3,3,10,4,4,4,4,10,5,5,5,5,11}, uint8 c2 = ..., uint8 c3 = ..., int32[3,10] idx_cell_table =  {0,1,2,3,4,5,6,7,8,9,0,2,3,4,6,7,8,9,9,9,0,2,4,5,7,9,3,3,3,3}, uint8 eight_u8 = ..., int32[2] axes23 =  {2,3}, int64[4] pad_hw =  {0,0,1,1}, int64[2] pad_axes23 =  {2,3}, int64[1] shape_one =  {1}, int32 three_i32_vec =  {3}, int32[2] starts, int32[2] ends, uint8[1,1,3,3] Kdyn2, uint8[1,1,1,1] C>
{
   [cf3] cf3 = Conv <strides: ints = [3, 3]> (input, wcol)
   [cells2] cells2 = Cast <to: int = 2> (cf3)
   [Lall] Lall = Conv <pads: ints = [-2, -19, 0, 0], strides: ints = [30, 30]> (input, wcol)
   [Lall_u8] Lall_u8 = Cast <to: int = 2> (Lall)
   [r1row] r1row = MaxPool <kernel_shape: ints = [1, 1], pads: ints = [-1, 0, 0, 0], strides: ints = [10, 10]> (cells2)
   [is_sp4_4d] is_sp4_4d = Equal (r1row, Lall_u8)
   [sp4_u8_4d] sp4_u8_4d = Cast <to: int = 2> (is_sp4_4d)
   [last_cell] last_cell = MaxPool <kernel_shape: ints = [1, 1], pads: ints = [-9, -9, 0, 0], strides: ints = [10, 10]> (cells2)
   [r3row] r3row = MaxPool <kernel_shape: ints = [1, 1], pads: ints = [-3, 0, 0, 0], strides: ints = [10, 10]> (cells2)
   [is_sp5_4d] is_sp5_4d = Equal (r3row, Lall_u8)
   [cell_case_4d] cell_case_4d = Where (is_sp5_4d, c2, sp4_u8_4d)
   [cell_case_u8] cell_case_u8 = Squeeze (cell_case_4d)
   [cell_case_i] cell_case_i = Cast <to: int = 6> (cell_case_u8)
   [idxCell] idxCell = Gather <axis: int = 0> (idx_cell_table, cell_case_i)
   [cell_r] cell_r = Gather <axis: int = 2> (cells2, idxCell)
   [cells] cells = Gather <axis: int = 3> (cell_r, idxCell)
   [plus_cnt] plus_cnt = QLinearConv (cells, qs, c2, kplus, qs, c2, qs, c2)
   [max_all_val] max_all_val, idx_all = MaxPool <kernel_shape: ints = [8, 8], strides: ints = [1, 1]> (plus_cnt)
   [max4_val] max4_val, idx4 = MaxPool <kernel_shape: ints = [4, 4], pads: ints = [0, 0, -4, -4], strides: ints = [1, 1]> (plus_cnt)
   [idx_all_u8] idx_all_u8 = Cast <to: int = 2> (idx_all)
   [idx4_u8] idx4_u8 = Cast <to: int = 2> (idx4)
   [idx_chosen_u8] idx_chosen_u8 = Where (is_sp5_4d, idx4_u8, idx_all_u8)
   [idx_flat_u8] idx_flat_u8 = Reshape (idx_chosen_u8, shape_one)
   [row_idx_u8] row_idx_u8 = BitShift <direction: string = "RIGHT"> (idx_flat_u8, c3)
   [col_idx_u8] col_idx_u8 = Mod (idx_flat_u8, eight_u8)
   [starts_u8] starts_u8 = Concat <axis: int = 0> (row_idx_u8, col_idx_u8)
   [starts] starts = Cast <to: int = 6> (starts_u8)
   [ends] ends = Add (starts, three_i32_vec)
   [Kdyn2] Kdyn2 = Slice (cells, starts, ends, axes23)
   [C] C = MaxPool <kernel_shape: ints = [1, 1], pads: ints = [-1, -1, -1, -1], strides: ints = [1, 1]> (Kdyn2)
   [cenb] cenb = Equal (cells, C)
   [cen_u8] cen_u8 = Where (cenb, c3, c2)
   [out_cells] out_cells = QLinearConv <pads: ints = [1, 1, 1, 1]> (cen_u8, qs, c2, Kdyn2, qs, c2, qs, c2)
   [case_p2_4d] case_p2_4d = Sign (last_cell)
   [case_p5_4d] case_p5_4d = Add (c3, case_p2_4d)
   [case_b_4d] case_b_4d = Where (is_sp5_4d, case_p5_4d, case_p2_4d)
   [case_4d] case_4d = Where (is_sp4_4d, c2, case_b_4d)
   [case_u8] case_u8 = Squeeze (case_4d)
   [case_i] case_i = Cast <to: int = 6> (case_u8)
   [idxSel] idxSel = Gather <axis: int = 0> (idx_table, case_i)
   [grid11] grid11 = Pad (out_cells, pad_hw, Lall_u8, pad_axes23)
   [table] table = Pad (grid11, pad_hw, "", pad_axes23)
   [g1] g1 = Gather <axis: int = 2> (table, idxSel)
   [res] res = Gather <axis: int = 3> (g1, idxSel)
   [kvec_u8] kvec_u8 = Cast <to: int = 2> (wcol)
   [output] output = Equal (res, kvec_u8)
}
