<
   ir_version: 10,
   opset_import: ["" : 18],
   producer_name: "openai"
>
task138_v4 (float[1,10,30,30] input) => (bool[1,10,30,30] output) 
   <uint8[1] u8_1 = ..., uint8[1] u8_254 = ..., uint8[1] u8_255 = ..., float16[2,30] pow_table = ..., uint8[1,1,30,1] qrow = ..., uint8[1,1,1,30] qcol = ..., uint8[1,1,1,30] CL = ..., int32[10] role_base =  {0,-2,-2,-2,-2,-2,-2,-2,-2,-2}, uint8[1] i64_0__int16 = ..., uint8[1] u8_29 = ..., int64[3] axes_row =  {0,1,3}, uint8[1,1,1,2] CRpair_u4 = ..., int32[6] line_role_updates6 =  {2,3,4,-1,1,0}, float16[10] line_channel_weights = ..., float16[1] one_f16 = ..., int64[1,1,1,2] col_gather_idx =  {0,1}, float16[10] seed_color_weights_f16 = ..., float16[1] K_f16 = ..., float16[1] zero_f16 = ..., float16[2] sel0_f16 = ..., float16[2] sel1_f16 = ..., float16[1] row_score, float16[1] col_score, int32[6] line_colors__cast_int32, uint8[1] lo_axis, uint8[1] hi_axis, uint8[1] rev_bias, uint8[1] seed_bias64, float16[1] seed_bias_f, float16[1] seed_scale, float16[2] reverse_selector, float16[30] rowcode, float16[30] colcode, float16[30] seed_code, float16[30] seed_log, uint8[30] seed_distance_abs, uint8[1] offset, int8[1] offset__cast_int16, int8[1] neg_offset, int8[2] seed_pads, int64[2] seed_pads__cast_int64, uint8[30] p, uint8[1] hspan64, uint8[1] wspan64, uint8[2] row_corner_idx2, uint8[2] col_corner_idx2, uint8[1,1,2,1] row_corner_idx, int32[1,1,2,1] row_corner_idx__cast_int32, uint8[1,1,1,2] col_corner_idx, int32[1,1,1,2] col_corner_idx__cast_int32, uint8[2] TLpair_u2, uint8[1,1,2,1] TLpair_u4, uint8[1,1,30,1] TL, uint8[2] TRpair_u2, uint8[1,1,2,1] TRpair_u4, uint8[1,1,30,1] TR, uint8[2] CTpair_u2, uint8[1,1,1,2] CTpair_u4, uint8[1,1,1,30] CT, uint8[2] CBpair_u2, uint8[1,1,1,2] CBpair_u4, uint8[1,1,1,30] CB, uint8[1,1,1,30] CR, uint8[1,1,30,1] prow, uint8[1,1,1,30] revcol, uint8[1,1,1,30] zcol, uint8[1,1,30,1] revrow, uint8[1,1,30,1] zrow, uint8[1,1,30,1] tdraw_h_inner, uint8[1,1,30,1] tdraw_h_base, uint8[1,1,30,1] tdraw_h, uint8[1,1,30,1] TDRAW, uint8[1,1,1,30] cdraw_h, uint8[1,1,1,30] cdraw_v_base, uint8[1,1,1,30] cdraw_v, uint8[1,1,1,30] CDRAW, int32[10] rolemap, uint8[1,7,30,1] Ttable, uint8[1,6,1,30] Ctable, uint8[1,10,30,1] Tcolor, uint8[1,10,1,30] Ccolor, float16[1] interior_n, float16[1] interior_color_sum, float16[1] draw_color_f, bool[1] isL, bool[1] isR, bool[1] isB, bool[1] is_h, bool[1] reverse, uint8[6] line_colors, uint8[1] draw_color_plus_u8, int64[1] q_abs_shape, uint8[1,1,1,1] qcol_abs_hid, float16[1,1,1,1] qcol_abs_f16, float16[1] left1_f16, float16[1] right1_f16, float16[1] up1_f16, float16[1] down1_f16, bool[1,1,1,1] c_ge_abs, bool[1,1,1,1] c_le_abs, bool[1,1,1,1] r_ge_abs, bool[1,1,1,1] r_le_abs, float16[1,1,1,1] c_ge_f, float16[1,1,1,1] c_le_f, float16[1,1,1,1] r_ge_f, float16[1,1,1,1] r_le_f, uint8[1,1,30,1] TBG2_inner, uint8[1,1,1,30] CBG2_inner, uint8[1,1,30,1] TBG2, uint8[1,1,1,30] CBG2, float16[1] up_f16, bool[1,1,1,1] up_ge_b, bool[1,1,1,1] up_le_b, float16[1,1,1,1] up_ge_f, float16[1,1,1,1] up_le_f, float16[1] down_f16, bool[1,1,1,1] down_ge_b, bool[1,1,1,1] down_le_b, float16[1,1,1,1] down_ge_f, float16[1,1,1,1] down_le_f, float16[1] left_f16, bool[1,1,1,1] left_ge_b, bool[1,1,1,1] left_le_b, float16[1,1,1,1] left_ge_f, float16[1,1,1,1] left_le_f, float16[1] right_f16, bool[1,1,1,1] right_ge_b, bool[1,1,1,1] right_le_b, float16[1,1,1,1] right_ge_f, float16[1,1,1,1] right_le_f, float16[1] tl_color_f, float16[1] tr_color_f, float16[1] bl_color_f, float16[1] br_color_f, bool[1] not_a_b, bool[1] not_b_b, bool[1] not_c_b, bool[1] not_d_b, uint8[1] not_a, uint8[1] not_b, uint8[1] not_c, uint8[1] not_d, float16[1] Tcol_f, float16[1] Bcol_f, float16[1] Lcol_f, float16[1] Rcol_f, uint8[1] Tcol, uint8[1] Bcol, uint8[1] Lcol, uint8[1] Rcol, uint8[1] up, uint8[1] down, uint8[1] left, uint8[1] right, uint8[1,1,30,1] row_line_base, uint8[1,1,2,1] TDHnot_u4, uint8[1,1,2,1] TDHpair_u4, uint8[1,1,1,2] CDVpair_u4, int64[1] up64, int64[1] down64, int64[1] left64, int64[1] right64, uint8[1,1,1,1] qrow_abs_hid, float16[1,1,1,1] qrow_abs_f16, float16[1] hspan_m1_f16, bool[1,1,1,1] rinner_le, float16[1] wspan_m1_f16, bool[1,1,1,1] cinner_le, uint8[1,1,1,30] cinner_u8, float[1,1,1,1] input_hid, float16[1,1,1,1] input_f16, float16[1] seed_neg_bias_shifted, bool[1,1,1,1] zero_le_b, float16[1,1,1,1] zero_le_f>
{
   [q_abs_shape] q_abs_shape = Shape <end: int = 4, start: int = 3> (qcol)
   [input_hid] input_hid = CenterCropPad <axes: ints = [2]> (input, q_abs_shape)
   [input_f16] input_f16 = CastLike (input_hid, one_f16)
   [row_score] row_score = Einsum <equation: string = "bkrc,k->r"> (input_f16, seed_color_weights_f16)
   [col_score] col_score = Einsum <equation: string = "bkrc,k->c"> (input_f16, seed_color_weights_f16)
   [up64] up64 = ArgMax <axis: int = 0, keepdims: int = 1, select_last_index: int = 0> (row_score)
   [up] up = Cast <to: int = 2> (up64)
   [down64] down64 = ArgMax <axis: int = 0, keepdims: int = 1, select_last_index: int = 1> (row_score)
   [down] down = Cast <to: int = 2> (down64)
   [left64] left64 = ArgMax <axis: int = 0, keepdims: int = 1, select_last_index: int = 0> (col_score)
   [left] left = Cast <to: int = 2> (left64)
   [right64] right64 = ArgMax <axis: int = 0, keepdims: int = 1, select_last_index: int = 1> (col_score)
   [right] right = Cast <to: int = 2> (right64)
   [left_f16] left_f16 = Cast <to: int = 10> (left)
   [right_f16] right_f16 = Cast <to: int = 10> (right)
   [up_f16] up_f16 = Cast <to: int = 10> (up)
   [down_f16] down_f16 = Cast <to: int = 10> (down)
   [left1_f16] left1_f16 = Add (left_f16, one_f16)
   [right1_f16] right1_f16 = Sub (right_f16, one_f16)
   [up1_f16] up1_f16 = Add (up_f16, one_f16)
   [down1_f16] down1_f16 = Sub (down_f16, one_f16)
   [qcol_abs_hid] qcol_abs_hid = CenterCropPad <axes: ints = [3]> (qcol, q_abs_shape)
   [qcol_abs_f16] qcol_abs_f16 = CastLike (qcol_abs_hid, left1_f16)
   [zero_le_b] zero_le_b = LessOrEqual (qcol_abs_f16, zero_f16)
   [zero_le_f] zero_le_f = CastLike (zero_le_b, one_f16)
   [c_ge_abs] c_ge_abs = GreaterOrEqual (qcol_abs_f16, left1_f16)
   [c_le_abs] c_le_abs = LessOrEqual (qcol_abs_f16, right1_f16)
   [r_ge_abs] r_ge_abs = GreaterOrEqual (qcol_abs_f16, up1_f16)
   [r_le_abs] r_le_abs = LessOrEqual (qcol_abs_f16, down1_f16)
   [c_ge_f] c_ge_f = CastLike (c_ge_abs, one_f16)
   [c_le_f] c_le_f = CastLike (c_le_abs, one_f16)
   [r_ge_f] r_ge_f = CastLike (r_ge_abs, one_f16)
   [r_le_f] r_le_f = CastLike (r_le_abs, one_f16)
   interior_n = Einsum <equation: string = "bkrc,k,mnor,uvor,mnpc,uvpc->b"> (input_f16, seed_color_weights_f16, r_ge_f, r_le_f, c_ge_f, c_le_f)
   interior_color_sum = Einsum <equation: string = "bkrc,k,mnor,uvor,mnpc,uvpc->b"> (input_f16, line_channel_weights, r_ge_f, r_le_f, c_ge_f, c_le_f)
   draw_color_f = Div (interior_color_sum, interior_n)
   draw_color_plus_u8 = Cast <to: int = 2> (draw_color_f)
   [up_ge_b] up_ge_b = GreaterOrEqual (qcol_abs_f16, up_f16)
   [up_le_b] up_le_b = LessOrEqual (qcol_abs_f16, up_f16)
   [up_ge_f] up_ge_f = CastLike (up_ge_b, one_f16)
   [up_le_f] up_le_f = CastLike (up_le_b, one_f16)
   [down_ge_b] down_ge_b = GreaterOrEqual (qcol_abs_f16, down_f16)
   [down_le_b] down_le_b = LessOrEqual (qcol_abs_f16, down_f16)
   [down_ge_f] down_ge_f = CastLike (down_ge_b, one_f16)
   [down_le_f] down_le_f = CastLike (down_le_b, one_f16)
   [left_ge_b] left_ge_b = GreaterOrEqual (qcol_abs_f16, left_f16)
   [left_le_b] left_le_b = LessOrEqual (qcol_abs_f16, left_f16)
   [left_ge_f] left_ge_f = CastLike (left_ge_b, one_f16)
   [left_le_f] left_le_f = CastLike (left_le_b, one_f16)
   [right_ge_b] right_ge_b = GreaterOrEqual (qcol_abs_f16, right_f16)
   [right_le_b] right_le_b = LessOrEqual (qcol_abs_f16, right_f16)
   [right_ge_f] right_ge_f = CastLike (right_ge_b, one_f16)
   [right_le_f] right_le_f = CastLike (right_le_b, one_f16)
   [Tcol_f] Tcol_f = Einsum <equation: string = "bkrc,k,mnor,uvor,mnpc,uvpc->b"> (input_f16, line_channel_weights, up_ge_f, up_le_f, zero_le_f, zero_le_f)
   [Bcol_f] Bcol_f = Einsum <equation: string = "bkrc,k,mnor,uvor,mnpc,uvpc->b"> (input_f16, line_channel_weights, down_ge_f, down_le_f, zero_le_f, zero_le_f)
   [Lcol_f] Lcol_f = Einsum <equation: string = "bkrc,k,mnor,uvor,mnpc,uvpc->b"> (input_f16, line_channel_weights, zero_le_f, zero_le_f, left_ge_f, left_le_f)
   [Rcol_f] Rcol_f = Einsum <equation: string = "bkrc,k,mnor,uvor,mnpc,uvpc->b"> (input_f16, line_channel_weights, zero_le_f, zero_le_f, right_ge_f, right_le_f)
   [Tcol] Tcol = Cast <to: int = 2> (Tcol_f)
   [Bcol] Bcol = Cast <to: int = 2> (Bcol_f)
   [Lcol] Lcol = Cast <to: int = 2> (Lcol_f)
   [Rcol] Rcol = Cast <to: int = 2> (Rcol_f)
   isL = Equal (draw_color_plus_u8, Lcol)
   isR = Equal (draw_color_plus_u8, Rcol)
   isB = Equal (draw_color_plus_u8, Bcol)
   is_h = Or (isL, isR)
   reverse = Or (isR, isB)
   [reverse_selector] reverse_selector = Where (reverse, sel1_f16, sel0_f16)
   [tl_color_f] tl_color_f = Einsum <equation: string = "bkrc,k,mnor,uvor,mnpc,uvpc->b"> (input_f16, line_channel_weights, up_ge_f, up_le_f, left_ge_f, left_le_f)
   [tr_color_f] tr_color_f = Einsum <equation: string = "bkrc,k,mnor,uvor,mnpc,uvpc->b"> (input_f16, line_channel_weights, up_ge_f, up_le_f, right_ge_f, right_le_f)
   [bl_color_f] bl_color_f = Einsum <equation: string = "bkrc,k,mnor,uvor,mnpc,uvpc->b"> (input_f16, line_channel_weights, down_ge_f, down_le_f, left_ge_f, left_le_f)
   [br_color_f] br_color_f = Einsum <equation: string = "bkrc,k,mnor,uvor,mnpc,uvpc->b"> (input_f16, line_channel_weights, down_ge_f, down_le_f, right_ge_f, right_le_f)
   [not_a_b] not_a_b = Equal (tl_color_f, Tcol_f)
   [not_b_b] not_b_b = Equal (tr_color_f, Tcol_f)
   [not_c_b] not_c_b = Equal (bl_color_f, Bcol_f)
   [not_d_b] not_d_b = Equal (br_color_f, Bcol_f)
   [not_a] not_a = Cast <to: int = 2> (not_a_b)
   [not_b] not_b = Cast <to: int = 2> (not_b_b)
   [not_c] not_c = Cast <to: int = 2> (not_c_b)
   [not_d] not_d = Cast <to: int = 2> (not_d_b)
   [lo_axis] lo_axis = Where (is_h, left, up)
   [hi_axis] hi_axis = Where (is_h, right, down)
   [rev_bias] rev_bias = Sub (u8_29, hi_axis)
   [seed_bias64] seed_bias64 = Where (reverse, rev_bias, lo_axis)
   [seed_bias_f] seed_bias_f = Cast <to: int = 10> (seed_bias64)
   [seed_neg_bias_shifted] seed_neg_bias_shifted = Sub (K_f16, seed_bias_f)
   [seed_scale] seed_scale = Exp (seed_neg_bias_shifted)
   [rowcode] rowcode = Einsum <equation: string = "xr,x,yr,y,bkrc,k,dc,d,mnpc,uvpc,s->r"> (pow_table, sel0_f16, pow_table, sel1_f16, input_f16, seed_color_weights_f16, pow_table, reverse_selector, c_ge_f, c_le_f, seed_scale)
   [colcode] colcode = Einsum <equation: string = "xc,x,yc,y,bkrc,k,dr,d,mnor,uvor,mnpc,uvpc,s->c"> (pow_table, sel0_f16, pow_table, sel1_f16, input_f16, seed_color_weights_f16, pow_table, reverse_selector, r_ge_f, r_le_f, c_ge_f, c_le_f, seed_scale)
   [seed_code] seed_code = Where (is_h, rowcode, colcode)
   [seed_log] seed_log = Log (seed_code)
   [seed_distance_abs] seed_distance_abs = Cast <to: int = 2> (seed_log)
   [offset] offset = Where (is_h, up, left)
   [offset__cast_int16] offset__cast_int16 = Cast <to: int = 3> (offset)
   [neg_offset] neg_offset = Neg (offset__cast_int16)
   [seed_pads] seed_pads = Concat <axis: int = 0> (neg_offset, offset__cast_int16)
   [seed_pads__cast_int64] seed_pads__cast_int64 = Cast <to: int = 7> (seed_pads)
   [p] p = Pad <mode: string = "constant"> (seed_distance_abs, seed_pads__cast_int64, i64_0__int16)
   [hspan64] hspan64 = Sub (down, up)
   [wspan64] wspan64 = Sub (right, left)
   [qrow_abs_hid] qrow_abs_hid = CenterCropPad <axes: ints = [2]> (qrow, q_abs_shape)
   [qrow_abs_f16] qrow_abs_f16 = CastLike (qrow_abs_hid, left1_f16)
   [hspan_m1_f16] hspan_m1_f16 = Sub (down1_f16, up_f16)
   [wspan_m1_f16] wspan_m1_f16 = Sub (right1_f16, left_f16)
   [cinner_le] cinner_le = LessOrEqual (qcol_abs_f16, wspan_m1_f16)
   [cinner_u8] cinner_u8 = Where (cinner_le, u8_1, CL)
   [cinner] cinner = Greater (cinner_u8, CL)
   [rinner_le] rinner_le = LessOrEqual (qrow_abs_f16, hspan_m1_f16)
   [row_corner_idx2] row_corner_idx2 = Concat <axis: int = 0> (i64_0__int16, hspan64)
   [col_corner_idx2] col_corner_idx2 = Concat <axis: int = 0> (i64_0__int16, wspan64)
   [row_corner_idx] row_corner_idx = Unsqueeze (row_corner_idx2, axes_row)
   [row_corner_idx__cast_int32] row_corner_idx__cast_int32 = Cast <to: int = 6> (row_corner_idx)
   [col_corner_idx] col_corner_idx = Gather <axis: int = 0> (col_corner_idx2, col_gather_idx)
   [col_corner_idx__cast_int32] col_corner_idx__cast_int32 = Cast <to: int = 6> (col_corner_idx)
   [row_line_base] row_line_base = Where (rinner_le, i64_0__int16, qrow)
   [rinner] rinner = Greater (qrow, row_line_base)
   [TLpair_u2] TLpair_u2 = Concat <axis: int = 0> (not_a, not_c)
   [TLpair_u4] TLpair_u4 = Unsqueeze (TLpair_u2, axes_row)
   [TL] TL = ScatterElements <axis: int = 2, reduction: string = "none"> (row_line_base, row_corner_idx__cast_int32, TLpair_u4)
   [TRpair_u2] TRpair_u2 = Concat <axis: int = 0> (not_b, not_d)
   [TRpair_u4] TRpair_u4 = Unsqueeze (TRpair_u2, axes_row)
   [TR] TR = ScatterElements <axis: int = 2, reduction: string = "none"> (row_line_base, row_corner_idx__cast_int32, TRpair_u4)
   [CTpair_u2] CTpair_u2 = Concat <axis: int = 0> (not_a, not_b)
   [CTpair_u4] CTpair_u4 = Gather <axis: int = 0> (CTpair_u2, col_gather_idx)
   [CT] CT = ScatterElements <axis: int = 3, reduction: string = "none"> (cinner_u8, col_corner_idx__cast_int32, CTpair_u4)
   [CBpair_u2] CBpair_u2 = Concat <axis: int = 0> (not_c, not_d)
   [CBpair_u4] CBpair_u4 = Gather <axis: int = 0> (CBpair_u2, col_gather_idx)
   [CB] CB = ScatterElements <axis: int = 3, reduction: string = "none"> (cinner_u8, col_corner_idx__cast_int32, CBpair_u4)
   [CR] CR = ScatterElements <axis: int = 3, reduction: string = "none"> (CL, col_corner_idx__cast_int32, CRpair_u4)
   [prow] prow = Unsqueeze (p, axes_row)
   [revcol] revcol = Sub (wspan64, qcol)
   [zcol] zcol = Where (isR, revcol, qcol)
   [revrow] revrow = Sub (hspan64, qrow)
   [zrow] zrow = Where (isB, revrow, qrow)
   [tdraw_h_inner] tdraw_h_inner = Sub (u8_254, prow)
   [tdraw_h_base] tdraw_h_base = Where (rinner, tdraw_h_inner, u8_255)
   [TDHnot_u4] TDHnot_u4 = Where (isL, TLpair_u4, TRpair_u4)
   [TDHpair_u4] TDHpair_u4 = Add (u8_254, TDHnot_u4)
   [tdraw_h] tdraw_h = ScatterElements <axis: int = 2, reduction: string = "none"> (tdraw_h_base, row_corner_idx__cast_int32, TDHpair_u4)
   [TDRAW] TDRAW = Where (is_h, tdraw_h, zrow)
   [cdraw_h] cdraw_h = Sub (u8_255, zcol)
   [cdraw_v_base] cdraw_v_base = Add (p, cinner_u8)
   [CDVpair_u4] CDVpair_u4 = Where (reverse, CBpair_u4, CTpair_u4)
   [cdraw_v] cdraw_v = ScatterElements <axis: int = 3, reduction: string = "none"> (cdraw_v_base, col_corner_idx__cast_int32, CDVpair_u4)
   [CDRAW] CDRAW = Where (is_h, cdraw_h, cdraw_v)
   [TBG2_inner] TBG2_inner = Sub (u8_254, TDRAW)
   [CBG2_inner] CBG2_inner = Sub (u8_255, CDRAW)
   [TBG2] TBG2 = Where (rinner, TBG2_inner, u8_255)
   [CBG2] CBG2 = Where (cinner, CBG2_inner, i64_0__int16)
   [line_colors] line_colors = Concat <axis: int = 0> (Lcol, Rcol, Tcol, Bcol, draw_color_plus_u8, i64_0__int16)
   [line_colors__cast_int32] line_colors__cast_int32 = Cast <to: int = 6> (line_colors)
   [rolemap] rolemap = ScatterElements <axis: int = 0> (role_base, line_colors__cast_int32, line_role_updates6)
   [Ttable] Ttable = Concat <axis: int = 1> (TBG2, TDRAW, TL, TR, qrow, tdraw_h_inner, revrow)
   [Ctable] Ctable = Concat <axis: int = 1> (CBG2, CDRAW, CL, CR, CT, CB)
   [Tcolor] Tcolor = Gather <axis: int = 1> (Ttable, rolemap)
   [Ccolor] Ccolor = Gather <axis: int = 1> (Ctable, rolemap)
   [output] output = Greater (Ccolor, Tcolor)
}
