<
   ir_version: 9,
   opset_import: ["" : 18],
   doc_string: ""
>
task165_rebuild_v2 (float[1,10,30,30] input) => (uint8[1,10,1,1] output) 
   <int64[1] one_i64 =  {1}, int32[2] source_axes =  {2,3}, uint8[1,1,17,1] elig_row_idx_p1 = ..., uint8[1,1,1,7] lowest_m2_p1 = ..., float16[30] idx_vec = ..., float16 ten_f = ..., uint8[1] two_u8 = ..., uint8 ten_u8 = ..., uint8 seventeen_u8 = ..., uint8[1] thr_3_u8 = ..., uint8[1] thr_4_u8 = ..., int64[1] s7_win =  {7}, int32[1] one_i32 =  {1}, uint8[1] eleven_u8 = ..., uint8[1] one_u8 = ..., int64[3] axes_counts =  {0,2,3}, float[1,1,1,1] __sp_hid, uint8[1,1,1,1] __sp_low, uint8[1,10,1,1] source, int32[2] cstarts, int32[2] cends, int64[1,1,1,7] btm_idx, int64[1,1,1] scol_arg, uint8[1,1,1,7] elig_threshold, uint8[1,1,1,7] btm_i8, uint8[1,1,1,7] fill_threshold, uint8[1,1,1,1,1,1] srow_raw, uint8[1] srow, uint8[1,1,1,7] bg7, bool[1,1,1,7] actb, float16[1] counts, float16[1] row_sum, float16[1] col_sum, bool[1] count_good, uint8[1] good_u8, int64 low_idx, int64 high_idx, float16 col_high, uint8[1] absrow_u8, uint8[1,1,1,1] __sp_low2, uint8[1,1,1] scol_arg_u8, uint8[1] scol_u8, uint8[1] abscol_u8, uint8[2] cstarts_u8, bool[1,1,17,7] fillbase7, bool[1,1,1,1] fb0, bool[1,1,1,1] fill30_dyn, int64[1] s9_ch, int64[1] s10_ch, int64[1] s11_ch, int64[1] s18_row, uint8[1,1,1,1] bg_ch0_a, uint8 bg_ch0_b, uint8[1,1,1,1] bg_ch0_c, uint8[1,1,1,1] bg_ch1_a, uint8 bg_ch1_b, uint8[1,1,1,1] bg_ch1_c, uint8[1,1,1,1] bg_ch2_a, uint8 bg_ch2_b, uint8[1,1,1,1] bg_ch2_c, uint8[1,1,1,1] bg_ch3_a, uint8 bg_ch3_b, uint8[1,1,1,1] bg_ch3_c, uint8[1,1,1,1] bg_ch0, uint8[1] d_shift, uint8[1] d_minus4, uint8[1] rem4, bool[1] cond4, bool[1] cond3, bool[1] cond2, bool[1] cond1, int64[1] shift_blk4, int64[1] shift_blk3, int64[1] shift_blk2, int64[1] shift_blk1, uint8[1,1,1,1] bg_b3_a, uint8[1,1,1,1] bg_b3_b, uint8[1,1,1,1] bg_b3_c, uint8[1,1,1,1] bg_b4_a, uint8[1,1,1,1] bg_b4_b, uint8[1,1,1,1] bg_b4_c, uint8[1,1,1,1] bg_b5_a, uint8[1,1,1,1] bg_b5_b, uint8[1,1,1,1] bg_b5_c, uint8[1,1,1,1] bg_b7_a, uint8[1,1,1,1] bg_b7_b, uint8[1,1,1,1] bg_b7_c, uint8[1,1,1,1] bg_b8_a, uint8[1,1,1,1] bg_b8_b, uint8[1,1,1,1] bg_b8_c, uint8[1,1,1,1] bg_b9_a, uint8[1,1,1,1] bg_b9_b, uint8[1,1,1,1] bg_b9_c, bool[1,1,1,1] fh_b3_a, bool[1,1,1,1] fh_b3_b, bool[1,1,1,1] fh_b3_c, bool[1,1,1,1] fh_b4_a, bool[1,1,1,1] fh_b4_b, bool[1,1,1,1] fh_b4_c, bool[1,1,1,1] fh_b5_a, bool[1,1,1,1] fh_b5_b, bool[1,1,1,1] fh_b5_c, bool[1,1,1,1] fh_b7_a, bool[1,1,1,1] fh_b7_b, bool[1,1,1,1] fh_b7_c, bool[1,1,1,1] fh_b8_a, bool[1,1,1,1] fh_b8_b, bool[1,1,1,1] fh_b8_c, bool[1,1,1,1] fh_b9_a, bool[1,1,1,1] fh_b9_b, bool[1,1,1,1] pair0_a, bool[1,1,1,1] pair0_vb, bool[1,1,1,1] pair0_hb, bool[1,1,1,1] pair0_c, bool[1,1,1,1] pair1_a, bool[1,1,1,1] pair1_vb, bool[1,1,1,1] pair1_hb, bool[1,1,1,1] pair1_c, bool[1,1,1,1] pair2_a, bool[1,1,1,1] pair2_vb, bool[1,1,1,1] pair2_hb, bool[1,1,1,1] pair2_c, uint8[1,1,1,1] bg_pair0_ra, uint8[1,1,1,1] bg_pair0_ha, uint8[1,1,1,1] bg_pair0_b, uint8[1,1,1,1] bg_pair0_c, uint8[1,1,1,1] bg_pair1_ra, uint8[1,1,1,1] bg_pair1_ha, uint8[1,1,1,1] bg_pair1_b, uint8[1,1,1,1] bg_pair1_c, uint8[1,1,1,1] bg_pair2_ra, uint8[1,1,1,1] bg_pair2_ha, uint8[1,1,1,1] bg_pair2_b, uint8[1,1,1,1] bg_pair2_c, uint8[1,1,1,1] bg_row3_a, uint8[1,1,1,1] bg_row18, float16[1,1,1,1] __sp_f16_c9, float16 col_low, float16 row_low, float16 row_high, uint8[1] rem2b, uint8 col_high_u8, uint8 col_low_u8, uint8 row_low_u8, uint8 row_high_u8, uint8 col_high_mod_u8, bool[1] col_high_good, uint8[1] kite_row_u8, uint8[1] kite_col_u8, uint8 __sp_cnt_c11, uint8[1,1,1,1] __sp_cnt_c9>
{
   [s31_shift] s31_shift = ConstantOfShape <value: tensor = int64[1] s31_shift_val {31}> (one_i64)
   [s29_shift] s29_shift = ConstantOfShape <value: tensor = int64[1] s29_shift_val {29}> (one_i64)
   [s30_shift] s30_shift = ConstantOfShape <value: tensor = int64[1] s30_shift_val {30}> (one_i64)
   [__sp_hid] __sp_hid = CenterCropPad <axes: ints = [2, 3]> (input, s30_shift)
   [__sp_low] __sp_low = CastLike (__sp_hid, seventeen_u8)
   [__sp_low2] __sp_low2 = CastLike (__sp_hid, seventeen_u8)
   [s9_ch] s9_ch = ConstantOfShape <value: tensor = int64[1] s9_ch_val {9}> (one_i64)
   [s10_ch] s10_ch = ConstantOfShape <value: tensor = int64[1] s10_ch_val {10}> (one_i64)
   [s11_ch] s11_ch = ConstantOfShape <value: tensor = int64[1] s11_ch_val {11}> (one_i64)
   [__sp_cnt_c11] __sp_cnt_c11 = CenterCropPad <axes: ints = [1]> (__sp_low2, s11_ch)
   [__sp_cnt_c9] __sp_cnt_c9 = CenterCropPad <axes: ints = [1]> (__sp_cnt_c11, s9_ch)
   [__sp_f16_c9] __sp_f16_c9 = CastLike (__sp_cnt_c9, ten_f)
   [counts] counts = ReduceSumSquare <keepdims: int = 0> (__sp_f16_c9, axes_counts)
   [row_sum] row_sum = Einsum <equation: string = "nchw,h->c"> (__sp_f16_c9, idx_vec)
   [col_sum] col_sum = Einsum <equation: string = "nchw,w->c"> (__sp_f16_c9, idx_vec)
   [count_good] count_good = Equal (counts, ten_f)
   [good_u8] good_u8 = CastLike (count_good, seventeen_u8)
   [low_idx] low_idx = ArgMax <axis: int = 0, keepdims: int = 0, select_last_index: int = 0> (good_u8)
   [high_idx] high_idx = ArgMax <axis: int = 0, keepdims: int = 0, select_last_index: int = 1> (good_u8)
   [col_high] col_high = Gather <axis: int = 0> (col_sum, high_idx)
   [col_low] col_low = Gather <axis: int = 0> (col_sum, low_idx)
   [row_low] row_low = Gather <axis: int = 0> (row_sum, low_idx)
   [row_high] row_high = Gather <axis: int = 0> (row_sum, high_idx)
   [col_high_u8] col_high_u8 = Cast <to: int = 2> (col_high)
   [col_low_u8] col_low_u8 = Cast <to: int = 2> (col_low)
   [row_low_u8] row_low_u8 = Cast <to: int = 2> (row_low)
   [row_high_u8] row_high_u8 = Cast <to: int = 2> (row_high)
   [col_high_mod_u8] col_high_mod_u8 = Mod <fmod: int = 0> (col_high_u8, ten_u8)
   [col_high_good] col_high_good = Less (col_high_mod_u8, one_u8)
   [kite_row_u8] kite_row_u8 = Where (col_high_good, row_high_u8, row_low_u8)
   [kite_col_u8] kite_col_u8 = Where (col_high_good, col_high_u8, col_low_u8)
   [kite_row_i64] kite_row_i64 = Div (kite_row_u8, ten_u8)
   [kite_col_i64] kite_col_i64 = Div (kite_col_u8, ten_u8)
   [left_s_2d] left_s_2d = Sub (kite_col_i64, thr_3_u8)
   [s18_row] s18_row = ConstantOfShape <value: tensor = int64[1] s18_row_val {18}> (one_i64)
   [d_shift] d_shift = Sub (eleven_u8, left_s_2d)
   [cond4] cond4 = Greater (d_shift, thr_3_u8)
   [d_minus4] d_minus4 = Sub (d_shift, thr_4_u8)
   [rem4] rem4 = Where (cond4, d_minus4, d_shift)
   [cond3] cond3 = Greater (rem4, one_u8)
   [cond2] cond2 = Greater (rem4, thr_3_u8)
   [rem2b] rem2b = Mod <fmod: int = 0> (rem4, two_u8)
   [cond1] cond1 = Equal (rem2b, one_u8)
   [shift_blk4] shift_blk4 = Where (cond4, s29_shift, s31_shift)
   [shift_blk3] shift_blk3 = Where (cond3, s29_shift, s31_shift)
   [shift_blk2] shift_blk2 = Where (cond2, s29_shift, s31_shift)
   [shift_blk1] shift_blk1 = Where (cond1, s29_shift, s31_shift)
   [bg_ch0_a] bg_ch0_a = CenterCropPad <axes: ints = [1]> (__sp_low, s9_ch)
   [bg_ch0_b] bg_ch0_b = CenterCropPad <axes: ints = [1]> (bg_ch0_a, s11_ch)
   [bg_ch0_c] bg_ch0_c = CenterCropPad <axes: ints = [1]> (bg_ch0_b, s10_ch)
   [bg_ch1_a] bg_ch1_a = CenterCropPad <axes: ints = [1]> (bg_ch0_c, s9_ch)
   [bg_ch1_b] bg_ch1_b = CenterCropPad <axes: ints = [1]> (bg_ch1_a, s11_ch)
   [bg_ch1_c] bg_ch1_c = CenterCropPad <axes: ints = [1]> (bg_ch1_b, s10_ch)
   [bg_ch2_a] bg_ch2_a = CenterCropPad <axes: ints = [1]> (bg_ch1_c, s9_ch)
   [bg_ch2_b] bg_ch2_b = CenterCropPad <axes: ints = [1]> (bg_ch2_a, s11_ch)
   [bg_ch2_c] bg_ch2_c = CenterCropPad <axes: ints = [1]> (bg_ch2_b, s10_ch)
   [bg_ch3_a] bg_ch3_a = CenterCropPad <axes: ints = [1]> (bg_ch2_c, s9_ch)
   [bg_ch3_b] bg_ch3_b = CenterCropPad <axes: ints = [1]> (bg_ch3_a, s11_ch)
   [bg_ch3_c] bg_ch3_c = CenterCropPad <axes: ints = [1]> (bg_ch3_b, s10_ch)
   [bg_ch0] bg_ch0 = CenterCropPad <axes: ints = [1]> (bg_ch3_c, one_i64)
   [bg_pair0_ra] bg_pair0_ra = CenterCropPad <axes: ints = [2]> (bg_ch0, s29_shift)
   [bg_pair0_ha] bg_pair0_ha = CenterCropPad <axes: ints = [3]> (bg_pair0_ra, shift_blk4)
   [bg_pair0_b] bg_pair0_b = CenterCropPad <axes: ints = [2, 3]> (bg_pair0_ha, s31_shift)
   [bg_pair0_c] bg_pair0_c = CenterCropPad <axes: ints = [2, 3]> (bg_pair0_b, s30_shift)
   [bg_pair1_ra] bg_pair1_ra = CenterCropPad <axes: ints = [2]> (bg_pair0_c, s29_shift)
   [bg_pair1_ha] bg_pair1_ha = CenterCropPad <axes: ints = [3]> (bg_pair1_ra, shift_blk4)
   [bg_pair1_b] bg_pair1_b = CenterCropPad <axes: ints = [2, 3]> (bg_pair1_ha, s31_shift)
   [bg_pair1_c] bg_pair1_c = CenterCropPad <axes: ints = [2, 3]> (bg_pair1_b, s30_shift)
   [bg_pair2_ra] bg_pair2_ra = CenterCropPad <axes: ints = [2]> (bg_pair1_c, s29_shift)
   [bg_pair2_ha] bg_pair2_ha = CenterCropPad <axes: ints = [3]> (bg_pair2_ra, shift_blk4)
   [bg_pair2_b] bg_pair2_b = CenterCropPad <axes: ints = [2, 3]> (bg_pair2_ha, s31_shift)
   [bg_pair2_c] bg_pair2_c = CenterCropPad <axes: ints = [2, 3]> (bg_pair2_b, s30_shift)
   [bg_row3_a] bg_row3_a = CenterCropPad <axes: ints = [2]> (bg_pair2_c, s29_shift)
   [bg_row18] bg_row18 = CenterCropPad <axes: ints = [2]> (bg_row3_a, s18_row)
   [bg_b3_a] bg_b3_a = CenterCropPad <axes: ints = [3]> (bg_row18, shift_blk4)
   [bg_b3_b] bg_b3_b = CenterCropPad <axes: ints = [3]> (bg_b3_a, s31_shift)
   [bg_b3_c] bg_b3_c = CenterCropPad <axes: ints = [3]> (bg_b3_b, s30_shift)
   [bg_b4_a] bg_b4_a = CenterCropPad <axes: ints = [3]> (bg_b3_c, shift_blk3)
   [bg_b4_b] bg_b4_b = CenterCropPad <axes: ints = [3]> (bg_b4_a, s31_shift)
   [bg_b4_c] bg_b4_c = CenterCropPad <axes: ints = [3]> (bg_b4_b, s30_shift)
   [bg_b5_a] bg_b5_a = CenterCropPad <axes: ints = [3]> (bg_b4_c, shift_blk3)
   [bg_b5_b] bg_b5_b = CenterCropPad <axes: ints = [3]> (bg_b5_a, s31_shift)
   [bg_b5_c] bg_b5_c = CenterCropPad <axes: ints = [3]> (bg_b5_b, s30_shift)
   [bg_b7_a] bg_b7_a = CenterCropPad <axes: ints = [3]> (bg_b5_c, shift_blk2)
   [bg_b7_b] bg_b7_b = CenterCropPad <axes: ints = [3]> (bg_b7_a, s31_shift)
   [bg_b7_c] bg_b7_c = CenterCropPad <axes: ints = [3]> (bg_b7_b, s30_shift)
   [bg_b8_a] bg_b8_a = CenterCropPad <axes: ints = [3]> (bg_b7_c, shift_blk2)
   [bg_b8_b] bg_b8_b = CenterCropPad <axes: ints = [3]> (bg_b8_a, s31_shift)
   [bg_b8_c] bg_b8_c = CenterCropPad <axes: ints = [3]> (bg_b8_b, s30_shift)
   [bg_b9_a] bg_b9_a = CenterCropPad <axes: ints = [3]> (bg_b8_c, shift_blk1)
   [bg_b9_b] bg_b9_b = CenterCropPad <axes: ints = [3]> (bg_b9_a, s31_shift)
   [bg_b9_c] bg_b9_c = CenterCropPad <axes: ints = [3]> (bg_b9_b, s30_shift)
   [bg7] bg7 = CenterCropPad <axes: ints = [3]> (bg_b9_c, s7_win)
   [elig_threshold] elig_threshold = Add (kite_row_i64, lowest_m2_p1)
   [btm_idx] btm_idx = ArgMin <axis: int = 2, keepdims: int = 1, select_last_index: int = 1> (bg7)
   [btm_i8] btm_i8 = Cast <to: int = 2> (btm_idx)
   [actb] actb = Greater (btm_i8, elig_threshold)
   [fill_threshold] fill_threshold = Where (actb, elig_threshold, seventeen_u8)
   [scol_arg] scol_arg = ArgMin <axis: int = 3, keepdims: int = 0> (fill_threshold)
   [scol_arg_u8] scol_arg_u8 = Cast <to: int = 2> (scol_arg)
   [scol_u8] scol_u8 = Reshape (scol_arg_u8, one_i64)
   [srow_raw] srow_raw = Gather <axis: int = 3> (btm_i8, scol_arg)
   [fillbase7] fillbase7 = Greater (elig_row_idx_p1, fill_threshold)
   [fb0] fb0 = CenterCropPad <axes: ints = [2, 3]> (fillbase7, s30_shift)
   [pair0_a] pair0_a = CenterCropPad <axes: ints = [2, 3]> (fb0, s31_shift)
   [pair0_vb] pair0_vb = CenterCropPad <axes: ints = [2]> (pair0_a, s29_shift)
   [pair0_hb] pair0_hb = CenterCropPad <axes: ints = [3]> (pair0_vb, shift_blk4)
   [pair0_c] pair0_c = CenterCropPad <axes: ints = [2, 3]> (pair0_hb, s30_shift)
   [pair1_a] pair1_a = CenterCropPad <axes: ints = [2, 3]> (pair0_c, s31_shift)
   [pair1_vb] pair1_vb = CenterCropPad <axes: ints = [2]> (pair1_a, s29_shift)
   [pair1_hb] pair1_hb = CenterCropPad <axes: ints = [3]> (pair1_vb, shift_blk4)
   [pair1_c] pair1_c = CenterCropPad <axes: ints = [2, 3]> (pair1_hb, s30_shift)
   [pair2_a] pair2_a = CenterCropPad <axes: ints = [2, 3]> (pair1_c, s31_shift)
   [pair2_vb] pair2_vb = CenterCropPad <axes: ints = [2]> (pair2_a, s29_shift)
   [pair2_hb] pair2_hb = CenterCropPad <axes: ints = [3]> (pair2_vb, shift_blk4)
   [pair2_c] pair2_c = CenterCropPad <axes: ints = [2, 3]> (pair2_hb, s30_shift)
   [fh_b3_a] fh_b3_a = CenterCropPad <axes: ints = [3]> (pair2_c, s31_shift)
   [fh_b3_b] fh_b3_b = CenterCropPad <axes: ints = [3]> (fh_b3_a, shift_blk4)
   [fh_b3_c] fh_b3_c = CenterCropPad <axes: ints = [3]> (fh_b3_b, s30_shift)
   [fh_b4_a] fh_b4_a = CenterCropPad <axes: ints = [3]> (fh_b3_c, s31_shift)
   [fh_b4_b] fh_b4_b = CenterCropPad <axes: ints = [3]> (fh_b4_a, shift_blk3)
   [fh_b4_c] fh_b4_c = CenterCropPad <axes: ints = [3]> (fh_b4_b, s30_shift)
   [fh_b5_a] fh_b5_a = CenterCropPad <axes: ints = [3]> (fh_b4_c, s31_shift)
   [fh_b5_b] fh_b5_b = CenterCropPad <axes: ints = [3]> (fh_b5_a, shift_blk3)
   [fh_b5_c] fh_b5_c = CenterCropPad <axes: ints = [3]> (fh_b5_b, s30_shift)
   [fh_b7_a] fh_b7_a = CenterCropPad <axes: ints = [3]> (fh_b5_c, s31_shift)
   [fh_b7_b] fh_b7_b = CenterCropPad <axes: ints = [3]> (fh_b7_a, shift_blk2)
   [fh_b7_c] fh_b7_c = CenterCropPad <axes: ints = [3]> (fh_b7_b, s30_shift)
   [fh_b8_a] fh_b8_a = CenterCropPad <axes: ints = [3]> (fh_b7_c, s31_shift)
   [fh_b8_b] fh_b8_b = CenterCropPad <axes: ints = [3]> (fh_b8_a, shift_blk2)
   [fh_b8_c] fh_b8_c = CenterCropPad <axes: ints = [3]> (fh_b8_b, s30_shift)
   [fh_b9_a] fh_b9_a = CenterCropPad <axes: ints = [3]> (fh_b8_c, s31_shift)
   [fh_b9_b] fh_b9_b = CenterCropPad <axes: ints = [3]> (fh_b9_a, shift_blk1)
   [fill30_dyn] fill30_dyn = CenterCropPad <axes: ints = [3]> (fh_b9_b, s30_shift)
   [srow] srow = Reshape (srow_raw, one_i64)
   [absrow_u8] absrow_u8 = Add (srow, two_u8)
   [abscol_u8] abscol_u8 = Add (scol_u8, left_s_2d)
   [cstarts_u8] cstarts_u8 = Concat <axis: int = 0> (absrow_u8, abscol_u8)
   [cstarts] cstarts = Cast <to: int = 6> (cstarts_u8)
   [cends] cends = Add (cstarts, one_i32)
   [source] source = Slice (__sp_low2, cstarts, cends, source_axes)
   [output] output = Where (fill30_dyn, source, __sp_low2)
}
