<
   ir_version: 10,
   opset_import: ["" : 18]
>
task125_dyn (float[1,10,30,30] input) => (int8[1,1,20,20] output) 
   <float qS =  {0.333333}, int8 m1 = ..., int8[6,2,3,3] qWs = ..., int64[1] shape5 =  {5}, int64[1] shape3 =  {3}, int64[1] shape2 =  {2}, int64[1] one64 =  {1}, int8 z0 = ..., int8[1,1,1,7] hW = ..., int8[1,1,7,1] vW = ..., int64[1] wshape10, int64[1] s13, int64[1] s26, int64[1] s27, int64[1] s25, int8[1,1,1,1] low, float[1,1,1,1] rcn00, int8[1,1,1,1] rcn01, int8[1,1,1,1] rcn02, int8[1,1,1,1] rcn03, int8[1,1,1,1] rcn04, int8[1,1,1,1] rcn05, int8[1,1,1,1] rcn06, int8[1,1,1,1] rcn07, int8[1,1,1,1] rcn08, int8[1,1,1,1] rcn09, int8[1,1,1,1] rcn10, int8[1,1,1,1] rcn11, int8[1,1,1,1] rcn12, int8[1,1,1,1] rcn13, int8[1,1,1,1] rcn14, int8[1,1,1,1] rcn15, int8[1,1,1,1] rcn16, int8[1,1,1,1] rcn17, int8[1,1,1,1] rcn18, int8[1,1,1,1] rcn19, int8[1,1,1,1] p, int8[1,1,1,1] bd, int8[1,2,1,1] bd2, int8[1,2,1,1] feat, int8[1,1,1,1] qW26, int8[1,1,1,1] qW13, int8[1,1,1,1] qWdyn, int8[1,1,1,1] sp13>
{
   wshape10 = Add (shape5, shape5)
   s13 = Add (wshape10, shape3)
   s26 = Add (s13, s13)
   s27 = Add (s26, one64)
   s25 = Sub (s26, one64)
   rcn00 = CenterCropPad <axes: ints = [1, 2, 3]> (input, s27)
   low = CastLike (rcn00, m1)
   rcn01 = CenterCropPad <axes: ints = [2, 3]> (low, s26)
   rcn02 = CenterCropPad <axes: ints = [2, 3]> (rcn01, s25)
   rcn03 = CenterCropPad <axes: ints = [2, 3]> (rcn02, s27)
   rcn04 = CenterCropPad <axes: ints = [2, 3]> (rcn03, s26)
   rcn05 = CenterCropPad <axes: ints = [2, 3]> (rcn04, s25)
   rcn06 = CenterCropPad <axes: ints = [2, 3]> (rcn05, s27)
   rcn07 = CenterCropPad <axes: ints = [2, 3]> (rcn06, s26)
   rcn08 = CenterCropPad <axes: ints = [2, 3]> (rcn07, s25)
   rcn09 = CenterCropPad <axes: ints = [2, 3]> (rcn08, s27)
   rcn10 = CenterCropPad <axes: ints = [2, 3]> (rcn09, s26)
   rcn11 = CenterCropPad <axes: ints = [2, 3]> (rcn10, s25)
   rcn12 = CenterCropPad <axes: ints = [2, 3]> (rcn11, s27)
   rcn13 = CenterCropPad <axes: ints = [2, 3]> (rcn12, s26)
   rcn14 = CenterCropPad <axes: ints = [1, 2, 3]> (rcn13, s25)
   rcn15 = CenterCropPad <axes: ints = [2, 3]> (rcn14, s27)
   rcn16 = CenterCropPad <axes: ints = [1, 2, 3]> (rcn15, s26)
   rcn17 = CenterCropPad <axes: ints = [2, 3]> (rcn16, s25)
   rcn18 = CenterCropPad <axes: ints = [1, 2, 3]> (rcn17, s27)
   rcn19 = CenterCropPad <axes: ints = [2, 3]> (rcn18, s26)
   sp13 = CenterCropPad <axes: ints = [2, 3]> (rcn19, s13)
   p = CenterCropPad <axes: ints = [1]> (sp13, one64)
   hscore = QLinearConv <pads: ints = [0, 3, 0, 3]> (p, qS, z0, hW, qS, z0, qS, z0)
   vscore = QLinearConv <pads: ints = [3, 0, 3, 0]> (p, qS, z0, vW, qS, z0, qS, z0)
   bd = Min (hscore, vscore)
   bd2 = CenterCropPad <axes: ints = [1]> (bd, shape2)
   feat = Sub (bd2, p)
   qW26 = CenterCropPad <axes: ints = [0]> (qWs, s26)
   qW13 = CenterCropPad <axes: ints = [0]> (qW26, s13)
   qWdyn = CenterCropPad <axes: ints = [0]> (qW13, wshape10)
   output = QLinearConv <pads: ints = [2, 2, 17, 17]> (feat, qS, m1, qWdyn, qS, z0, qS, m1)
}
