<
   ir_version: 10,
   opset_import: ["" : 18]
>
g (float[1,10,30,30] input) => (float16[1,1,1,1] output) 
   <float16[10,1] x0 = ..., float16[30] x3 = ..., float16[10] x4 = ..., int64[1] x6 =  {5}, uint8[1,1] x7 = ..., float[1,1,1,1] xic, float16 x74, uint8[1,1] x75, uint8[1,1] x76, uint8[1,1] x77, uint8[1] x81>
{
   xs0 = Shape <end: int = 1, start: int = 0> (input)
   xic = CenterCropPad <axes: ints = [0]> (input, xs0)
   xi = CastLike (xic, x0)
   x8 = Einsum <equation: string = "bchw,cz,h->bz"> (xi, x0, x3)
   x10 = Einsum <equation: string = "bchw,cz,w->bz"> (xi, x0, x3)
   x12 = Einsum <equation: string = "bchw,cz,h,h,bdxy,dz->bz"> (xi, x0, x3, x3, xi, x0)
   x14 = Einsum <equation: string = "bchw,cz,w,w,bdxy,dz->bz"> (xi, x0, x3, x3, xi, x0)
   x16 = Einsum <equation: string = "bchw,c->b"> (xi, x4)
   x17 = Einsum <equation: string = "bchw,c,h->b"> (xi, x4, x3)
   x18 = Einsum <equation: string = "bchw,c,w->b"> (xi, x4, x3)
   x23 = Gemm <alpha: float = -1, beta: float = 1> (x8, x8, x12)
   x24 = Gemm <alpha: float = -1, beta: float = 1> (x10, x10, x14)
   x25 = Sqrt (x23)
   x26 = Sqrt (x24)
   x27 = Cast <to: int = 2> (x10)
   x28 = Cast <to: int = 2> (x8)
   x29 = Cast <to: int = 2> (x26)
   x30 = Cast <to: int = 2> (x25)
   x31 = Sub (x27, x29)
   x32 = Sub (x28, x30)
   x33 = Div (x31, x7)
   x34 = Div (x32, x7)
   x35 = Add (x29, x30)
   x36 = Div (x29, x35)
   x37 = Div (x30, x35)
   x38 = Cast <to: int = 2> (x16)
   x39 = Cast <to: int = 2> (x17)
   x40 = Cast <to: int = 2> (x18)
   x41 = Add (x34, x33)
   x42 = Add (x39, x40)
   x43 = Mul (x38, x41)
   x44 = Sub (x42, x43)
   x45 = Div (x44, x35)
   x46 = Sub (x38, x45)
   x47 = Sub (x35, x7)
   x48 = Div (x47, x7)
   x56o = Mul (x48, x37)
   x57o = Mul (x48, x36)
   [x56] x56 = Add (x34, x56o)
   [x57] x57 = Add (x33, x57o)
   [x56m] x56m = Sub (x56, x37)
   [x57m] x57m = Sub (x57, x36)
   [x56m2] x56m2 = Sub (x56m, x37)
   [x57m2] x57m2 = Sub (x57m, x36)
   x34p = Add (x34, x37)
   x33p = Add (x33, x36)
   x34p2 = Add (x34p, x37)
   x33p2 = Add (x33p, x36)
   x56m3t = Max (x56m2, x34p)
   x57m3t = Max (x57m2, x33p)
   x56m3 = Sub (x56m3t, x37)
   x57m3 = Sub (x57m3t, x36)
   x56m4t = Max (x56m3, x34p)
   x57m4t = Max (x57m3, x33p)
   x56m4 = Sub (x56m4t, x37)
   x57m4 = Sub (x57m4t, x36)
   x56m5t = Max (x56m4, x34p)
   x57m5t = Max (x57m4, x33p)
   x56m5 = Sub (x56m5t, x37)
   x57m5 = Sub (x57m5t, x36)
   [x56b1] x56b1 = Sub (x56, x36)
   [x56b2] x56b2 = Sub (x56b1, x36)
   [x56p1] x56p1 = Add (x56, x36)
   [x56p2] x56p2 = Add (x56p1, x36)
   [x57b1] x57b1 = Sub (x57, x37)
   [x57b2] x57b2 = Sub (x57b1, x37)
   [x57p1] x57p1 = Add (x57, x37)
   [x57p2] x57p2 = Add (x57p1, x37)
   [x62a] x62a = Add (x56b2, x37)
   [x62b] x62b = Add (x56p2, x37)
   [x63a] x63a = Add (x57b2, x36)
   [x63b] x63b = Add (x57p2, x36)
   x64m2 = Sub (x28, x56m2)
   x65m2 = Sub (x27, x57m2)
   x64m = Sub (x28, x56m)
   x65m = Sub (x27, x57m)
   x64i = Sub (x28, x56)
   x65i = Sub (x27, x57)
   x64m3 = Sub (x28, x56m3)
   x65m3 = Sub (x27, x57m3)
   x64m4 = Sub (x28, x56m4)
   x65m4 = Sub (x27, x57m4)
   x64m5 = Sub (x28, x56m5)
   x65m5 = Sub (x27, x57m5)
   x64m6 = Sub (x28, x34p2)
   x65m6 = Sub (x27, x33p2)
   x64m7 = Sub (x28, x34p)
   x65m7 = Sub (x27, x33p)
   [x66a] x66a = Sub (x28, x56b1)
   [x66b] x66b = Sub (x28, x56b2)
   [x66c] x66c = Sub (x28, x56p2)
   [x66d] x66d = Sub (x28, x56p1)
   [x67a] x67a = Sub (x27, x57b1)
   [x67b] x67b = Sub (x27, x57b2)
   [x67c] x67c = Sub (x27, x57p2)
   [x67d] x67d = Sub (x27, x57p1)
   [x68a] x68a = Sub (x28, x62a)
   [x68b] x68b = Sub (x28, x62b)
   [x69a] x69a = Sub (x27, x63a)
   [x69b] x69b = Sub (x27, x63b)
   [x70] x70 = Concat <axis: int = 0> (x34p, x34p2, x56m5, x56m4, x56m3, x56m2, x56m, x56, x56b1, x56b2, x56p2, x56p1, x62a, x62b, x34p, x34p2, x56m5, x56m4, x56m3, x56m2, x56m, x56, x56b1, x56b2, x56p2, x56p1, x62a, x62b, x64m7, x64m6, x64m5, x64m4, x64m3, x64m2, x64m, x64i, x66a, x66b, x66c, x66d, x68a, x68b, x64m7, x64m6, x64m5, x64m4, x64m3, x64m2, x64m, x64i, x66a, x66b, x66c, x66d, x68a, x68b)
   [x71] x71 = Concat <axis: int = 0> (x33p, x33p2, x57m5, x57m4, x57m3, x57m2, x57m, x57, x57b1, x57b2, x57p2, x57p1, x63a, x63b, x33p, x33p2, x57m5, x57m4, x57m3, x57m2, x57m, x57, x57b1, x57b2, x57p2, x57p1, x63a, x63b, x65m7, x65m6, x65m5, x65m4, x65m3, x65m2, x65m, x65i, x67a, x67b, x67c, x67d, x69a, x69b, x65m7, x65m6, x65m5, x65m4, x65m3, x65m2, x65m, x65i, x67a, x67b, x67c, x67d, x69a, x69b)
   x72 = Concat <axis: int = 0> (x46, x46, x46, x46, x46, x46, x46, x46, x46, x46, x46, x46, x46, x46, x45, x45, x45, x45, x45, x45, x45, x45, x45, x45, x45, x45, x45, x45)
   x73 = Shape <end: int = 1, start: int = 0> (x70)
   x74 = CenterCropPad (x3, x73)
   x75 = CenterCropPad <axes: ints = [0]> (x72, x73)
   x76 = CenterCropPad <axes: ints = [0]> (x70, x73)
   x77 = CenterCropPad <axes: ints = [0]> (x71, x73)
   x79 = Concat <axis: int = 1> (x75, x76, x77)
   x80 = CenterCropPad <axes: ints = [1]> (x79, x6)
   [x78sub] x78 = Sub (x6, xs0)
   x81 = CenterCropPad <axes: ints = [1]> (x80, x78)
   x82 = CastLike (x81, x73)
   output = ScatterND (xi, x82, x74)
}
