<
   ir_version: 10,
   opset_import: ["" : 18]
>
task396_topkrows (float[1,10,30,30] input) => (int32[1,10,30,30] output) 
   <int64[1] k2 =  {2}, int64[1] krow =  {4}, int64[1,1,1,1] idx1_4d =  {1}, int32[1] k8 =  {8}, float[10,1] os2 =  {0,1,1,1,1,1,1,1,1,1}, float[30] ow =  {524289,524290,524292,524296,524304,524320,524352,524416,524544,524800,525312,526336,528384,532480,540672,557056,589824,655360,786432,1.04858e+06,1.57286e+06,2.62144e+06,4.71859e+06,8.9129e+06,1.73015e+07,3.40787e+07,6.76332e+07,1.34742e+08,2.6896e+08,5.37395e+08}, uint32 two32 = ..., uint32 four32 = ..., uint8 z8 = ..., uint8 thirty = ..., uint8 u1 = ..., uint8 v2 = ..., uint8 v3 = ..., uint8 v4 = ..., uint8 v5 = ..., int64[8] rows8 =  {0,1,2,3,4,5,6,7}, uint8[1,1,1,8] bitmask8 = ..., int8[10,2,1,1] baseW2 = ..., int8[1,1,1,1] one_i8_4d = ..., int64[3] axes_013 =  {0,1,3}, uint16 two16 = ..., uint16 three16 = ..., float[10] cnt, float[2] tv, int64[2] ti, float[10] bs, int64[1,1,1,1] si, float[30] orows, float[30] brows, float[4] rv, int64[4] ri, uint32[4] x, uint32[4] xshr1, uint32[4] a2, uint32[4] a2shr2, uint16[4] a4, uint16[4] a5shr1, uint16[4] a5, uint16[4] a6shr1, uint16[4] a6, uint16[4] a7shr1, uint16[4] a7, uint16[4] a7mod3, bool[4] a7mod0, bool[4] h4, bool[4] h5, bool[4] h6, bool[4] h7, uint8[4] s4, uint8[4] s5, uint8[4] s6, uint8[4] w78, uint8[4] s8, uint8[4] ri8, int64[1] bestj1, uint8[1] r0u8, int32[1] r0i32, uint8[1] wu, uint16[1] m4, uint8[1] widx, uint8[1] fac, uint16[1] fac16, uint16[1] m4s, uint16[1] rm, float[1] powshift, int32[1] rend, float[8] osegf, float[8] osegdiv, uint8[8] oseg, uint8[1] tmpmask, uint8[1] fullmask, uint8[8] infull, int64[1] bottom, bool[8] rowok, uint8[8] rowmask, uint8[8] o4row, uint8[1,2,8,1] o4augr, uint8[1,2,8,8] feat, int8[10,2,1,1] dw, uint8[1,1,8,1] o4row4, uint8[1,1,8,1] rowmask4, uint8[1] wu_safe, uint32[4] a4_32, uint8[1] maxw, bool[4] w_eq, uint8[4] masked_ri>
{
   [cnt] cnt = Einsum <equation: string = "nchw,ck->c"> (input, os2)
   [ctopk] tv, ti = TopK <axis: int = 0, largest: int = 1, sorted: int = 1> (cnt, k2)
   [bs] bs = Hardmax <axis: int = 0> (cnt)
   [si] si = Gather <axis: int = 0> (ti, idx1_4d)
   [orows] orows = Einsum <equation: string = "nchw,ck,w->h"> (input, os2, ow)
   [brows] brows = Einsum <equation: string = "nchw,c,w->h"> (input, bs, ow)
   [rtopk] rv, ri = TopK <axis: int = 0, largest: int = 1, sorted: int = 1> (brows, krow)
   [x] x = Cast <to: int = 12> (rv)
   [xshr1] xshr1 = Div (x, two32)
   [a2] a2 = BitwiseAnd (x, xshr1)
   [a2shr2] a2shr2 = Div (a2, four32)
   [a4] a4_32 = BitwiseAnd (a2, a2shr2)
   [a4] a4 = Cast <to: int = 4> (a4_32)
   [a5shr1] a5shr1 = Div (a4, two16)
   [a5] a5 = BitwiseAnd (a4, a5shr1)
   [a6shr1] a6shr1 = Div (a5, two16)
   [a6] a6 = BitwiseAnd (a5, a6shr1)
   [a7shr1] a7shr1 = Div (a6, two16)
   [a7] a7 = BitwiseAnd (a6, a7shr1)
   [a7mod3] a7mod3 = Mod <fmod: int = 0> (a7, three16)
   [a7mod0] a7mod0 = Cast <to: int = 9> (a7mod3)
   [h4] h4 = Cast <to: int = 9> (a4)
   [h5] h5 = Cast <to: int = 9> (a5)
   [h6] h6 = Cast <to: int = 9> (a6)
   [h7] h7 = Cast <to: int = 9> (a7)
   [s4] s4 = Where (h4, u1, z8)
   [s5] s5 = Where (h5, v2, s4)
   [s6] s6 = Where (h6, v3, s5)
   [w78] w78 = Where (a7mod0, v4, v5)
   [s8] s8 = Where (h7, w78, s6)
   [ri8] ri8 = Cast <to: int = 2> (ri)
   [maxw] maxw = ReduceMax <keepdims: int = 1> (s8)
   [w_eq] w_eq = Equal (s8, maxw)
   [masked_ri] masked_ri = Where (w_eq, ri8, thirty)
   [bestj1] bestj1 = ArgMin <axis: int = 0, keepdims: int = 1, select_last_index: int = 0> (masked_ri)
   [r0u8] r0u8 = Gather <axis: int = 0> (ri8, bestj1)
   [wu] wu = Gather <axis: int = 0> (s8, bestj1)
   [m4] m4 = Gather <axis: int = 0> (a4, bestj1)
   [wu_safe] wu_safe = Max (wu, u1)
   [widx] widx = Sub (wu_safe, u1)
   [fac] fac = BitShift <direction: string = "LEFT"> (u1, widx)
   [fac16] fac16 = Cast <to: int = 4> (fac)
   [m4s] m4s = Div (m4, fac16)
   [rm] rm = BitwiseAnd (m4, m4s)
   [powshift] powshift = Cast <to: int = 1> (rm)
   [r0i32] r0i32 = Cast <to: int = 6> (r0u8)
   [rend] rend = Add (r0i32, k8)
   [osegf] osegf = Slice (orows, r0i32, rend)
   [osegdiv] osegdiv = Div (osegf, powshift)
   [oseg] oseg = Cast <to: int = 2> (osegdiv)
   [tmpmask] tmpmask = BitShift <direction: string = "LEFT"> (fac, v4)
   [fullmask] fullmask = Sub (tmpmask, u1)
   [infull] infull = BitwiseAnd (oseg, fullmask)
   [bottom0] bottom = ArgMax <axis: int = 0, keepdims: int = 1, select_last_index: int = 1> (infull)
   [rowok] rowok = LessOrEqual (rows8, bottom)
   [rowmask] rowmask = Where (rowok, fullmask, z8)
   [o4row] o4row = BitwiseAnd (oseg, rowmask)
   [o4row4] o4row4 = Unsqueeze (o4row, axes_013)
   [rowmask4] rowmask4 = Unsqueeze (rowmask, axes_013)
   [o4augr] o4augr = Concat <axis: int = 1> (o4row4, rowmask4)
   [feat] feat = BitwiseAnd (o4augr, bitmask8)
   [dw] dw = ScatterElements <axis: int = 0> (baseW2, si, one_i8_4d)
   [output] output = ConvInteger <pads: ints = [0, 0, 22, 22]> (feat, dw)
}
