<
   ir_version: 9,
   opset_import: ["" : 18]
>
task035_v10 (float[1,10,30,30] input) => (uint8[1,10,30,30] output) 
   <uint8 zero_u8 = ..., uint8 one_u8 = ..., float one_f =  {1}, float[10,1,1,1] edge_w_t =  {0,155,114,49,142,249,181,251,1,200}, uint8[1,1,2,1] br_w = ..., uint8[1,1,10,1] zero_col10 = ..., float q_y_scale =  {13225}, uint8[10,1,1,2] q_w_sp = ..., uint8[1,1,1,1] zero_cell = ..., uint8[1,1,1,1] col_has2 = ...>
{
   row_tailT_f = ConvTranspose <pads: ints = [5, 5, 22, 24]> (input, edge_w_t)
   row_tailT = Cast <to: int = 2> (row_tailT_f)
   row_tail = Concat <axis: int = 2> (col_has2, row_tailT)
   [bottom_row] bottom_tail = QLinearConv <pads: ints = [0, 0, 1, 0]> (row_tail, one_f, zero_u8, br_w, one_f, one_u8, one_f, zero_u8)
   top0_f = ConvTranspose <pads: ints = [0, 2, 29, 27]> (input, edge_w_t)
   top0 = Cast <to: int = 2> (top0_f)
   top1_f = ConvTranspose <pads: ints = [0, 3, 29, 26]> (input, edge_w_t)
   top1 = Cast <to: int = 2> (top1_f)
   top2_f = ConvTranspose <pads: ints = [0, 4, 29, 25]> (input, edge_w_t)
   top2 = Cast <to: int = 2> (top2_f)
   top3_f = ConvTranspose <pads: ints = [0, 5, 29, 24]> (input, edge_w_t)
   top3 = Cast <to: int = 2> (top3_f)
   bot0_f = ConvTranspose <pads: ints = [9, 2, 20, 27]> (input, edge_w_t)
   bot0 = Cast <to: int = 2> (bot0_f)
   bot1_f = ConvTranspose <pads: ints = [9, 3, 20, 26]> (input, edge_w_t)
   bot1 = Cast <to: int = 2> (bot1_f)
   bot2_f = ConvTranspose <pads: ints = [9, 4, 20, 25]> (input, edge_w_t)
   bot2 = Cast <to: int = 2> (bot2_f)
   bot3_f = ConvTranspose <pads: ints = [9, 5, 20, 24]> (input, edge_w_t)
   bot3 = Cast <to: int = 2> (bot3_f)
   leftv0_f = ConvTranspose <pads: ints = [3, 0, 26, 29]> (input, edge_w_t)
   leftv0 = Cast <to: int = 2> (leftv0_f)
   leftvT_f = ConvTranspose <pads: ints = [4, 0, 22, 29]> (input, edge_w_t)
   leftvT = Cast <to: int = 2> (leftvT_f)
   rightv0_f = ConvTranspose <pads: ints = [3, 9, 26, 20]> (input, edge_w_t)
   rightv0 = Cast <to: int = 2> (rightv0_f)
   rightvT_f = ConvTranspose <pads: ints = [4, 9, 22, 20]> (input, edge_w_t)
   rightvT = Cast <to: int = 2> (rightvT_f)
   left_full = Concat <axis: int = 2> (zero_cell, zero_cell, zero_cell, leftv0, leftvT, zero_cell, zero_cell)
   right_full = Concat <axis: int = 2> (zero_cell, zero_cell, zero_cell, rightv0, rightvT, zero_cell, zero_cell)
   rank_rowsT = Concat <axis: int = 3> (row_tail, bottom_tail, leftvT)
   col_has0_f = ConvTranspose <pads: ints = [3, 2, 26, 27]> (input, edge_w_t)
   col_has0 = Cast <to: int = 2> (col_has0_f)
   col_has1_f = ConvTranspose <pads: ints = [3, 3, 26, 26]> (input, edge_w_t)
   col_has1 = Cast <to: int = 2> (col_has1_f)
   left_col1 = Sub (col_has1, col_has0)
   left_col2 = Sub (col_has2, col_has1)
   lefttop0 = Mul (leftv0, col_has0)
   tpool0 = Max (col_has0, top0, lefttop0)
   lefttop1 = Mul (leftv0, left_col1)
   tpool1 = Max (col_has1, top1, lefttop1)
   lefttop2 = Mul (leftv0, left_col2)
   tpool2 = Max (col_has2, top2, lefttop2)
   tpool3 = Max (col_has2, top3, rightv0)
   rank_colT0 = Concat <axis: int = 2> (col_has0, bot0, col_has0)
   poolT0 = QLinearMatMul (rank_rowsT, one_f, zero_u8, rank_colT0, one_f, zero_u8, one_f, zero_u8)
   core0 = Concat <axis: int = 2> (top0, zero_cell, zero_cell, tpool0, poolT0, zero_cell, bot0)
   core0b = Mul (core0, zero_col10)
   rank_colT1 = Concat <axis: int = 2> (col_has1, bot1, left_col1)
   poolT1 = QLinearMatMul (rank_rowsT, one_f, zero_u8, rank_colT1, one_f, zero_u8, one_f, zero_u8)
   core1 = Concat <axis: int = 2> (top1, zero_cell, zero_cell, tpool1, poolT1, zero_cell, bot1)
   core1b = Mul (core1, zero_col10)
   rank_colT2 = Concat <axis: int = 2> (col_has2, bot2, left_col2)
   poolT2 = QLinearMatMul (rank_rowsT, one_f, zero_u8, rank_colT2, one_f, zero_u8, one_f, zero_u8)
   core2 = Concat <axis: int = 2> (top2, zero_cell, zero_cell, tpool2, poolT2, zero_cell, bot2)
   core2b = Mul (core2, zero_col10)
   rank_colT3 = Concat <axis: int = 2> (col_has2, bot3, zero_cell)
   poolT3 = QLinearMatMul (rank_rowsT, one_f, zero_u8, rank_colT3, one_f, zero_u8, one_f, zero_u8)
   poolT3r = Add (poolT3, rightvT)
   core3 = Concat <axis: int = 2> (top3, zero_cell, zero_cell, tpool3, poolT3r, zero_cell, bot3)
   core3b = Mul (core3, zero_col10)
   left2 = Mul (left_full, zero_col10)
   right2 = Mul (right_full, zero_col10)
   pack = Concat <axis: int = 3> (left_full, left2, zero_col10, zero_col10, core0, core0b, core1, core1b, core2, core2b, core3, core3b, zero_col10, zero_col10, zero_col10, zero_col10, zero_col10, zero_col10, right_full, right2)
   output = QLinearConv <pads: ints = [0, 0, 20, 40], strides: ints = [1, 2]> (pack, one_f, one_u8, q_w_sp, one_f, one_u8, q_y_scale, zero_u8)
}
