<
   ir_version: 10,
   opset_import: ["" : 21]
>
task018_rewrite8 (float[1,10,30,30] input) => (float[1,10,30,30] output) 
   <int64[1] axes_3 =  {1}, int64 first0 =  {0}, int8 i8_0 = ..., int8 i8_29 = ..., int8 i8_3 = ..., int64[1] k_11 =  {18}, int64[1] k_12 =  {12}, int64[1] n_ax2 =  {2}, int64[1] n_ax3 =  {3}, uint8 o_u8_0 = ..., int64 one64 =  {1}, int64[1] q_flat =  {92}, uint8 q_u8B = ..., float[1,10,2,8] q_w =  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,16,256,4096,65536,1.04858e+06,0,0,0,0,0,0,0,0,0,0,2,32,512,8192,131072,2.09715e+06,0,0,0,0,0,0,0,0,0,0,3,48,768,12288,196608,3.14573e+06,0,0,0,0,0,0,0,0,0,0,4,64,1024,16384,262144,4.1943e+06,0,0,0,0,0,0,0,0,0,0,5,80,1280,20480,327680,5.24288e+06,0,0,0,0,0,0,0,0,0,0,6,96,1536,24576,393216,6.29146e+06,0,0,0,0,0,0,0,0,0,0,7,112,1792,28672,458752,7.34003e+06,0,0,0,0,0,0,0,0,0,0,8,128,2048,32768,524288,8.38861e+06,0,0,0,0,0,0,0,0,0,0,9,144,2304,36864,589824,9.43718e+06,0,0,0,0,0,0,0,0,0,0}, int64[1] rax_10 =  {0}, int64[3] rax_8 =  {0,2,3}, int32[1] t_i32_2 =  {2}, int64[5] px_idx9 =  {0,3,5,8,10}, int8[4,2,2] t_mats = ..., float qmm_scale =  {1}, int8[2,4] qsig_w = ..., int8[2,1] qsig_wc = ..., int32[4] grp_j4 =  {0,1,2,3}, int32[1] i32_4 =  {4}, int64 rare6_idx =  {6}, int64[1] slice_e4 =  {4}, int8 i8_2 = ..., uint8 q_u8_16 = ..., uint8 q_u8_20 = ..., uint8 q_u8nb = ..., uint8 q_u8_1 = ..., float q_f256 =  {256}, int64[1] k_mode_17 =  {17}, uint8 corr_u8_8 = ..., int8[1,2] corr_coord_a = ..., int8[1,2] corr_coord_b = ..., int8[1,1] corr_ch_mode = ..., int8[1,1] corr_ch_bg = ..., int8[1] one1_i8 = ..., int8[1] neg_one1_i8 = ..., float[1,1,23,4] pack, float[92] packf, float[18] block_v, int64[18] block_i, int64[1] __sh_block_iu8, int64[1] __hid_block_iu8, uint8[1] block_iu8, float[10] counts10, bool[6] d_ism, float16[17] d_mscore, float16[17] mode_v, int64[17] mode_idx, uint8[6] d_r8, float16[12] d_rscore, float16[12] rare_v, int64[12] rare_idx, uint8[1] dm_idx8, uint8[17] dm_gblock, uint8[17] dm_row8, uint8[17] dm_block8, uint8[17] dm_basec8, uint8[17] dm_col8, int8[1] dm_r, int8[1] dm_c, int8[1,1] dm_r1, int8[1,1] dm_c1, int8[1,2] mode_coords, uint8[12] dr_idx8, uint8[12] dr_gblock, uint8[12] dr_row8, uint8[12] dr_block8, uint8[12] dr_basec8, uint8[12] dr_col8, int8[12] dr_r, int8[12] dr_c, int8[12,1] dr_r1, int8[12,1] dr_c1, int8[12,2] rare_coords, int32[1] grp_n2, int32[4] grp_jmod, int32[4] grp_midpos, int32[4] grp_minpos, int8[4,2] grp_maxcoords, int8[4,2] grp_midcoords, int8[4,2] anchor_coords, int8[4,1,2] anchor_c1, int8[5,2] px_mode_coords, bool[5] px_mode_valid, int8[4,5,2] adiff, int8[4,5,2] aabs, int8[4,5] acheb, bool[4,5] anear0, bool[4,5] anear, float16[4] smaski, float16[2] sv, int64[2] sidx, float16[2] cv, int64[2] cidx, int8[2,2] scoords, int8[2,2] ccoords, int8[4,2] allanchors, int8[4,1,2] pair_a1, int8[4,4,2] pair_maxd, int8[4,4,2] pair_maxa, int8[4,4] pair_maxdist, int64[4,1] pair_maxidx, int8[4,1,2] pair_maxsel, int8[4,4,2] pair_midd, int8[4,4,2] pair_mida, int8[4,4] pair_middist, int64[4,1] pair_mididx, int8[4,1,2] pair_midsel, int8[4,3,2] allmarkers, int8[2,3,2] source_markers, int8[2,3,2] clone_markers, int8[2,2,2] r_smarks, int8[2,2,2] r_cmarks, int8[2,1,2] n_sanchor1, int8[2,2,2] n_srel, int8[2,1,2] n_canchor1, int8[2,2,2] n_crel, int8[2,2,4] qsig_raw, int8[2,4,2] rs_ssig, int8[2,2,1] qcsig_raw, int8[2,2] qcsig_sq, int8[2,4,1,2] rs_ssig1, bool[2,4,2,2] n_releq, int64[2] n_pair, int8[2,2] n_csel, int8[2] own_a0, int8[2] own_a1, int8[2] own_ad, int8[2] own_aa, int8 own_dr, int8 own_dc, int8[1] own_mv, int32[1] n_owner32, int8[1,2] n_psa, int8[1,2] n_pca, int8[1,2] n_prel, int8[1,2,2] n_mat, int8[1,1,2] n_prel1, int8[1,1,2] n_txy1, int8[1,2] n_txy, int8[1,2] n_target0, int8[1,2] mode_target_coords, int8 mode_i8, int8[1,1] __hid_scatter_idx64, int64[1,1] scatter_idx64, int64[1] __sh_d_mscore, bool[17] __hid_d_mscore, uint8[12] __hid_d_rscore, int8[1] mv_i8, int8[1] neg_mv_i8, int64[1] __sh_scatter_updates, int8[1] __hid_scatter_updates, float[1] scatter_updates, int8[1,1] mode18_col, int8[6,2] source_markers_flat, uint8[2,8] n_score8, float16[1] rmax_f, float16[1] rmid_f, float16[1] rmin_f, int8[1] rmax_u8, int8[1] rmid_u8, int8[1] rmin_u8, int8[3] marker_colors, bool[4] anearany, bool[2,4,2] n_relscores_bool, uint8[2,4,2] n_relscores, int8[1,3] scatter_idx8, int8[3,1] marker_col3, int8[2,2,2] rot_mats, int8[5] px_mv_i8, float[2] cz_v, int64[2] cz_i, float16 rare_v6, bool two_sprites_bool, int32[1] grp_n, uint8[2] cz_i_u8, uint8 mode, bool own_axis_bool, int32 own_axis, int8 own_s0, int8 own_s1, int8 own_sum, int8 own_mid_floor, bool own_dir, bool[1] own_gt, bool[1] n_ownerb, int8[2] t_pair8, int8[2] t_rot8, int8[2] n_clone8, int32[2] t_rot32, int32[2] n_clone32, uint8[1] low8, uint8[1] hi8, uint8[1] d0, uint8[1] d1, uint8[1] d2, uint8[1] d3, uint8[6] digitf8, uint8[1] dm_off8, uint8[12] dr_off8, uint8[1] d4, uint8[1] d4m, uint8[1] d5, uint8[17] dm_col8_pre, uint8[12] dr_col8_pre, float16[1] __hid_mv, uint8[6] block_iu8x6, int8[1,1] z84_dyn, int8[1,1] ch84_hid, int8[1,1] coords84_hid, int8[1,1] z18_dyn, float[1] __hid_low8_x, float[1] __hid_hi8_x, float[1] __hid_d4_x, int64[1] __hid_dm_idx8_x, uint8[1] __hid_dm_r_x, uint8[1] __hid_dm_c_x, int64[1] __sh_mode_idx, int8[20,2] coords84, int8[20,1] ch84, int8[20] scatter_updates_i8, int8[1] corr_mode_v16, bool corr_mode8_bool, int8[1] corr_gate_i8, int8[1] corr_neg_gate_i8, int8 corr_mode8_i8>
{
   [pack] pack = Conv <strides: ints = [1, 6], dilations: ints = [7, 1], kernel_shape: ints = [2, 8], pads: ints = [0, 1, 0, 0]> (input, q_w)
   [packf] packf = Reshape (pack, q_flat)
   [block_v] block_v, block_i = TopK <axis: int = 0, largest: int = 1, sorted: int = 1> (packf, k_11)
   [__sh_block_iu8] __sh_block_iu8 = Shape (block_i)
   [__hid_block_iu8] __hid_block_iu8 = CenterCropPad (block_i, __sh_block_iu8)
   [block_iu8] block_iu8 = CastLike (__hid_block_iu8, o_u8_0)
   [block_iu8x6] block_iu8x6 = Concat <axis: int = 0> (block_iu8, block_iu8, block_iu8, block_iu8, block_iu8, block_iu8)
   [__hid_low8_x] __hid_low8_x = CenterCropPad (block_v, __sh_block_iu8)
   [low8] low8 = CastLike (__hid_low8_x, o_u8_0)
   [hi16] hi16 = Div (block_v, q_f256)
   [__hid_hi8_x] __hid_hi8_x = CenterCropPad (hi16, __sh_block_iu8)
   [hi8] hi8 = CastLike (__hid_hi8_x, o_u8_0)
   [d0] d0 = Mod <fmod: int = 0> (low8, q_u8_16)
   [d1] d1 = Div (low8, q_u8_16)
   [d2] d2 = Mod <fmod: int = 0> (hi8, q_u8_16)
   [d3] d3 = Div (hi8, q_u8_16)
   [hi32] hi32 = Div (hi16, q_f256)
   [__hid_d4_x] __hid_d4_x = CenterCropPad (hi32, __sh_block_iu8)
   [d4] d4 = CastLike (__hid_d4_x, o_u8_0)
   [d4m] d4m = Mod (d4, q_u8_16)
   [d5] d5 = Div (d4, q_u8_16)
   [digitf8] digitf8 = Concat <axis: int = 0> (d0, d1, d2, d3, d4m, d5)
   [counts10] counts10 = ReduceSum <keepdims: int = 0> (input, rax_8)
   [cz_v] cz_v, cz_i = TopK <axis: int = 0, largest: int = 1, sorted: int = 1> (counts10, n_ax2)
   [cz_i_u8] cz_i_u8 = Cast <to: int = 2> (cz_i)
   [mode] mode = Gather <axis: int = 0> (cz_i_u8, one64)
   [d_ism] d_ism = Equal (digitf8, mode)
   [__sh_d_mscore] __sh_d_mscore = Shape (d_ism)
   [__hid_d_mscore] __hid_d_mscore = CenterCropPad (d_ism, __sh_d_mscore)
   [d_mscore] d_mscore = Cast <to: int = 10> (__hid_d_mscore)
   [mode_v] mode_v, mode_idx = TopK <axis: int = 0, largest: int = 1, sorted: int = 1> (d_mscore, k_mode_17)
   [__sh_mode_idx] __sh_mode_idx = Shape (mode_idx)
   [__hid_mv] __hid_mv = CenterCropPad (mode_v, __sh_mode_idx)
   [mv_i8] mv_i8 = CastLike (__hid_mv, i8_0)
   [d_r8] d_r8 = Where (d_ism, o_u8_0, digitf8)
   [__hid_d_rscore] __hid_d_rscore = CenterCropPad (d_r8, __sh_d_mscore)
   [d_rscore] d_rscore = Cast <to: int = 10> (__hid_d_rscore)
   [rare_v] rare_v, rare_idx = TopK <axis: int = 0, largest: int = 1, sorted: int = 1> (d_rscore, k_12)
   [rare_v6] rare_v6 = Gather <axis: int = 0> (rare_v, rare6_idx)
   [two_sprites_bool] two_sprites_bool = Cast <to: int = 9> (rare_v6)
   [grp_n] grp_n = Where (two_sprites_bool, i32_4, t_i32_2)
   [__hid_dm_idx8_x] __hid_dm_idx8_x = CenterCropPad (mode_idx, __sh_mode_idx)
   [dm_idx8] dm_idx8 = CastLike (__hid_dm_idx8_x, o_u8_0)
   [dm_off8] dm_off8 = Div (dm_idx8, q_u8_20)
   [dm_gblock] dm_gblock = Gather <axis: int = 0> (block_iu8x6, mode_idx)
   [dm_row8] dm_row8 = Div (dm_gblock, q_u8nb)
   [dm_block8] dm_block8 = Mod <fmod: int = 0> (dm_gblock, q_u8nb)
   [dm_basec8] dm_basec8 = Mul (dm_block8, q_u8B)
   [dm_col8_pre] dm_col8_pre = Add (dm_basec8, dm_off8)
   [dm_col8] dm_col8 = Sub (dm_col8_pre, q_u8_1)
   [__hid_dm_r_x] __hid_dm_r_x = CenterCropPad (dm_row8, __sh_mode_idx)
   [dm_r] dm_r = CastLike (__hid_dm_r_x, i8_0)
   [__hid_dm_c_x] __hid_dm_c_x = CenterCropPad (dm_col8, __sh_mode_idx)
   [dm_c] dm_c = CastLike (__hid_dm_c_x, i8_0)
   [dm_r1] dm_r1 = Unsqueeze (dm_r, axes_3)
   [z18_dyn] z18_dyn = CenterCropPad <axes: ints = [0]> (corr_ch_bg, __sh_mode_idx)
   [dm_c1] dm_c1 = Unsqueeze (dm_c, axes_3)
   [mode_coords] mode_coords = Concat <axis: int = 1> (dm_r1, dm_c1)
   [dr_idx8] dr_idx8 = Cast <to: int = 2> (rare_idx)
   [dr_off8] dr_off8 = Div (dr_idx8, q_u8_20)
   [dr_gblock] dr_gblock = Gather <axis: int = 0> (block_iu8x6, rare_idx)
   [dr_row8] dr_row8 = Div (dr_gblock, q_u8nb)
   [dr_block8] dr_block8 = Mod <fmod: int = 0> (dr_gblock, q_u8nb)
   [dr_basec8] dr_basec8 = Mul (dr_block8, q_u8B)
   [dr_col8_pre] dr_col8_pre = Add (dr_basec8, dr_off8)
   [dr_col8] dr_col8 = Sub (dr_col8_pre, q_u8_1)
   [dr_r] dr_r = Cast <to: int = 3> (dr_row8)
   [dr_c] dr_c = Cast <to: int = 3> (dr_col8)
   [dr_r1] dr_r1 = Unsqueeze (dr_r, axes_3)
   [dr_c1] dr_c1 = Unsqueeze (dr_c, axes_3)
   [rare_coords] rare_coords = Concat <axis: int = 1> (dr_r1, dr_c1)
   [grp_n2] grp_n2 = Add (grp_n, grp_n)
   [grp_jmod] grp_jmod = Mod (grp_j4, grp_n)
   [grp_midpos] grp_midpos = Add (grp_jmod, grp_n)
   [grp_minpos] grp_minpos = Add (grp_jmod, grp_n2)
   [grp_maxcoords] grp_maxcoords = Gather <axis: int = 0> (rare_coords, grp_jmod)
   [grp_midcoords] grp_midcoords = Gather <axis: int = 0> (rare_coords, grp_midpos)
   [anchor_coords] anchor_coords = Gather <axis: int = 0> (rare_coords, grp_minpos)
   [anchor_c1] anchor_c1 = Unsqueeze (anchor_coords, axes_3)
   [px_mode_coords] px_mode_coords = Gather <axis: int = 0> (mode_coords, px_idx9)
   [px_mv_i8] px_mv_i8 = Gather <axis: int = 0> (mv_i8, px_idx9)
   [px_mode_valid] px_mode_valid = Cast <to: int = 9> (px_mv_i8)
   [adiff] adiff = Sub (anchor_c1, px_mode_coords)
   [aabs] aabs = Abs (adiff)
   [acheb] acheb = ReduceMax <keepdims: int = 0> (aabs, n_ax2)
   [anear0] anear0 = LessOrEqual (acheb, i8_3)
   [anear] anear = And (anear0, px_mode_valid)
   [anearany] anearany = ReduceMax <keepdims: int = 0> (anear, axes_3)
   [smaski] smaski = Cast <to: int = 10> (anearany)
   [sv] sv, sidx = TopK <axis: int = 0, largest: int = 1, sorted: int = 1> (smaski, n_ax2)
   [cv] cv, cidx = TopK <axis: int = 0, largest: int = 0, sorted: int = 1> (smaski, n_ax2)
   [scoords] scoords = Gather <axis: int = 0> (anchor_coords, sidx)
   [ccoords] ccoords = Gather <axis: int = 0> (anchor_coords, cidx)
   [allanchors] allanchors = Concat <axis: int = 0> (scoords, ccoords)
   [pair_a1] pair_a1 = Unsqueeze (allanchors, axes_3)
   [pair_maxd] pair_maxd = Sub (pair_a1, grp_maxcoords)
   [pair_maxa] pair_maxa = Abs (pair_maxd)
   [pair_maxdist] pair_maxdist = ReduceMax <keepdims: int = 0> (pair_maxa, n_ax2)
   [pair_maxidx] pair_maxidx = ArgMin <axis: int = 1, keepdims: int = 1> (pair_maxdist)
   [pair_maxsel] pair_maxsel = Gather <axis: int = 0> (grp_maxcoords, pair_maxidx)
   [pair_midd] pair_midd = Sub (pair_a1, grp_midcoords)
   [pair_mida] pair_mida = Abs (pair_midd)
   [pair_middist] pair_middist = ReduceMax <keepdims: int = 0> (pair_mida, n_ax2)
   [pair_mididx] pair_mididx = ArgMin <axis: int = 1, keepdims: int = 1> (pair_middist)
   [pair_midsel] pair_midsel = Gather <axis: int = 0> (grp_midcoords, pair_mididx)
   [allmarkers] allmarkers = Concat <axis: int = 1> (pair_a1, pair_maxsel, pair_midsel)
   [rmax_f] rmax_f = Gather <axis: int = 0> (rare_v, rax_10)
   [rmid_f] rmid_f = Gather <axis: int = 0> (rare_v, grp_n)
   [rmin_f] rmin_f = Gather <axis: int = 0> (rare_v, grp_n2)
   [rmax_u8] rmax_u8 = Cast <to: int = 3> (rmax_f)
   [rmid_u8] rmid_u8 = Cast <to: int = 3> (rmid_f)
   [rmin_u8] rmin_u8 = Cast <to: int = 3> (rmin_f)
   [marker_colors] marker_colors = Concat <axis: int = 0> (rmin_u8, rmax_u8, rmid_u8)
   [source_markers] source_markers = Slice (allmarkers, rax_10, n_ax2, rax_10)
   [clone_markers] clone_markers = Slice (allmarkers, n_ax2, slice_e4, rax_10)
   [r_smarks] r_smarks = Slice (source_markers, axes_3, n_ax3, axes_3)
   [r_cmarks] r_cmarks = Slice (clone_markers, axes_3, n_ax3, axes_3)
   [n_sanchor1] n_sanchor1 = Unsqueeze (scoords, axes_3)
   [n_srel] n_srel = Sub (r_smarks, n_sanchor1)
   [n_canchor1] n_canchor1 = Unsqueeze (ccoords, axes_3)
   [n_crel] n_crel = Sub (r_cmarks, n_canchor1)
   [qsig_raw] qsig_raw = QLinearMatMul (n_srel, qmm_scale, i8_0, qsig_w, qmm_scale, i8_0, qmm_scale, i8_0)
   [rs_ssig] rs_ssig = Transpose <perm: ints = [0, 2, 1]> (qsig_raw)
   [qcsig_raw] qcsig_raw = QLinearMatMul (n_crel, qmm_scale, i8_0, qsig_wc, qmm_scale, i8_0, qmm_scale, i8_0)
   [qcsig_sq] qcsig_sq = Squeeze (qcsig_raw, n_ax2)
   [rs_ssig1] rs_ssig1 = Unsqueeze (rs_ssig, n_ax2)
   [n_releq] n_releq = Equal (rs_ssig1, qcsig_sq)
   [n_relscores_bool] n_relscores_bool = ReduceMin <keepdims: int = 0> (n_releq, n_ax3)
   [n_relscores] n_relscores = Cast <to: int = 2> (n_relscores_bool)
   [n_score8] n_score8 = Flatten <axis: int = 1> (n_relscores)
   [n_pair] n_pair = ArgMax <axis: int = 1, keepdims: int = 0> (n_score8)
   [t_pair8] t_pair8 = Cast <to: int = 3> (n_pair)
   [t_rot8] t_rot8 = Div (t_pair8, i8_2)
   [t_rot32] t_rot32 = Cast <to: int = 6> (t_rot8)
   [n_clone8] n_clone8 = Mod <fmod: int = 0> (t_pair8, i8_2)
   [n_clone32] n_clone32 = Cast <to: int = 6> (n_clone8)
   [n_csel] n_csel = Gather <axis: int = 0> (ccoords, n_clone32)
   [own_a0] own_a0 = Gather <axis: int = 0> (scoords, first0)
   [own_a1] own_a1 = Gather <axis: int = 0> (scoords, one64)
   [own_ad] own_ad = Sub (own_a0, own_a1)
   [own_aa] own_aa = Abs (own_ad)
   [own_dr] own_dr = Gather <axis: int = 0> (own_aa, first0)
   [own_dc] own_dc = Gather <axis: int = 0> (own_aa, one64)
   [own_axis_bool] own_axis_bool = LessOrEqual (own_dr, own_dc)
   [own_axis] own_axis = Cast <to: int = 6> (own_axis_bool)
   [own_mv] own_mv = Gather <axis: int = 1> (mode_coords, own_axis)
   [own_s0] own_s0 = Gather <axis: int = 0> (own_a0, own_axis)
   [own_s1] own_s1 = Gather <axis: int = 0> (own_a1, own_axis)
   [own_sum] own_sum = Add (own_s0, own_s1)
   [own_mid_floor] own_mid_floor = Div (own_sum, i8_2)
   [own_dir] own_dir = Greater (own_s1, own_s0)
   [own_gt] own_gt = Greater (own_mv, own_mid_floor)
   [n_ownerb] n_ownerb = Equal (own_gt, own_dir)
   [n_owner32] n_owner32 = CastLike (n_ownerb, t_i32_2)
   [rot_mats] rot_mats = Gather <axis: int = 0> (t_mats, t_rot32)
   [n_psa] n_psa = Gather <axis: int = 0> (scoords, n_owner32)
   [n_pca] n_pca = Gather <axis: int = 0> (n_csel, n_owner32)
   [n_prel] n_prel = Sub (mode_coords, n_psa)
   [n_mat] n_mat = Gather <axis: int = 0> (rot_mats, n_owner32)
   [n_prel1] n_prel1 = Unsqueeze (n_prel, axes_3)
   [n_txy1] n_txy1 = QLinearMatMul (n_prel1, qmm_scale, i8_0, n_mat, qmm_scale, i8_0, qmm_scale, i8_0)
   [n_txy] n_txy = Squeeze (n_txy1, axes_3)
   [n_target0] n_target0 = Add (n_txy, n_pca)
   [mode_target_coords] mode_target_coords = Clip (n_target0, i8_0, i8_29)
   [source_markers_flat] source_markers_flat = Flatten <axis: int = 2> (source_markers)
   [mode_i8] mode_i8 = Cast <to: int = 3> (mode)
   [mode18_col] mode18_col = Add (z18_dyn, mode_i8)
   [coords84] coords84 = Concat <axis: int = 0> (mode_coords, mode_coords, mode_target_coords, mode_target_coords, source_markers_flat, source_markers_flat, corr_coord_a, corr_coord_a, corr_coord_b, corr_coord_b)
   [marker_col3] marker_col3 = Unsqueeze (marker_colors, axes_3)
   [ch84] ch84 = Concat <axis: int = 0> (mode18_col, z18_dyn, mode18_col, z18_dyn, marker_col3, marker_col3, corr_ch_bg, corr_ch_bg, corr_ch_bg, corr_ch_bg, corr_ch_bg, corr_ch_bg, corr_ch_mode, corr_ch_bg, corr_ch_mode, corr_ch_bg)
   [neg_mv_i8] neg_mv_i8 = Neg (mv_i8)
   [corr_mode_v16] corr_mode_v16 = ReduceMin <keepdims: int = 1> (mv_i8, rax_10)
   [corr_mode8_bool] corr_mode8_bool = Equal (mode, corr_u8_8)
   [corr_gate_bool] corr_mode8_i8 = Cast <to: int = 3> (corr_mode8_bool)
   [corr_gate_i8] corr_gate_i8 = Mul (corr_mode_v16, corr_mode8_i8)
   [corr_neg_gate_i8] corr_neg_gate_i8 = Neg (corr_gate_i8)
   [scatter_updates_i8] scatter_updates_i8 = Concat <axis: int = 0> (neg_mv_i8, mv_i8, mv_i8, neg_mv_i8, neg_one1_i8, neg_one1_i8, neg_one1_i8, neg_one1_i8, neg_one1_i8, neg_one1_i8, one1_i8, one1_i8, one1_i8, one1_i8, one1_i8, one1_i8, corr_gate_i8, corr_neg_gate_i8, corr_neg_gate_i8, corr_gate_i8)
   [__sh_scatter_updates] __sh_scatter_updates = Shape (scatter_updates_i8)
   [z84_dyn] z84_dyn = CenterCropPad <axes: ints = [0]> (corr_ch_bg, __sh_scatter_updates)
   [ch84_hid] ch84_hid = CenterCropPad <axes: ints = [0]> (ch84, __sh_scatter_updates)
   [coords84_hid] coords84_hid = CenterCropPad <axes: ints = [0]> (coords84, __sh_scatter_updates)
   [scatter_idx8] scatter_idx8 = Concat <axis: int = 1> (z84_dyn, ch84_hid, coords84_hid)
   [__hid_scatter_idx64] __hid_scatter_idx64 = CenterCropPad <axes: ints = [0]> (scatter_idx8, __sh_scatter_updates)
   [scatter_idx64] scatter_idx64 = CastLike (__hid_scatter_idx64, first0)
   [__hid_scatter_updates] __hid_scatter_updates = CenterCropPad (scatter_updates_i8, __sh_scatter_updates)
   [scatter_updates] scatter_updates = CastLike (__hid_scatter_updates, input)
   [output] output = ScatterND <reduction: string = "add"> (input, scatter_idx64, scatter_updates)
}
