<
   ir_version: 10,
   opset_import: ["" : 18]
>
task286_p2v_corr_sparse (float[1,10,30,30] input) => (uint32[1,10,30,30] output) 
   <int64[1] shape4 =  {4}, uint16 u16_2 = ..., uint16 u16_4 = ..., float f0 =  {0}, int32[4] r_lut =  {1,0,1,0}, int32[4,1] c_lut =  {1,1,0,0}, uint8[1,10] baseidx = ..., uint8 u8_2 = ..., uint32[1,30,1] zero_rows = ..., uint32[1,1,1,30] colbits = ..., uint32[1,30,1] ce_mask = ..., float[30] parity_weight =  {1,-1,1,-1,1,-1,1,-1,1,-1,1,-1,1,-1,1,-1,1,-1,1,-1,1,-1,1,-1,1,-1,1,-1,1,-1}, uint32[2] sf_lut = ..., uint32[2] hf_lut = ..., float[10] cat0_w =  {0,0,0,0,0,0,0,0,1,0}, float[10] cat1_w =  {1,1,1,1,1,1,1,1,0,1}, float[10] cat2_w =  {0,1,1,1,1,1,1,1,0,1}, int32[1,13,1] node_base =  {0,2,4,6,8,10,12,14,16,18,20,22,24}, int32 i32_one =  {1}, float[30,2] col_pair_w =  {1,0,0,1,2,0,0,2,4,0,0,4,8,0,0,8,16,0,0,16,32,0,0,32,64,0,0,64,128,0,0,128,256,0,0,256,512,0,0,512,1024,0,0,1024,2048,0,0,2048,4096,0,0,4096,0,0,0,0,0,0,0,0}, int32[2,1] i2range =  {0,1}, float[2,1] sel_od =  {0,8192}, float[2,1] sel0f =  {1,0}, float[2,2,1] hdivsel =  {0,1,0.5,0}, uint16 u16_16 = ..., bool[1] ex_false = ..., int64[1] ex_shape1 =  {1}, int64[1,16,1] ex_add_indices =  {0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15}, uint32[5,1,16,1] ex_add_table = ..., uint16[1,1,1] ex_rcorr_1_0_val = ..., uint16[1,1,1] ex_rcorr_2_0_val = ..., uint16[1,1,1] ex_rcorr_3_0_val = ..., uint16[1,1,1] ex_rcorr_3_1_val = ..., uint16[1,1,1] ex_rcorr_5_0_val = ...>
{
   [checkmom] checkmom = Einsum <equation: string = "bcrs,c,r,s->bc"> (input, cat2_w, parity_weight, parity_weight)
   [present] present = Cast <to: int = 9> (checkmom)
   [evenraw] evenraw = Greater (checkmom, f0)
   [evenu8] evenu8 = Cast <to: int = 2> (evenraw)
   [twoMinus] twoMinus = Sub (u8_2, evenu8)
   [color_idx] color_idx = Where (present, twoMinus, baseidx)
   [color_idx_i] color_idx_i = Cast <to: int = 6> (color_idx)
   [par_f] par_f = Einsum <equation: string = "bcrs,c,rt,sp->pt"> (input, cat1_w, col_pair_w, col_pair_w)
   [parg] parg = Greater (par_f, f0)
   [par8n] par8n = Cast <to: int = 2> (parg)
   [par4n] par4n = Reshape (par8n, shape4)
   [f] f = ArgMin <axis: int = 0, keepdims: int = 0> (par4n)
   [rmod] rmod = Gather <axis: int = 0> (r_lut, f)
   [cmod] cmod = Gather <axis: int = 0> (c_lut, f)
   [node_rows] node_rows = Add (node_base, rmod)
   [vert_rows] vert_rows = Add (node_rows, i32_one)
   [eqsel] eqsel = Equal (i2range, cmod)
   [self_] self_ = Cast <to: int = 1> (eqsel)
   [seedsel_f] seedsel_f = Einsum <equation: string = "bcrs,c,sp,pq->brq"> (input, cat2_w, col_pair_w, self_)
   [S0f] S0f = GatherElements <axis: int = 1> (seedsel_f, node_rows)
   [S] S = Cast <to: int = 4> (S0f)
   [centeropen_f] centeropen_f = Einsum <equation: string = "bcrs,c,sp,pq->brq"> (input, cat1_w, col_pair_w, self_)
   [Vf] Vf = GatherElements <axis: int = 1> (centeropen_f, vert_rows)
   [V] V = Cast <to: int = 4> (Vf)
   [edgeopen_f] edgeopen_f = Einsum <equation: string = "bcrs,c,sp,zpq,zv->brq"> (input, cat1_w, col_pair_w, hdivsel, self_)
   [Hrawf] Hrawf = GatherElements <axis: int = 1> (edgeopen_f, node_rows)
   [H] H = Cast <to: int = 4> (Hrawf)
   [H_0] H_0, H_1, H_2, H_3, H_4, H_5, H_6, H_7, H_8, H_9, H_10, H_11, H_12 = Split <axis: int = 1, num_outputs: int = 13> (H)
   H2_0_local_div = Div (H_0, u16_2)
   H2_0 = BitwiseAnd (H_0, H2_0_local_div)
   H2_1_local_div = Div (H_1, u16_2)
   H2_1 = BitwiseAnd (H_1, H2_1_local_div)
   H2_2_local_div = Div (H_2, u16_2)
   H2_2 = BitwiseAnd (H_2, H2_2_local_div)
   H2_3_local_div = Div (H_3, u16_2)
   H2_3 = BitwiseAnd (H_3, H2_3_local_div)
   H2_4_local_div = Div (H_4, u16_2)
   H2_4 = BitwiseAnd (H_4, H2_4_local_div)
   H2_5_local_div = Div (H_5, u16_2)
   H2_5 = BitwiseAnd (H_5, H2_5_local_div)
   H2_6_local_div = Div (H_6, u16_2)
   H2_6 = BitwiseAnd (H_6, H2_6_local_div)
   H2_7_local_div = Div (H_7, u16_2)
   H2_7 = BitwiseAnd (H_7, H2_7_local_div)
   H2_8_local_div = Div (H_8, u16_2)
   H2_8 = BitwiseAnd (H_8, H2_8_local_div)
   H2_9_local_div = Div (H_9, u16_2)
   H2_9 = BitwiseAnd (H_9, H2_9_local_div)
   H2_10_local_div = Div (H_10, u16_2)
   H2_10 = BitwiseAnd (H_10, H2_10_local_div)
   H2_11_local_div = Div (H_11, u16_2)
   H2_11 = BitwiseAnd (H_11, H2_11_local_div)
   H2_12_local_div = Div (H_12, u16_2)
   H2_12 = BitwiseAnd (H_12, H2_12_local_div)
   [V_0] V_0, V_1, V_2, V_3, V_4, V_5, V_6, V_7, V_8, V_9, V_10, V_11, V_12 = Split <axis: int = 1, num_outputs: int = 13> (V)
   [S_0] S_0, S_1, S_2, S_3, S_4, S_5, S_6, S_7, S_8, S_9, S_10, S_11, S_12 = Split <axis: int = 1, num_outputs: int = 13> (S)
   H2_2_div4 = Div (H2_2, u16_4)
   H4_2 = BitwiseAnd (H2_2, H2_2_div4)
   H2_10_div4 = Div (H2_10, u16_4)
   H4_10 = BitwiseAnd (H2_10, H2_10_div4)
   p0_f1_up = BitwiseAnd (S_0, V_0)
   p0_f1_seed = BitwiseOr (S_1, p0_f1_up)
   p0_f1_a1 = BitwiseAnd (p0_f1_seed, H_1)
   p0_f1_b1 = Mul (p0_f1_a1, u16_2)
   p0_f1_c1 = Div (p0_f1_seed, u16_2)
   p0_f1_d1 = BitwiseAnd (p0_f1_c1, H_1)
   p0_f1_e1 = BitwiseOr (p0_f1_b1, p0_f1_d1)
   p0_f1_y1 = BitwiseOr (p0_f1_seed, p0_f1_e1)
   p0_f2_up = BitwiseAnd (p0_f1_y1, V_1)
   p0_f2_seed = BitwiseOr (S_2, p0_f2_up)
   p0_f2_a1 = BitwiseAnd (p0_f2_seed, H_2)
   p0_f2_b1 = Mul (p0_f2_a1, u16_2)
   p0_f2_c1 = Div (p0_f2_seed, u16_2)
   p0_f2_d1 = BitwiseAnd (p0_f2_c1, H_2)
   p0_f2_e1 = BitwiseOr (p0_f2_b1, p0_f2_d1)
   p0_f2_y1 = BitwiseOr (p0_f2_seed, p0_f2_e1)
   p0_f2_a2 = BitwiseAnd (p0_f2_y1, H2_2)
   p0_f2_b2 = Mul (p0_f2_a2, u16_4)
   p0_f2_c2 = Div (p0_f2_y1, u16_4)
   p0_f2_d2 = BitwiseAnd (p0_f2_c2, H2_2)
   p0_f2_e2 = BitwiseOr (p0_f2_b2, p0_f2_d2)
   p0_f2_y2 = BitwiseOr (p0_f2_y1, p0_f2_e2)
   p0_f3_up = BitwiseAnd (p0_f2_y2, V_2)
   p0_f3_seed = BitwiseOr (S_3, p0_f3_up)
   p0_f3_a1 = BitwiseAnd (p0_f3_seed, H_3)
   p0_f3_b1 = Mul (p0_f3_a1, u16_2)
   p0_f3_c1 = Div (p0_f3_seed, u16_2)
   p0_f3_d1 = BitwiseAnd (p0_f3_c1, H_3)
   p0_f3_e1 = BitwiseOr (p0_f3_b1, p0_f3_d1)
   p0_f3_y1 = BitwiseOr (p0_f3_seed, p0_f3_e1)
   p0_f4_up = BitwiseAnd (p0_f3_y1, V_3)
   p0_f4_seed = BitwiseOr (S_4, p0_f4_up)
   p0_f4_a1 = BitwiseAnd (p0_f4_seed, H_4)
   p0_f4_b1 = Mul (p0_f4_a1, u16_2)
   p0_f4_c1 = Div (p0_f4_seed, u16_2)
   p0_f4_d1 = BitwiseAnd (p0_f4_c1, H_4)
   p0_f4_e1 = BitwiseOr (p0_f4_b1, p0_f4_d1)
   p0_f4_y1 = BitwiseOr (p0_f4_seed, p0_f4_e1)
   p0_f4_a2 = BitwiseAnd (p0_f4_y1, H2_4)
   p0_f4_b2 = Mul (p0_f4_a2, u16_4)
   p0_f4_c2 = Div (p0_f4_y1, u16_4)
   p0_f4_d2 = BitwiseAnd (p0_f4_c2, H2_4)
   p0_f4_e2 = BitwiseOr (p0_f4_b2, p0_f4_d2)
   p0_f4_y2 = BitwiseOr (p0_f4_y1, p0_f4_e2)
   p0_f5_up = BitwiseAnd (p0_f4_y2, V_4)
   p0_f5_seed = BitwiseOr (S_5, p0_f5_up)
   p0_f6_up = BitwiseAnd (p0_f5_seed, V_5)
   p0_f6_seed = BitwiseOr (S_6, p0_f6_up)
   p0_f6_a1 = BitwiseAnd (p0_f6_seed, H_6)
   p0_f6_b1 = Mul (p0_f6_a1, u16_2)
   p0_f6_c1 = Div (p0_f6_seed, u16_2)
   p0_f6_d1 = BitwiseAnd (p0_f6_c1, H_6)
   p0_f6_e1 = BitwiseOr (p0_f6_b1, p0_f6_d1)
   p0_f6_y1 = BitwiseOr (p0_f6_seed, p0_f6_e1)
   p0_f6_a2 = BitwiseAnd (p0_f6_y1, H2_6)
   p0_f6_b2 = Mul (p0_f6_a2, u16_4)
   p0_f6_c2 = Div (p0_f6_y1, u16_4)
   p0_f6_d2 = BitwiseAnd (p0_f6_c2, H2_6)
   p0_f6_e2 = BitwiseOr (p0_f6_b2, p0_f6_d2)
   p0_f6_y2 = BitwiseOr (p0_f6_y1, p0_f6_e2)
   p0_f7_up = BitwiseAnd (p0_f6_y2, V_6)
   p0_f7_seed = BitwiseOr (S_7, p0_f7_up)
   p0_f7_a1 = BitwiseAnd (p0_f7_seed, H_7)
   p0_f7_b1 = Mul (p0_f7_a1, u16_2)
   p0_f7_c1 = Div (p0_f7_seed, u16_2)
   p0_f7_d1 = BitwiseAnd (p0_f7_c1, H_7)
   p0_f7_e1 = BitwiseOr (p0_f7_b1, p0_f7_d1)
   p0_f7_y1 = BitwiseOr (p0_f7_seed, p0_f7_e1)
   p0_f8_up = BitwiseAnd (p0_f7_y1, V_7)
   p0_f8_seed = BitwiseOr (S_8, p0_f8_up)
   p0_f8_a1 = BitwiseAnd (p0_f8_seed, H_8)
   p0_f8_b1 = Mul (p0_f8_a1, u16_2)
   p0_f8_c1 = Div (p0_f8_seed, u16_2)
   p0_f8_d1 = BitwiseAnd (p0_f8_c1, H_8)
   p0_f8_e1 = BitwiseOr (p0_f8_b1, p0_f8_d1)
   p0_f8_y1 = BitwiseOr (p0_f8_seed, p0_f8_e1)
   p0_f9_up = BitwiseAnd (p0_f8_y1, V_8)
   p0_f9_seed = BitwiseOr (S_9, p0_f9_up)
   p0_f9_a1 = BitwiseAnd (p0_f9_seed, H_9)
   p0_f9_b1 = Mul (p0_f9_a1, u16_2)
   p0_f9_c1 = Div (p0_f9_seed, u16_2)
   p0_f9_d1 = BitwiseAnd (p0_f9_c1, H_9)
   p0_f9_e1 = BitwiseOr (p0_f9_b1, p0_f9_d1)
   p0_f9_y1 = BitwiseOr (p0_f9_seed, p0_f9_e1)
   p0_f9_a2 = BitwiseAnd (p0_f9_y1, H2_9)
   p0_f9_b2 = Mul (p0_f9_a2, u16_4)
   p0_f9_c2 = Div (p0_f9_y1, u16_4)
   p0_f9_d2 = BitwiseAnd (p0_f9_c2, H2_9)
   p0_f9_e2 = BitwiseOr (p0_f9_b2, p0_f9_d2)
   p0_f9_y2 = BitwiseOr (p0_f9_y1, p0_f9_e2)
   p0_f10_up = BitwiseAnd (p0_f9_y2, V_9)
   p0_f10_seed = BitwiseOr (S_10, p0_f10_up)
   p0_f10_a1 = BitwiseAnd (p0_f10_seed, H_10)
   p0_f10_b1 = Mul (p0_f10_a1, u16_2)
   p0_f10_c1 = Div (p0_f10_seed, u16_2)
   p0_f10_d1 = BitwiseAnd (p0_f10_c1, H_10)
   p0_f10_e1 = BitwiseOr (p0_f10_b1, p0_f10_d1)
   p0_f10_y1 = BitwiseOr (p0_f10_seed, p0_f10_e1)
   p0_f11_up = BitwiseAnd (p0_f10_y1, V_10)
   p0_f11_seed = BitwiseOr (S_11, p0_f11_up)
   p0_f12_up = BitwiseAnd (p0_f11_seed, V_11)
   p0_f12_a1 = BitwiseAnd (p0_f12_up, H_12)
   p0_f12_b1 = Mul (p0_f12_a1, u16_2)
   p0_f12_c1 = Div (p0_f12_up, u16_2)
   p0_f12_d1 = BitwiseAnd (p0_f12_c1, H_12)
   p0_f12_e1 = BitwiseOr (p0_f12_b1, p0_f12_d1)
   p0_f12_y1 = BitwiseOr (p0_f12_up, p0_f12_e1)
   p0_b11_dn = BitwiseAnd (p0_f12_y1, V_11)
   p0_b10_dn = BitwiseAnd (p0_b11_dn, V_10)
   p0_b10_seed = BitwiseOr (p0_f10_y1, p0_b10_dn)
   p0_b10_a1 = BitwiseAnd (p0_b10_seed, H_10)
   p0_b10_b1 = Mul (p0_b10_a1, u16_2)
   p0_b10_c1 = Div (p0_b10_seed, u16_2)
   p0_b10_d1 = BitwiseAnd (p0_b10_c1, H_10)
   p0_b10_e1 = BitwiseOr (p0_b10_b1, p0_b10_d1)
   p0_b10_y1 = BitwiseOr (p0_b10_seed, p0_b10_e1)
   p0_b9_dn = BitwiseAnd (p0_b10_y1, V_9)
   p0_b9_a1 = BitwiseAnd (p0_b9_dn, H_9)
   p0_b9_b1 = Mul (p0_b9_a1, u16_2)
   p0_b9_c1 = Div (p0_b9_dn, u16_2)
   p0_b9_d1 = BitwiseAnd (p0_b9_c1, H_9)
   p0_b9_e1 = BitwiseOr (p0_b9_b1, p0_b9_d1)
   p0_b9_y1 = BitwiseOr (p0_b9_dn, p0_b9_e1)
   p0_b8_dn = BitwiseAnd (p0_b9_y1, V_8)
   p0_b8_seed = BitwiseOr (p0_f8_y1, p0_b8_dn)
   p0_b8_a1 = BitwiseAnd (p0_b8_seed, H_8)
   p0_b8_b1 = Mul (p0_b8_a1, u16_2)
   p0_b8_c1 = Div (p0_b8_seed, u16_2)
   p0_b8_d1 = BitwiseAnd (p0_b8_c1, H_8)
   p0_b8_e1 = BitwiseOr (p0_b8_b1, p0_b8_d1)
   p0_b8_y1 = BitwiseOr (p0_b8_seed, p0_b8_e1)
   p0_b7_dn = BitwiseAnd (p0_b8_y1, V_7)
   p0_b7_a1 = BitwiseAnd (p0_b7_dn, H_7)
   p0_b7_b1 = Mul (p0_b7_a1, u16_2)
   p0_b7_c1 = Div (p0_b7_dn, u16_2)
   p0_b7_d1 = BitwiseAnd (p0_b7_c1, H_7)
   p0_b7_e1 = BitwiseOr (p0_b7_b1, p0_b7_d1)
   p0_b7_y1 = BitwiseOr (p0_b7_dn, p0_b7_e1)
   p0_b6_dn = BitwiseAnd (p0_b7_y1, V_6)
   p0_b6_seed = BitwiseOr (p0_f6_y2, p0_b6_dn)
   p0_b6_a1 = BitwiseAnd (p0_b6_seed, H_6)
   p0_b6_b1 = Mul (p0_b6_a1, u16_2)
   p0_b6_c1 = Div (p0_b6_seed, u16_2)
   p0_b6_d1 = BitwiseAnd (p0_b6_c1, H_6)
   p0_b6_e1 = BitwiseOr (p0_b6_b1, p0_b6_d1)
   p0_b6_y1 = BitwiseOr (p0_b6_seed, p0_b6_e1)
   p0_b5_dn = BitwiseAnd (p0_b6_y1, V_5)
   p0_b5_seed = BitwiseOr (p0_f5_seed, p0_b5_dn)
   p0_b5_a1 = BitwiseAnd (p0_b5_seed, H_5)
   p0_b5_b1 = Mul (p0_b5_a1, u16_2)
   p0_b5_c1 = Div (p0_b5_seed, u16_2)
   p0_b5_d1 = BitwiseAnd (p0_b5_c1, H_5)
   p0_b5_e1 = BitwiseOr (p0_b5_b1, p0_b5_d1)
   p0_b5_y1 = BitwiseOr (p0_b5_seed, p0_b5_e1)
   p0_b5_a2 = BitwiseAnd (p0_b5_y1, H2_5)
   p0_b5_b2 = Mul (p0_b5_a2, u16_4)
   p0_b5_c2 = Div (p0_b5_y1, u16_4)
   p0_b5_d2 = BitwiseAnd (p0_b5_c2, H2_5)
   p0_b5_e2 = BitwiseOr (p0_b5_b2, p0_b5_d2)
   p0_b5_y2 = BitwiseOr (p0_b5_y1, p0_b5_e2)
   p0_b4_dn = BitwiseAnd (p0_b5_y2, V_4)
   p0_b4_seed = BitwiseOr (p0_f4_y2, p0_b4_dn)
   p0_b4_a1 = BitwiseAnd (p0_b4_seed, H_4)
   p0_b4_b1 = Mul (p0_b4_a1, u16_2)
   p0_b4_c1 = Div (p0_b4_seed, u16_2)
   p0_b4_d1 = BitwiseAnd (p0_b4_c1, H_4)
   p0_b4_e1 = BitwiseOr (p0_b4_b1, p0_b4_d1)
   p0_b4_y1 = BitwiseOr (p0_b4_seed, p0_b4_e1)
   p0_b4_a2 = BitwiseAnd (p0_b4_y1, H2_4)
   p0_b4_b2 = Mul (p0_b4_a2, u16_4)
   p0_b4_c2 = Div (p0_b4_y1, u16_4)
   p0_b4_d2 = BitwiseAnd (p0_b4_c2, H2_4)
   p0_b4_e2 = BitwiseOr (p0_b4_b2, p0_b4_d2)
   p0_b4_y2 = BitwiseOr (p0_b4_y1, p0_b4_e2)
   p0_b3_dn = BitwiseAnd (p0_b4_y2, V_3)
   p0_b3_seed = BitwiseOr (p0_f3_y1, p0_b3_dn)
   p0_b3_a1 = BitwiseAnd (p0_b3_seed, H_3)
   p0_b3_b1 = Mul (p0_b3_a1, u16_2)
   p0_b3_c1 = Div (p0_b3_seed, u16_2)
   p0_b3_d1 = BitwiseAnd (p0_b3_c1, H_3)
   p0_b3_e1 = BitwiseOr (p0_b3_b1, p0_b3_d1)
   p0_b3_y1 = BitwiseOr (p0_b3_seed, p0_b3_e1)
   p0_b3_a2 = BitwiseAnd (p0_b3_y1, H2_3)
   p0_b3_b2 = Mul (p0_b3_a2, u16_4)
   p0_b3_c2 = Div (p0_b3_y1, u16_4)
   p0_b3_d2 = BitwiseAnd (p0_b3_c2, H2_3)
   p0_b3_e2 = BitwiseOr (p0_b3_b2, p0_b3_d2)
   p0_b3_y2 = BitwiseOr (p0_b3_y1, p0_b3_e2)
   p0_b2_dn = BitwiseAnd (p0_b3_y2, V_2)
   p0_b2_a1 = BitwiseAnd (p0_b2_dn, H_2)
   p0_b2_b1 = Mul (p0_b2_a1, u16_2)
   p0_b2_c1 = Div (p0_b2_dn, u16_2)
   p0_b2_d1 = BitwiseAnd (p0_b2_c1, H_2)
   p0_b2_e1 = BitwiseOr (p0_b2_b1, p0_b2_d1)
   p0_b2_y1 = BitwiseOr (p0_b2_dn, p0_b2_e1)
   p0_b2_a2 = BitwiseAnd (p0_b2_y1, H2_2)
   p0_b2_b2 = Mul (p0_b2_a2, u16_4)
   p0_b2_c2 = Div (p0_b2_y1, u16_4)
   p0_b2_d2 = BitwiseAnd (p0_b2_c2, H2_2)
   p0_b2_e2 = BitwiseOr (p0_b2_b2, p0_b2_d2)
   p0_b2_y2 = BitwiseOr (p0_b2_y1, p0_b2_e2)
   p0_b1_dn = BitwiseAnd (p0_b2_y2, V_1)
   p0_b1_seed = BitwiseOr (p0_f1_y1, p0_b1_dn)
   p0_b1_a1 = BitwiseAnd (p0_b1_seed, H_1)
   p0_b1_b1 = Mul (p0_b1_a1, u16_2)
   p0_b1_c1 = Div (p0_b1_seed, u16_2)
   p0_b1_d1 = BitwiseAnd (p0_b1_c1, H_1)
   p0_b1_e1 = BitwiseOr (p0_b1_b1, p0_b1_d1)
   p0_b1_y1 = BitwiseOr (p0_b1_seed, p0_b1_e1)
   p0_b0_dn = BitwiseAnd (p0_b1_y1, V_0)
   p0_b0_a1 = BitwiseAnd (p0_b0_dn, H_0)
   p0_b0_b1 = Mul (p0_b0_a1, u16_2)
   p0_b0_c1 = Div (p0_b0_dn, u16_2)
   p0_b0_d1 = BitwiseAnd (p0_b0_c1, H_0)
   p0_b0_e1 = BitwiseOr (p0_b0_b1, p0_b0_d1)
   p0_b0_y1 = BitwiseOr (p0_b0_dn, p0_b0_e1)
   p0_b0_a2 = BitwiseAnd (p0_b0_y1, H2_0)
   p0_b0_b2 = Mul (p0_b0_a2, u16_4)
   p0_b0_c2 = Div (p0_b0_y1, u16_4)
   p0_b0_d2 = BitwiseAnd (p0_b0_c2, H2_0)
   p0_b0_e2 = BitwiseOr (p0_b0_b2, p0_b0_d2)
   p0_b0_y2 = BitwiseOr (p0_b0_y1, p0_b0_e2)
   p1_f1_up = BitwiseAnd (p0_b0_y2, V_0)
   p1_f1_seed = BitwiseOr (p0_b1_y1, p1_f1_up)
   p1_f1_a2 = BitwiseAnd (p1_f1_seed, H2_1)
   p1_f1_b2 = Mul (p1_f1_a2, u16_4)
   p1_f1_c2 = Div (p1_f1_seed, u16_4)
   p1_f1_d2 = BitwiseAnd (p1_f1_c2, H2_1)
   p1_f1_e2 = BitwiseOr (p1_f1_b2, p1_f1_d2)
   p1_f1_y2 = BitwiseOr (p1_f1_seed, p1_f1_e2)
   p1_f2_up = BitwiseAnd (p1_f1_y2, V_1)
   p1_f2_a1 = BitwiseAnd (p1_f2_up, H_2)
   p1_f2_b1 = Mul (p1_f2_a1, u16_2)
   p1_f2_c1 = Div (p1_f2_up, u16_2)
   p1_f2_d1 = BitwiseAnd (p1_f2_c1, H_2)
   p1_f2_e1 = BitwiseOr (p1_f2_b1, p1_f2_d1)
   p1_f2_y1 = BitwiseOr (p1_f2_up, p1_f2_e1)
   p1_f2_a2 = BitwiseAnd (p1_f2_y1, H2_2)
   p1_f2_b2 = Mul (p1_f2_a2, u16_4)
   p1_f2_c2 = Div (p1_f2_y1, u16_4)
   p1_f2_d2 = BitwiseAnd (p1_f2_c2, H2_2)
   p1_f2_e2 = BitwiseOr (p1_f2_b2, p1_f2_d2)
   p1_f2_y2 = BitwiseOr (p1_f2_y1, p1_f2_e2)
   p1_f2_a4 = BitwiseAnd (p1_f2_y2, H4_2)
   p1_f2_b4 = Mul (p1_f2_a4, u16_16)
   p1_f2_c4 = Div (p1_f2_y2, u16_16)
   p1_f2_d4 = BitwiseAnd (p1_f2_c4, H4_2)
   p1_f2_e4 = BitwiseOr (p1_f2_b4, p1_f2_d4)
   p1_f2_y4 = BitwiseOr (p1_f2_y2, p1_f2_e4)
   p1_f3_up = BitwiseAnd (p1_f2_y4, V_2)
   p1_f3_seed = BitwiseOr (p0_b3_y2, p1_f3_up)
   p1_f3_a1 = BitwiseAnd (p1_f3_seed, H_3)
   p1_f3_b1 = Mul (p1_f3_a1, u16_2)
   p1_f3_c1 = Div (p1_f3_seed, u16_2)
   p1_f3_d1 = BitwiseAnd (p1_f3_c1, H_3)
   p1_f3_e1 = BitwiseOr (p1_f3_b1, p1_f3_d1)
   p1_f3_y1 = BitwiseOr (p1_f3_seed, p1_f3_e1)
   p1_f4_up = BitwiseAnd (p1_f3_y1, V_3)
   p1_f4_a1 = BitwiseAnd (p1_f4_up, H_4)
   p1_f4_b1 = Mul (p1_f4_a1, u16_2)
   p1_f4_c1 = Div (p1_f4_up, u16_2)
   p1_f4_d1 = BitwiseAnd (p1_f4_c1, H_4)
   p1_f4_e1 = BitwiseOr (p1_f4_b1, p1_f4_d1)
   p1_f4_y1 = BitwiseOr (p1_f4_up, p1_f4_e1)
   p1_f4_a2 = BitwiseAnd (p1_f4_y1, H2_4)
   p1_f4_b2 = Mul (p1_f4_a2, u16_4)
   p1_f4_c2 = Div (p1_f4_y1, u16_4)
   p1_f4_d2 = BitwiseAnd (p1_f4_c2, H2_4)
   p1_f4_e2 = BitwiseOr (p1_f4_b2, p1_f4_d2)
   p1_f4_y2 = BitwiseOr (p1_f4_y1, p1_f4_e2)
   p1_f5_up = BitwiseAnd (p1_f4_y2, V_4)
   p1_f5_seed = BitwiseOr (p0_b5_y2, p1_f5_up)
   p1_f5_a1 = BitwiseAnd (p1_f5_seed, H_5)
   p1_f5_b1 = Mul (p1_f5_a1, u16_2)
   p1_f5_c1 = Div (p1_f5_seed, u16_2)
   p1_f5_d1 = BitwiseAnd (p1_f5_c1, H_5)
   p1_f5_e1 = BitwiseOr (p1_f5_b1, p1_f5_d1)
   p1_f5_y1 = BitwiseOr (p1_f5_seed, p1_f5_e1)
   p1_f5_a2 = BitwiseAnd (p1_f5_y1, H2_5)
   p1_f5_b2 = Mul (p1_f5_a2, u16_4)
   p1_f5_c2 = Div (p1_f5_y1, u16_4)
   p1_f5_d2 = BitwiseAnd (p1_f5_c2, H2_5)
   p1_f5_e2 = BitwiseOr (p1_f5_b2, p1_f5_d2)
   p1_f5_y2 = BitwiseOr (p1_f5_y1, p1_f5_e2)
   p1_f6_up = BitwiseAnd (p1_f5_y2, V_5)
   p1_f6_seed = BitwiseOr (p0_b6_y1, p1_f6_up)
   p1_f6_a1 = BitwiseAnd (p1_f6_seed, H_6)
   p1_f6_b1 = Mul (p1_f6_a1, u16_2)
   p1_f6_c1 = Div (p1_f6_seed, u16_2)
   p1_f6_d1 = BitwiseAnd (p1_f6_c1, H_6)
   p1_f6_e1 = BitwiseOr (p1_f6_b1, p1_f6_d1)
   p1_f6_y1 = BitwiseOr (p1_f6_seed, p1_f6_e1)
   p1_f6_a2 = BitwiseAnd (p1_f6_y1, H2_6)
   p1_f6_b2 = Mul (p1_f6_a2, u16_4)
   p1_f6_c2 = Div (p1_f6_y1, u16_4)
   p1_f6_d2 = BitwiseAnd (p1_f6_c2, H2_6)
   p1_f6_e2 = BitwiseOr (p1_f6_b2, p1_f6_d2)
   p1_f6_y2 = BitwiseOr (p1_f6_y1, p1_f6_e2)
   p1_f7_up = BitwiseAnd (p1_f6_y2, V_6)
   p1_f7_a1 = BitwiseAnd (p1_f7_up, H_7)
   p1_f7_b1 = Mul (p1_f7_a1, u16_2)
   p1_f7_c1 = Div (p1_f7_up, u16_2)
   p1_f7_d1 = BitwiseAnd (p1_f7_c1, H_7)
   p1_f7_e1 = BitwiseOr (p1_f7_b1, p1_f7_d1)
   p1_f7_y1 = BitwiseOr (p1_f7_up, p1_f7_e1)
   p1_f7_a2 = BitwiseAnd (p1_f7_y1, H2_7)
   p1_f7_b2 = Mul (p1_f7_a2, u16_4)
   p1_f7_c2 = Div (p1_f7_y1, u16_4)
   p1_f7_d2 = BitwiseAnd (p1_f7_c2, H2_7)
   p1_f7_e2 = BitwiseOr (p1_f7_b2, p1_f7_d2)
   p1_f7_y2 = BitwiseOr (p1_f7_y1, p1_f7_e2)
   p1_f8_up = BitwiseAnd (p1_f7_y2, V_7)
   p1_f8_seed = BitwiseOr (p0_b8_y1, p1_f8_up)
   p1_f8_a1 = BitwiseAnd (p1_f8_seed, H_8)
   p1_f8_b1 = Mul (p1_f8_a1, u16_2)
   p1_f8_c1 = Div (p1_f8_seed, u16_2)
   p1_f8_d1 = BitwiseAnd (p1_f8_c1, H_8)
   p1_f8_e1 = BitwiseOr (p1_f8_b1, p1_f8_d1)
   p1_f8_y1 = BitwiseOr (p1_f8_seed, p1_f8_e1)
   p1_f8_a2 = BitwiseAnd (p1_f8_y1, H2_8)
   p1_f8_b2 = Mul (p1_f8_a2, u16_4)
   p1_f8_c2 = Div (p1_f8_y1, u16_4)
   p1_f8_d2 = BitwiseAnd (p1_f8_c2, H2_8)
   p1_f8_e2 = BitwiseOr (p1_f8_b2, p1_f8_d2)
   p1_f8_y2 = BitwiseOr (p1_f8_y1, p1_f8_e2)
   p1_f9_up = BitwiseAnd (p1_f8_y2, V_8)
   p1_f9_a1 = BitwiseAnd (p1_f9_up, H_9)
   p1_f9_b1 = Mul (p1_f9_a1, u16_2)
   p1_f9_c1 = Div (p1_f9_up, u16_2)
   p1_f9_d1 = BitwiseAnd (p1_f9_c1, H_9)
   p1_f9_e1 = BitwiseOr (p1_f9_b1, p1_f9_d1)
   p1_f9_y1 = BitwiseOr (p1_f9_up, p1_f9_e1)
   p1_f9_a2 = BitwiseAnd (p1_f9_y1, H2_9)
   p1_f9_b2 = Mul (p1_f9_a2, u16_4)
   p1_f9_c2 = Div (p1_f9_y1, u16_4)
   p1_f9_d2 = BitwiseAnd (p1_f9_c2, H2_9)
   p1_f9_e2 = BitwiseOr (p1_f9_b2, p1_f9_d2)
   p1_f9_y2 = BitwiseOr (p1_f9_y1, p1_f9_e2)
   p1_f10_up = BitwiseAnd (p1_f9_y2, V_9)
   p1_f10_seed = BitwiseOr (p0_b10_y1, p1_f10_up)
   p1_f10_a1 = BitwiseAnd (p1_f10_seed, H_10)
   p1_f10_b1 = Mul (p1_f10_a1, u16_2)
   p1_f10_c1 = Div (p1_f10_seed, u16_2)
   p1_f10_d1 = BitwiseAnd (p1_f10_c1, H_10)
   p1_f10_e1 = BitwiseOr (p1_f10_b1, p1_f10_d1)
   p1_f10_y1 = BitwiseOr (p1_f10_seed, p1_f10_e1)
   p1_f10_a2 = BitwiseAnd (p1_f10_y1, H2_10)
   p1_f10_b2 = Mul (p1_f10_a2, u16_4)
   p1_f10_c2 = Div (p1_f10_y1, u16_4)
   p1_f10_d2 = BitwiseAnd (p1_f10_c2, H2_10)
   p1_f10_e2 = BitwiseOr (p1_f10_b2, p1_f10_d2)
   p1_f10_y2 = BitwiseOr (p1_f10_y1, p1_f10_e2)
   p1_f10_a4 = BitwiseAnd (p1_f10_y2, H4_10)
   p1_f10_b4 = Mul (p1_f10_a4, u16_16)
   p1_f10_c4 = Div (p1_f10_y2, u16_16)
   p1_f10_d4 = BitwiseAnd (p1_f10_c4, H4_10)
   p1_f10_e4 = BitwiseOr (p1_f10_b4, p1_f10_d4)
   p1_f10_y4 = BitwiseOr (p1_f10_y2, p1_f10_e4)
   p1_f11_up = BitwiseAnd (p1_f10_y4, V_10)
   p1_f11_a1 = BitwiseAnd (p1_f11_up, H_11)
   p1_f11_b1 = Mul (p1_f11_a1, u16_2)
   p1_f11_c1 = Div (p1_f11_up, u16_2)
   p1_f11_d1 = BitwiseAnd (p1_f11_c1, H_11)
   p1_f11_e1 = BitwiseOr (p1_f11_b1, p1_f11_d1)
   p1_f11_y1 = BitwiseOr (p1_f11_up, p1_f11_e1)
   p1_f11_a2 = BitwiseAnd (p1_f11_y1, H2_11)
   p1_f11_b2 = Mul (p1_f11_a2, u16_4)
   p1_f11_c2 = Div (p1_f11_y1, u16_4)
   p1_f11_d2 = BitwiseAnd (p1_f11_c2, H2_11)
   p1_f11_e2 = BitwiseOr (p1_f11_b2, p1_f11_d2)
   p1_f11_y2 = BitwiseOr (p1_f11_y1, p1_f11_e2)
   p1_f12_up = BitwiseAnd (p1_f11_y2, V_11)
   p1_f12_seed = BitwiseOr (p0_f12_y1, p1_f12_up)
   p1_f12_a1 = BitwiseAnd (p1_f12_seed, H_12)
   p1_f12_b1 = Mul (p1_f12_a1, u16_2)
   p1_f12_c1 = Div (p1_f12_seed, u16_2)
   p1_f12_d1 = BitwiseAnd (p1_f12_c1, H_12)
   p1_f12_e1 = BitwiseOr (p1_f12_b1, p1_f12_d1)
   p1_f12_y1 = BitwiseOr (p1_f12_seed, p1_f12_e1)
   p1_f12_a2 = BitwiseAnd (p1_f12_y1, H2_12)
   p1_f12_b2 = Mul (p1_f12_a2, u16_4)
   p1_f12_c2 = Div (p1_f12_y1, u16_4)
   p1_f12_d2 = BitwiseAnd (p1_f12_c2, H2_12)
   p1_f12_e2 = BitwiseOr (p1_f12_b2, p1_f12_d2)
   p1_f12_y2 = BitwiseOr (p1_f12_y1, p1_f12_e2)
   p1_b11_dn = BitwiseAnd (p1_f12_y2, V_11)
   p1_b11_seed = BitwiseOr (p1_f11_y2, p1_b11_dn)
   p1_b11_a1 = BitwiseAnd (p1_b11_seed, H_11)
   p1_b11_b1 = Mul (p1_b11_a1, u16_2)
   p1_b11_c1 = Div (p1_b11_seed, u16_2)
   p1_b11_d1 = BitwiseAnd (p1_b11_c1, H_11)
   p1_b11_e1 = BitwiseOr (p1_b11_b1, p1_b11_d1)
   p1_b11_y1 = BitwiseOr (p1_b11_seed, p1_b11_e1)
   p1_b10_dn = BitwiseAnd (p1_b11_y1, V_10)
   p1_b10_seed = BitwiseOr (p1_f10_y4, p1_b10_dn)
   p1_b10_a1 = BitwiseAnd (p1_b10_seed, H_10)
   p1_b10_b1 = Mul (p1_b10_a1, u16_2)
   p1_b10_c1 = Div (p1_b10_seed, u16_2)
   p1_b10_d1 = BitwiseAnd (p1_b10_c1, H_10)
   p1_b10_e1 = BitwiseOr (p1_b10_b1, p1_b10_d1)
   p1_b10_y1 = BitwiseOr (p1_b10_seed, p1_b10_e1)
   p1_b9_dn = BitwiseAnd (p1_b10_y1, V_9)
   p1_b9_seed = BitwiseOr (p1_f9_y2, p1_b9_dn)
   p1_b9_a1 = BitwiseAnd (p1_b9_seed, H_9)
   p1_b9_b1 = Mul (p1_b9_a1, u16_2)
   p1_b9_c1 = Div (p1_b9_seed, u16_2)
   p1_b9_d1 = BitwiseAnd (p1_b9_c1, H_9)
   p1_b9_e1 = BitwiseOr (p1_b9_b1, p1_b9_d1)
   p1_b9_y1 = BitwiseOr (p1_b9_seed, p1_b9_e1)
   p1_b9_a2 = BitwiseAnd (p1_b9_y1, H2_9)
   p1_b9_b2 = Mul (p1_b9_a2, u16_4)
   p1_b9_c2 = Div (p1_b9_y1, u16_4)
   p1_b9_d2 = BitwiseAnd (p1_b9_c2, H2_9)
   p1_b9_e2 = BitwiseOr (p1_b9_b2, p1_b9_d2)
   p1_b9_y2 = BitwiseOr (p1_b9_y1, p1_b9_e2)
   p1_b8_dn = BitwiseAnd (p1_b9_y2, V_8)
   p1_b8_seed = BitwiseOr (p1_f8_y2, p1_b8_dn)
   p1_b8_a1 = BitwiseAnd (p1_b8_seed, H_8)
   p1_b8_b1 = Mul (p1_b8_a1, u16_2)
   p1_b8_c1 = Div (p1_b8_seed, u16_2)
   p1_b8_d1 = BitwiseAnd (p1_b8_c1, H_8)
   p1_b8_e1 = BitwiseOr (p1_b8_b1, p1_b8_d1)
   p1_b8_y1 = BitwiseOr (p1_b8_seed, p1_b8_e1)
   p1_b8_a2 = BitwiseAnd (p1_b8_y1, H2_8)
   p1_b8_b2 = Mul (p1_b8_a2, u16_4)
   p1_b8_c2 = Div (p1_b8_y1, u16_4)
   p1_b8_d2 = BitwiseAnd (p1_b8_c2, H2_8)
   p1_b8_e2 = BitwiseOr (p1_b8_b2, p1_b8_d2)
   p1_b8_y2 = BitwiseOr (p1_b8_y1, p1_b8_e2)
   p1_b7_dn = BitwiseAnd (p1_b8_y2, V_7)
   p1_b7_seed = BitwiseOr (p1_f7_y2, p1_b7_dn)
   p1_b7_a1 = BitwiseAnd (p1_b7_seed, H_7)
   p1_b7_b1 = Mul (p1_b7_a1, u16_2)
   p1_b7_c1 = Div (p1_b7_seed, u16_2)
   p1_b7_d1 = BitwiseAnd (p1_b7_c1, H_7)
   p1_b7_e1 = BitwiseOr (p1_b7_b1, p1_b7_d1)
   p1_b7_y1 = BitwiseOr (p1_b7_seed, p1_b7_e1)
   p1_b7_a2 = BitwiseAnd (p1_b7_y1, H2_7)
   p1_b7_b2 = Mul (p1_b7_a2, u16_4)
   p1_b7_c2 = Div (p1_b7_y1, u16_4)
   p1_b7_d2 = BitwiseAnd (p1_b7_c2, H2_7)
   p1_b7_e2 = BitwiseOr (p1_b7_b2, p1_b7_d2)
   p1_b7_y2 = BitwiseOr (p1_b7_y1, p1_b7_e2)
   p1_b6_dn = BitwiseAnd (p1_b7_y2, V_6)
   p1_b6_seed = BitwiseOr (p1_f6_y2, p1_b6_dn)
   p1_b6_a1 = BitwiseAnd (p1_b6_seed, H_6)
   p1_b6_b1 = Mul (p1_b6_a1, u16_2)
   p1_b6_c1 = Div (p1_b6_seed, u16_2)
   p1_b6_d1 = BitwiseAnd (p1_b6_c1, H_6)
   p1_b6_e1 = BitwiseOr (p1_b6_b1, p1_b6_d1)
   p1_b6_y1 = BitwiseOr (p1_b6_seed, p1_b6_e1)
   p1_b6_a2 = BitwiseAnd (p1_b6_y1, H2_6)
   p1_b6_b2 = Mul (p1_b6_a2, u16_4)
   p1_b6_c2 = Div (p1_b6_y1, u16_4)
   p1_b6_d2 = BitwiseAnd (p1_b6_c2, H2_6)
   p1_b6_e2 = BitwiseOr (p1_b6_b2, p1_b6_d2)
   p1_b6_y2 = BitwiseOr (p1_b6_y1, p1_b6_e2)
   p1_b5_dn = BitwiseAnd (p1_b6_y2, V_5)
   p1_b5_seed = BitwiseOr (p1_f5_y2, p1_b5_dn)
   p1_b5_a1 = BitwiseAnd (p1_b5_seed, H_5)
   p1_b5_b1 = Mul (p1_b5_a1, u16_2)
   p1_b5_c1 = Div (p1_b5_seed, u16_2)
   p1_b5_d1 = BitwiseAnd (p1_b5_c1, H_5)
   p1_b5_e1 = BitwiseOr (p1_b5_b1, p1_b5_d1)
   p1_b5_y1 = BitwiseOr (p1_b5_seed, p1_b5_e1)
   p1_b5_a2 = BitwiseAnd (p1_b5_y1, H2_5)
   p1_b5_b2 = Mul (p1_b5_a2, u16_4)
   p1_b5_c2 = Div (p1_b5_y1, u16_4)
   p1_b5_d2 = BitwiseAnd (p1_b5_c2, H2_5)
   p1_b5_e2 = BitwiseOr (p1_b5_b2, p1_b5_d2)
   p1_b5_y2 = BitwiseOr (p1_b5_y1, p1_b5_e2)
   p1_b4_dn = BitwiseAnd (p1_b5_y2, V_4)
   p1_b4_seed = BitwiseOr (p1_f4_y2, p1_b4_dn)
   p1_b4_a1 = BitwiseAnd (p1_b4_seed, H_4)
   p1_b4_b1 = Mul (p1_b4_a1, u16_2)
   p1_b4_c1 = Div (p1_b4_seed, u16_2)
   p1_b4_d1 = BitwiseAnd (p1_b4_c1, H_4)
   p1_b4_e1 = BitwiseOr (p1_b4_b1, p1_b4_d1)
   p1_b4_y1 = BitwiseOr (p1_b4_seed, p1_b4_e1)
   p1_b4_a2 = BitwiseAnd (p1_b4_y1, H2_4)
   p1_b4_b2 = Mul (p1_b4_a2, u16_4)
   p1_b4_c2 = Div (p1_b4_y1, u16_4)
   p1_b4_d2 = BitwiseAnd (p1_b4_c2, H2_4)
   p1_b4_e2 = BitwiseOr (p1_b4_b2, p1_b4_d2)
   p1_b4_y2 = BitwiseOr (p1_b4_y1, p1_b4_e2)
   p1_b3_dn = BitwiseAnd (p1_b4_y2, V_3)
   p1_b3_seed = BitwiseOr (p1_f3_y1, p1_b3_dn)
   p1_b3_a1 = BitwiseAnd (p1_b3_seed, H_3)
   p1_b3_b1 = Mul (p1_b3_a1, u16_2)
   p1_b3_c1 = Div (p1_b3_seed, u16_2)
   p1_b3_d1 = BitwiseAnd (p1_b3_c1, H_3)
   p1_b3_e1 = BitwiseOr (p1_b3_b1, p1_b3_d1)
   p1_b3_y1 = BitwiseOr (p1_b3_seed, p1_b3_e1)
   p1_b3_a2 = BitwiseAnd (p1_b3_y1, H2_3)
   p1_b3_b2 = Mul (p1_b3_a2, u16_4)
   p1_b3_c2 = Div (p1_b3_y1, u16_4)
   p1_b3_d2 = BitwiseAnd (p1_b3_c2, H2_3)
   p1_b3_e2 = BitwiseOr (p1_b3_b2, p1_b3_d2)
   p1_b3_y2 = BitwiseOr (p1_b3_y1, p1_b3_e2)
   p1_b2_dn = BitwiseAnd (p1_b3_y2, V_2)
   p1_b2_a1 = BitwiseAnd (p1_b2_dn, H_2)
   p1_b2_b1 = Mul (p1_b2_a1, u16_2)
   p1_b2_c1 = Div (p1_b2_dn, u16_2)
   p1_b2_d1 = BitwiseAnd (p1_b2_c1, H_2)
   p1_b2_e1 = BitwiseOr (p1_b2_b1, p1_b2_d1)
   p1_b2_y1 = BitwiseOr (p1_b2_dn, p1_b2_e1)
   p1_b2_a2 = BitwiseAnd (p1_b2_y1, H2_2)
   p1_b2_b2 = Mul (p1_b2_a2, u16_4)
   p1_b2_c2 = Div (p1_b2_y1, u16_4)
   p1_b2_d2 = BitwiseAnd (p1_b2_c2, H2_2)
   p1_b2_e2 = BitwiseOr (p1_b2_b2, p1_b2_d2)
   p1_b2_y2 = BitwiseOr (p1_b2_y1, p1_b2_e2)
   p1_b1_dn = BitwiseAnd (p1_b2_y2, V_1)
   p1_b1_seed = BitwiseOr (p1_f1_y2, p1_b1_dn)
   p1_b1_a1 = BitwiseAnd (p1_b1_seed, H_1)
   p1_b1_b1 = Mul (p1_b1_a1, u16_2)
   p1_b1_c1 = Div (p1_b1_seed, u16_2)
   p1_b1_d1 = BitwiseAnd (p1_b1_c1, H_1)
   p1_b1_e1 = BitwiseOr (p1_b1_b1, p1_b1_d1)
   p1_b1_y1 = BitwiseOr (p1_b1_seed, p1_b1_e1)
   p1_b1_a2 = BitwiseAnd (p1_b1_y1, H2_1)
   p1_b1_b2 = Mul (p1_b1_a2, u16_4)
   p1_b1_c2 = Div (p1_b1_y1, u16_4)
   p1_b1_d2 = BitwiseAnd (p1_b1_c2, H2_1)
   p1_b1_e2 = BitwiseOr (p1_b1_b2, p1_b1_d2)
   p1_b1_y2 = BitwiseOr (p1_b1_y1, p1_b1_e2)
   p1_b0_dn = BitwiseAnd (p1_b1_y2, V_0)
   p1_b0_seed = BitwiseOr (p0_b0_y2, p1_b0_dn)
   p1_b0_a1 = BitwiseAnd (p1_b0_seed, H_0)
   p1_b0_b1 = Mul (p1_b0_a1, u16_2)
   p1_b0_c1 = Div (p1_b0_seed, u16_2)
   p1_b0_d1 = BitwiseAnd (p1_b0_c1, H_0)
   p1_b0_e1 = BitwiseOr (p1_b0_b1, p1_b0_d1)
   p1_b0_y1 = BitwiseOr (p1_b0_seed, p1_b0_e1)
   p1_b0_a2 = BitwiseAnd (p1_b0_y1, H2_0)
   p1_b0_b2 = Mul (p1_b0_a2, u16_4)
   p1_b0_c2 = Div (p1_b0_y1, u16_4)
   p1_b0_d2 = BitwiseAnd (p1_b0_c2, H2_0)
   p1_b0_e2 = BitwiseOr (p1_b0_b2, p1_b0_d2)
   p1_b0_y2 = BitwiseOr (p1_b0_y1, p1_b0_e2)
   p2_f1_up = BitwiseAnd (p1_b0_y2, V_0)
   p2_f1_seed = BitwiseOr (p1_b1_y2, p2_f1_up)
   p2_f1_a1 = BitwiseAnd (p2_f1_seed, H_1)
   p2_f1_b1 = Mul (p2_f1_a1, u16_2)
   p2_f1_c1 = Div (p2_f1_seed, u16_2)
   p2_f1_d1 = BitwiseAnd (p2_f1_c1, H_1)
   p2_f1_e1 = BitwiseOr (p2_f1_b1, p2_f1_d1)
   p2_f1_y1 = BitwiseOr (p2_f1_seed, p2_f1_e1)
   p2_f1_a2 = BitwiseAnd (p2_f1_y1, H2_1)
   p2_f1_b2 = Mul (p2_f1_a2, u16_4)
   p2_f1_c2 = Div (p2_f1_y1, u16_4)
   p2_f1_d2 = BitwiseAnd (p2_f1_c2, H2_1)
   p2_f1_e2 = BitwiseOr (p2_f1_b2, p2_f1_d2)
   p2_f1_y2 = BitwiseOr (p2_f1_y1, p2_f1_e2)
   p2_f2_up = BitwiseAnd (p2_f1_y2, V_1)
   p2_f2_a1 = BitwiseAnd (p2_f2_up, H_2)
   p2_f2_b1 = Mul (p2_f2_a1, u16_2)
   p2_f2_c1 = Div (p2_f2_up, u16_2)
   p2_f2_d1 = BitwiseAnd (p2_f2_c1, H_2)
   p2_f2_e1 = BitwiseOr (p2_f2_b1, p2_f2_d1)
   p2_f2_y1 = BitwiseOr (p2_f2_up, p2_f2_e1)
   p2_f2_a2 = BitwiseAnd (p2_f2_y1, H2_2)
   p2_f2_b2 = Mul (p2_f2_a2, u16_4)
   p2_f2_c2 = Div (p2_f2_y1, u16_4)
   p2_f2_d2 = BitwiseAnd (p2_f2_c2, H2_2)
   p2_f2_e2 = BitwiseOr (p2_f2_b2, p2_f2_d2)
   p2_f2_y2 = BitwiseOr (p2_f2_y1, p2_f2_e2)
   p2_f3_up = BitwiseAnd (p2_f2_y2, V_2)
   p2_f3_seed = BitwiseOr (p1_b3_y2, p2_f3_up)
   p2_f3_a1 = BitwiseAnd (p2_f3_seed, H_3)
   p2_f3_b1 = Mul (p2_f3_a1, u16_2)
   p2_f3_c1 = Div (p2_f3_seed, u16_2)
   p2_f3_d1 = BitwiseAnd (p2_f3_c1, H_3)
   p2_f3_e1 = BitwiseOr (p2_f3_b1, p2_f3_d1)
   p2_f3_y1 = BitwiseOr (p2_f3_seed, p2_f3_e1)
   p2_f3_a2 = BitwiseAnd (p2_f3_y1, H2_3)
   p2_f3_b2 = Mul (p2_f3_a2, u16_4)
   p2_f3_c2 = Div (p2_f3_y1, u16_4)
   p2_f3_d2 = BitwiseAnd (p2_f3_c2, H2_3)
   p2_f3_e2 = BitwiseOr (p2_f3_b2, p2_f3_d2)
   p2_f3_y2 = BitwiseOr (p2_f3_y1, p2_f3_e2)
   p2_f4_up = BitwiseAnd (p2_f3_y2, V_3)
   p2_f4_seed = BitwiseOr (p1_b4_y2, p2_f4_up)
   p2_f4_a1 = BitwiseAnd (p2_f4_seed, H_4)
   p2_f4_b1 = Mul (p2_f4_a1, u16_2)
   p2_f4_c1 = Div (p2_f4_seed, u16_2)
   p2_f4_d1 = BitwiseAnd (p2_f4_c1, H_4)
   p2_f4_e1 = BitwiseOr (p2_f4_b1, p2_f4_d1)
   p2_f4_y1 = BitwiseOr (p2_f4_seed, p2_f4_e1)
   p2_f4_a2 = BitwiseAnd (p2_f4_y1, H2_4)
   p2_f4_b2 = Mul (p2_f4_a2, u16_4)
   p2_f4_c2 = Div (p2_f4_y1, u16_4)
   p2_f4_d2 = BitwiseAnd (p2_f4_c2, H2_4)
   p2_f4_e2 = BitwiseOr (p2_f4_b2, p2_f4_d2)
   p2_f4_y2 = BitwiseOr (p2_f4_y1, p2_f4_e2)
   p2_f5_up = BitwiseAnd (p2_f4_y2, V_4)
   p2_f5_a1 = BitwiseAnd (p2_f5_up, H_5)
   p2_f5_b1 = Mul (p2_f5_a1, u16_2)
   p2_f5_c1 = Div (p2_f5_up, u16_2)
   p2_f5_d1 = BitwiseAnd (p2_f5_c1, H_5)
   p2_f5_e1 = BitwiseOr (p2_f5_b1, p2_f5_d1)
   p2_f5_y1 = BitwiseOr (p2_f5_up, p2_f5_e1)
   p2_f5_a2 = BitwiseAnd (p2_f5_y1, H2_5)
   p2_f5_b2 = Mul (p2_f5_a2, u16_4)
   p2_f5_c2 = Div (p2_f5_y1, u16_4)
   p2_f5_d2 = BitwiseAnd (p2_f5_c2, H2_5)
   p2_f5_e2 = BitwiseOr (p2_f5_b2, p2_f5_d2)
   p2_f5_y2 = BitwiseOr (p2_f5_y1, p2_f5_e2)
   p2_f6_up = BitwiseAnd (p2_f5_y2, V_5)
   p2_f6_seed = BitwiseOr (p1_b6_y2, p2_f6_up)
   p2_f6_a1 = BitwiseAnd (p2_f6_seed, H_6)
   p2_f6_b1 = Mul (p2_f6_a1, u16_2)
   p2_f6_c1 = Div (p2_f6_seed, u16_2)
   p2_f6_d1 = BitwiseAnd (p2_f6_c1, H_6)
   p2_f6_e1 = BitwiseOr (p2_f6_b1, p2_f6_d1)
   p2_f6_y1 = BitwiseOr (p2_f6_seed, p2_f6_e1)
   p2_f6_a2 = BitwiseAnd (p2_f6_y1, H2_6)
   p2_f6_b2 = Mul (p2_f6_a2, u16_4)
   p2_f6_c2 = Div (p2_f6_y1, u16_4)
   p2_f6_d2 = BitwiseAnd (p2_f6_c2, H2_6)
   p2_f6_e2 = BitwiseOr (p2_f6_b2, p2_f6_d2)
   p2_f6_y2 = BitwiseOr (p2_f6_y1, p2_f6_e2)
   p2_f7_up = BitwiseAnd (p2_f6_y2, V_6)
   p2_f7_seed = BitwiseOr (p1_b7_y2, p2_f7_up)
   p2_f7_a1 = BitwiseAnd (p2_f7_seed, H_7)
   p2_f7_b1 = Mul (p2_f7_a1, u16_2)
   p2_f7_c1 = Div (p2_f7_seed, u16_2)
   p2_f7_d1 = BitwiseAnd (p2_f7_c1, H_7)
   p2_f7_e1 = BitwiseOr (p2_f7_b1, p2_f7_d1)
   p2_f7_y1 = BitwiseOr (p2_f7_seed, p2_f7_e1)
   p2_f7_a2 = BitwiseAnd (p2_f7_y1, H2_7)
   p2_f7_b2 = Mul (p2_f7_a2, u16_4)
   p2_f7_c2 = Div (p2_f7_y1, u16_4)
   p2_f7_d2 = BitwiseAnd (p2_f7_c2, H2_7)
   p2_f7_e2 = BitwiseOr (p2_f7_b2, p2_f7_d2)
   p2_f7_y2 = BitwiseOr (p2_f7_y1, p2_f7_e2)
   p2_f8_up = BitwiseAnd (p2_f7_y2, V_7)
   p2_f8_seed = BitwiseOr (p1_b8_y2, p2_f8_up)
   p2_f8_a2 = BitwiseAnd (p2_f8_seed, H2_8)
   p2_f8_b2 = Mul (p2_f8_a2, u16_4)
   p2_f8_c2 = Div (p2_f8_seed, u16_4)
   p2_f8_d2 = BitwiseAnd (p2_f8_c2, H2_8)
   p2_f8_e2 = BitwiseOr (p2_f8_b2, p2_f8_d2)
   p2_f8_y2 = BitwiseOr (p2_f8_seed, p2_f8_e2)
   p2_f9_up = BitwiseAnd (p2_f8_y2, V_8)
   p2_f9_seed = BitwiseOr (p1_b9_y2, p2_f9_up)
   p2_f9_a1 = BitwiseAnd (p2_f9_seed, H_9)
   p2_f9_b1 = Mul (p2_f9_a1, u16_2)
   p2_f9_c1 = Div (p2_f9_seed, u16_2)
   p2_f9_d1 = BitwiseAnd (p2_f9_c1, H_9)
   p2_f9_e1 = BitwiseOr (p2_f9_b1, p2_f9_d1)
   p2_f9_y1 = BitwiseOr (p2_f9_seed, p2_f9_e1)
   p2_f9_a2 = BitwiseAnd (p2_f9_y1, H2_9)
   p2_f9_b2 = Mul (p2_f9_a2, u16_4)
   p2_f9_c2 = Div (p2_f9_y1, u16_4)
   p2_f9_d2 = BitwiseAnd (p2_f9_c2, H2_9)
   p2_f9_e2 = BitwiseOr (p2_f9_b2, p2_f9_d2)
   p2_f9_y2 = BitwiseOr (p2_f9_y1, p2_f9_e2)
   p2_f10_up = BitwiseAnd (p2_f9_y2, V_9)
   p2_f10_seed = BitwiseOr (p1_b10_y1, p2_f10_up)
   p2_f10_a1 = BitwiseAnd (p2_f10_seed, H_10)
   p2_f10_b1 = Mul (p2_f10_a1, u16_2)
   p2_f10_c1 = Div (p2_f10_seed, u16_2)
   p2_f10_d1 = BitwiseAnd (p2_f10_c1, H_10)
   p2_f10_e1 = BitwiseOr (p2_f10_b1, p2_f10_d1)
   p2_f10_y1 = BitwiseOr (p2_f10_seed, p2_f10_e1)
   p2_f10_a2 = BitwiseAnd (p2_f10_y1, H2_10)
   p2_f10_b2 = Mul (p2_f10_a2, u16_4)
   p2_f10_c2 = Div (p2_f10_y1, u16_4)
   p2_f10_d2 = BitwiseAnd (p2_f10_c2, H2_10)
   p2_f10_e2 = BitwiseOr (p2_f10_b2, p2_f10_d2)
   p2_f10_y2 = BitwiseOr (p2_f10_y1, p2_f10_e2)
   p2_f11_up = BitwiseAnd (p2_f10_y2, V_10)
   p2_f11_seed = BitwiseOr (p1_b11_y1, p2_f11_up)
   p2_f11_a1 = BitwiseAnd (p2_f11_seed, H_11)
   p2_f11_b1 = Mul (p2_f11_a1, u16_2)
   p2_f11_c1 = Div (p2_f11_seed, u16_2)
   p2_f11_d1 = BitwiseAnd (p2_f11_c1, H_11)
   p2_f11_e1 = BitwiseOr (p2_f11_b1, p2_f11_d1)
   p2_f11_y1 = BitwiseOr (p2_f11_seed, p2_f11_e1)
   p2_f11_a2 = BitwiseAnd (p2_f11_y1, H2_11)
   p2_f11_b2 = Mul (p2_f11_a2, u16_4)
   p2_f11_c2 = Div (p2_f11_y1, u16_4)
   p2_f11_d2 = BitwiseAnd (p2_f11_c2, H2_11)
   p2_f11_e2 = BitwiseOr (p2_f11_b2, p2_f11_d2)
   p2_f11_y2 = BitwiseOr (p2_f11_y1, p2_f11_e2)
   p2_f12_up = BitwiseAnd (p2_f11_y2, V_11)
   p2_f12_a1 = BitwiseAnd (p2_f12_up, H_12)
   p2_f12_b1 = Mul (p2_f12_a1, u16_2)
   p2_f12_c1 = Div (p2_f12_up, u16_2)
   p2_f12_d1 = BitwiseAnd (p2_f12_c1, H_12)
   p2_f12_e1 = BitwiseOr (p2_f12_b1, p2_f12_d1)
   p2_f12_y1 = BitwiseOr (p2_f12_up, p2_f12_e1)
   p2_f12_a2 = BitwiseAnd (p2_f12_y1, H2_12)
   p2_f12_b2 = Mul (p2_f12_a2, u16_4)
   p2_f12_c2 = Div (p2_f12_y1, u16_4)
   p2_f12_d2 = BitwiseAnd (p2_f12_c2, H2_12)
   p2_f12_e2 = BitwiseOr (p2_f12_b2, p2_f12_d2)
   p2_f12_y2 = BitwiseOr (p2_f12_y1, p2_f12_e2)
   p2_b11_dn = BitwiseAnd (p2_f12_y2, V_11)
   p2_b11_seed = BitwiseOr (p2_f11_y2, p2_b11_dn)
   p2_b11_a2 = BitwiseAnd (p2_b11_seed, H2_11)
   p2_b11_b2 = Mul (p2_b11_a2, u16_4)
   p2_b11_c2 = Div (p2_b11_seed, u16_4)
   p2_b11_d2 = BitwiseAnd (p2_b11_c2, H2_11)
   p2_b11_e2 = BitwiseOr (p2_b11_b2, p2_b11_d2)
   p2_b11_y2 = BitwiseOr (p2_b11_seed, p2_b11_e2)
   p2_b10_dn = BitwiseAnd (p2_b11_y2, V_10)
   p2_b10_seed = BitwiseOr (p2_f10_y2, p2_b10_dn)
   p2_b10_a1 = BitwiseAnd (p2_b10_seed, H_10)
   p2_b10_b1 = Mul (p2_b10_a1, u16_2)
   p2_b10_c1 = Div (p2_b10_seed, u16_2)
   p2_b10_d1 = BitwiseAnd (p2_b10_c1, H_10)
   p2_b10_e1 = BitwiseOr (p2_b10_b1, p2_b10_d1)
   p2_b10_y1 = BitwiseOr (p2_b10_seed, p2_b10_e1)
   p2_b9_dn = BitwiseAnd (p2_b10_y1, V_9)
   p2_b9_seed = BitwiseOr (p2_f9_y2, p2_b9_dn)
   p2_b9_a1 = BitwiseAnd (p2_b9_seed, H_9)
   p2_b9_b1 = Mul (p2_b9_a1, u16_2)
   p2_b9_c1 = Div (p2_b9_seed, u16_2)
   p2_b9_d1 = BitwiseAnd (p2_b9_c1, H_9)
   p2_b9_e1 = BitwiseOr (p2_b9_b1, p2_b9_d1)
   p2_b9_y1 = BitwiseOr (p2_b9_seed, p2_b9_e1)
   p2_b9_a2 = BitwiseAnd (p2_b9_y1, H2_9)
   p2_b9_b2 = Mul (p2_b9_a2, u16_4)
   p2_b9_c2 = Div (p2_b9_y1, u16_4)
   p2_b9_d2 = BitwiseAnd (p2_b9_c2, H2_9)
   p2_b9_e2 = BitwiseOr (p2_b9_b2, p2_b9_d2)
   p2_b9_y2 = BitwiseOr (p2_b9_y1, p2_b9_e2)
   p2_b8_dn = BitwiseAnd (p2_b9_y2, V_8)
   p2_b8_seed = BitwiseOr (p2_f8_y2, p2_b8_dn)
   p2_b8_a1 = BitwiseAnd (p2_b8_seed, H_8)
   p2_b8_b1 = Mul (p2_b8_a1, u16_2)
   p2_b8_c1 = Div (p2_b8_seed, u16_2)
   p2_b8_d1 = BitwiseAnd (p2_b8_c1, H_8)
   p2_b8_e1 = BitwiseOr (p2_b8_b1, p2_b8_d1)
   p2_b8_y1 = BitwiseOr (p2_b8_seed, p2_b8_e1)
   p2_b8_a2 = BitwiseAnd (p2_b8_y1, H2_8)
   p2_b8_b2 = Mul (p2_b8_a2, u16_4)
   p2_b8_c2 = Div (p2_b8_y1, u16_4)
   p2_b8_d2 = BitwiseAnd (p2_b8_c2, H2_8)
   p2_b8_e2 = BitwiseOr (p2_b8_b2, p2_b8_d2)
   p2_b8_y2 = BitwiseOr (p2_b8_y1, p2_b8_e2)
   p2_b7_dn = BitwiseAnd (p2_b8_y2, V_7)
   p2_b7_seed = BitwiseOr (p2_f7_y2, p2_b7_dn)
   p2_b7_a1 = BitwiseAnd (p2_b7_seed, H_7)
   p2_b7_b1 = Mul (p2_b7_a1, u16_2)
   p2_b7_c1 = Div (p2_b7_seed, u16_2)
   p2_b7_d1 = BitwiseAnd (p2_b7_c1, H_7)
   p2_b7_e1 = BitwiseOr (p2_b7_b1, p2_b7_d1)
   p2_b7_y1 = BitwiseOr (p2_b7_seed, p2_b7_e1)
   p2_b7_a2 = BitwiseAnd (p2_b7_y1, H2_7)
   p2_b7_b2 = Mul (p2_b7_a2, u16_4)
   p2_b7_c2 = Div (p2_b7_y1, u16_4)
   p2_b7_d2 = BitwiseAnd (p2_b7_c2, H2_7)
   p2_b7_e2 = BitwiseOr (p2_b7_b2, p2_b7_d2)
   p2_b7_y2 = BitwiseOr (p2_b7_y1, p2_b7_e2)
   p2_b6_dn = BitwiseAnd (p2_b7_y2, V_6)
   p2_b6_seed = BitwiseOr (p2_f6_y2, p2_b6_dn)
   p2_b6_a1 = BitwiseAnd (p2_b6_seed, H_6)
   p2_b6_b1 = Mul (p2_b6_a1, u16_2)
   p2_b6_c1 = Div (p2_b6_seed, u16_2)
   p2_b6_d1 = BitwiseAnd (p2_b6_c1, H_6)
   p2_b6_e1 = BitwiseOr (p2_b6_b1, p2_b6_d1)
   p2_b6_y1 = BitwiseOr (p2_b6_seed, p2_b6_e1)
   p2_b6_a2 = BitwiseAnd (p2_b6_y1, H2_6)
   p2_b6_b2 = Mul (p2_b6_a2, u16_4)
   p2_b6_c2 = Div (p2_b6_y1, u16_4)
   p2_b6_d2 = BitwiseAnd (p2_b6_c2, H2_6)
   p2_b6_e2 = BitwiseOr (p2_b6_b2, p2_b6_d2)
   p2_b6_y2 = BitwiseOr (p2_b6_y1, p2_b6_e2)
   p2_b5_dn = BitwiseAnd (p2_b6_y2, V_5)
   p2_b5_seed = BitwiseOr (p2_f5_y2, p2_b5_dn)
   p2_b5_a1 = BitwiseAnd (p2_b5_seed, H_5)
   p2_b5_b1 = Mul (p2_b5_a1, u16_2)
   p2_b5_c1 = Div (p2_b5_seed, u16_2)
   p2_b5_d1 = BitwiseAnd (p2_b5_c1, H_5)
   p2_b5_e1 = BitwiseOr (p2_b5_b1, p2_b5_d1)
   p2_b5_y1 = BitwiseOr (p2_b5_seed, p2_b5_e1)
   p2_b5_a2 = BitwiseAnd (p2_b5_y1, H2_5)
   p2_b5_b2 = Mul (p2_b5_a2, u16_4)
   p2_b5_c2 = Div (p2_b5_y1, u16_4)
   p2_b5_d2 = BitwiseAnd (p2_b5_c2, H2_5)
   p2_b5_e2 = BitwiseOr (p2_b5_b2, p2_b5_d2)
   p2_b5_y2 = BitwiseOr (p2_b5_y1, p2_b5_e2)
   p2_b4_dn = BitwiseAnd (p2_b5_y2, V_4)
   p2_b4_seed = BitwiseOr (p2_f4_y2, p2_b4_dn)
   p2_b4_a1 = BitwiseAnd (p2_b4_seed, H_4)
   p2_b4_b1 = Mul (p2_b4_a1, u16_2)
   p2_b4_c1 = Div (p2_b4_seed, u16_2)
   p2_b4_d1 = BitwiseAnd (p2_b4_c1, H_4)
   p2_b4_e1 = BitwiseOr (p2_b4_b1, p2_b4_d1)
   p2_b4_y1 = BitwiseOr (p2_b4_seed, p2_b4_e1)
   p2_b4_a2 = BitwiseAnd (p2_b4_y1, H2_4)
   p2_b4_b2 = Mul (p2_b4_a2, u16_4)
   p2_b4_c2 = Div (p2_b4_y1, u16_4)
   p2_b4_d2 = BitwiseAnd (p2_b4_c2, H2_4)
   p2_b4_e2 = BitwiseOr (p2_b4_b2, p2_b4_d2)
   p2_b4_y2 = BitwiseOr (p2_b4_y1, p2_b4_e2)
   p2_b3_dn = BitwiseAnd (p2_b4_y2, V_3)
   p2_b3_seed = BitwiseOr (p2_f3_y2, p2_b3_dn)
   p2_b3_a1 = BitwiseAnd (p2_b3_seed, H_3)
   p2_b3_b1 = Mul (p2_b3_a1, u16_2)
   p2_b3_c1 = Div (p2_b3_seed, u16_2)
   p2_b3_d1 = BitwiseAnd (p2_b3_c1, H_3)
   p2_b3_e1 = BitwiseOr (p2_b3_b1, p2_b3_d1)
   p2_b3_y1 = BitwiseOr (p2_b3_seed, p2_b3_e1)
   p2_b3_a2 = BitwiseAnd (p2_b3_y1, H2_3)
   p2_b3_b2 = Mul (p2_b3_a2, u16_4)
   p2_b3_c2 = Div (p2_b3_y1, u16_4)
   p2_b3_d2 = BitwiseAnd (p2_b3_c2, H2_3)
   p2_b3_e2 = BitwiseOr (p2_b3_b2, p2_b3_d2)
   p2_b3_y2 = BitwiseOr (p2_b3_y1, p2_b3_e2)
   p2_b2_dn = BitwiseAnd (p2_b3_y2, V_2)
   p2_b2_seed = BitwiseOr (p2_f2_y2, p2_b2_dn)
   p2_b2_a1 = BitwiseAnd (p2_b2_seed, H_2)
   p2_b2_b1 = Mul (p2_b2_a1, u16_2)
   p2_b2_c1 = Div (p2_b2_seed, u16_2)
   p2_b2_d1 = BitwiseAnd (p2_b2_c1, H_2)
   p2_b2_e1 = BitwiseOr (p2_b2_b1, p2_b2_d1)
   p2_b2_y1 = BitwiseOr (p2_b2_seed, p2_b2_e1)
   p2_b2_a2 = BitwiseAnd (p2_b2_y1, H2_2)
   p2_b2_b2 = Mul (p2_b2_a2, u16_4)
   p2_b2_c2 = Div (p2_b2_y1, u16_4)
   p2_b2_d2 = BitwiseAnd (p2_b2_c2, H2_2)
   p2_b2_e2 = BitwiseOr (p2_b2_b2, p2_b2_d2)
   p2_b2_y2 = BitwiseOr (p2_b2_y1, p2_b2_e2)
   p2_b1_dn = BitwiseAnd (p2_b2_y2, V_1)
   p2_b1_seed = BitwiseOr (p2_f1_y2, p2_b1_dn)
   p2_b1_a1 = BitwiseAnd (p2_b1_seed, H_1)
   p2_b1_b1 = Mul (p2_b1_a1, u16_2)
   p2_b1_c1 = Div (p2_b1_seed, u16_2)
   p2_b1_d1 = BitwiseAnd (p2_b1_c1, H_1)
   p2_b1_e1 = BitwiseOr (p2_b1_b1, p2_b1_d1)
   p2_b1_y1 = BitwiseOr (p2_b1_seed, p2_b1_e1)
   p2_b1_a2 = BitwiseAnd (p2_b1_y1, H2_1)
   p2_b1_b2 = Mul (p2_b1_a2, u16_4)
   p2_b1_c2 = Div (p2_b1_y1, u16_4)
   p2_b1_d2 = BitwiseAnd (p2_b1_c2, H2_1)
   p2_b1_e2 = BitwiseOr (p2_b1_b2, p2_b1_d2)
   p2_b1_y2 = BitwiseOr (p2_b1_y1, p2_b1_e2)
   p2_b0_dn = BitwiseAnd (p2_b1_y2, V_0)
   p2_b0_seed = BitwiseOr (p1_b0_y2, p2_b0_dn)
   p2_b0_a1 = BitwiseAnd (p2_b0_seed, H_0)
   p2_b0_b1 = Mul (p2_b0_a1, u16_2)
   p2_b0_c1 = Div (p2_b0_seed, u16_2)
   p2_b0_d1 = BitwiseAnd (p2_b0_c1, H_0)
   p2_b0_e1 = BitwiseOr (p2_b0_b1, p2_b0_d1)
   p2_b0_y1 = BitwiseOr (p2_b0_seed, p2_b0_e1)
   p2_b0_a2 = BitwiseAnd (p2_b0_y1, H2_0)
   p2_b0_b2 = Mul (p2_b0_a2, u16_4)
   p2_b0_c2 = Div (p2_b0_y1, u16_4)
   p2_b0_d2 = BitwiseAnd (p2_b0_c2, H2_0)
   p2_b0_e2 = BitwiseOr (p2_b0_b2, p2_b0_d2)
   p2_b0_y2 = BitwiseOr (p2_b0_y1, p2_b0_e2)
   xdown_f1_up = BitwiseAnd (p2_b0_y2, V_0)
   xdown_f1_seed = BitwiseOr (p2_b1_y2, xdown_f1_up)
   xdown_f1_a1 = BitwiseAnd (xdown_f1_seed, H_1)
   xdown_f1_b1 = Mul (xdown_f1_a1, u16_2)
   xdown_f1_c1 = Div (xdown_f1_seed, u16_2)
   xdown_f1_d1 = BitwiseAnd (xdown_f1_c1, H_1)
   xdown_f1_e1 = BitwiseOr (xdown_f1_b1, xdown_f1_d1)
   xdown_f1_y1 = BitwiseOr (xdown_f1_seed, xdown_f1_e1)
   xdown_f2_up = BitwiseAnd (xdown_f1_y1, V_1)
   xdown_f2_seed = BitwiseOr (p2_b2_y2, xdown_f2_up)
   xdown_f2_c1 = Div (xdown_f2_seed, u16_2)
   xdown_f2_d1 = BitwiseAnd (xdown_f2_c1, H_2)
   xdown_f2_y1 = BitwiseOr (xdown_f2_seed, xdown_f2_d1)
   xdown_f2_a2 = BitwiseAnd (xdown_f2_y1, H2_2)
   xdown_f2_b2 = Mul (xdown_f2_a2, u16_4)
   xdown_f2_c2 = Div (xdown_f2_y1, u16_4)
   xdown_f2_d2 = BitwiseAnd (xdown_f2_c2, H2_2)
   xdown_f2_e2 = BitwiseOr (xdown_f2_b2, xdown_f2_d2)
   xdown_f2_y2 = BitwiseOr (xdown_f2_y1, xdown_f2_e2)
   xdown_f3_up = BitwiseAnd (xdown_f2_y2, V_2)
   xdown_f3_seed = BitwiseOr (p2_b3_y2, xdown_f3_up)
   xdown_f3_c1 = Div (xdown_f3_seed, u16_2)
   xdown_f3_d1 = BitwiseAnd (xdown_f3_c1, H_3)
   xdown_f3_y1 = BitwiseOr (xdown_f3_seed, xdown_f3_d1)
   xdown_f4_up = BitwiseAnd (xdown_f3_y1, V_3)
   xdown_f4_seed = BitwiseOr (p2_b4_y2, xdown_f4_up)
   xdown_f4_c1 = Div (xdown_f4_seed, u16_2)
   xdown_f4_d1 = BitwiseAnd (xdown_f4_c1, H_4)
   xdown_f4_y1 = BitwiseOr (xdown_f4_seed, xdown_f4_d1)
   xdown_f5_up = BitwiseAnd (xdown_f4_y1, V_4)
   xdown_f5_seed = BitwiseOr (p2_b5_y2, xdown_f5_up)
   xdown_f6_up = BitwiseAnd (xdown_f5_seed, V_5)
   xdown_f6_seed = BitwiseOr (p2_b6_y2, xdown_f6_up)
   xdown_f7_up = BitwiseAnd (xdown_f6_seed, V_6)
   xdown_f7_seed = BitwiseOr (p2_b7_y2, xdown_f7_up)
   xdown_f7_a1 = BitwiseAnd (xdown_f7_seed, H_7)
   xdown_f7_b1 = Mul (xdown_f7_a1, u16_2)
   xdown_f7_c1 = Div (xdown_f7_seed, u16_2)
   xdown_f7_d1 = BitwiseAnd (xdown_f7_c1, H_7)
   xdown_f7_e1 = BitwiseOr (xdown_f7_b1, xdown_f7_d1)
   xdown_f7_y1 = BitwiseOr (xdown_f7_seed, xdown_f7_e1)
   xdown_f8_up = BitwiseAnd (xdown_f7_y1, V_7)
   xdown_f8_seed = BitwiseOr (p2_b8_y2, xdown_f8_up)
   xdown_f8_a1 = BitwiseAnd (xdown_f8_seed, H_8)
   xdown_f8_b1 = Mul (xdown_f8_a1, u16_2)
   xdown_f8_y1 = BitwiseOr (xdown_f8_seed, xdown_f8_b1)
   xdown_f9_up = BitwiseAnd (xdown_f8_y1, V_8)
   xdown_f9_seed = BitwiseOr (p2_b9_y2, xdown_f9_up)
   xdown_f9_a1 = BitwiseAnd (xdown_f9_seed, H_9)
   xdown_f9_b1 = Mul (xdown_f9_a1, u16_2)
   xdown_f9_c1 = Div (xdown_f9_seed, u16_2)
   xdown_f9_d1 = BitwiseAnd (xdown_f9_c1, H_9)
   xdown_f9_e1 = BitwiseOr (xdown_f9_b1, xdown_f9_d1)
   xdown_f9_y1 = BitwiseOr (xdown_f9_seed, xdown_f9_e1)
   xdown_f10_up = BitwiseAnd (xdown_f9_y1, V_9)
   xdown_f10_seed = BitwiseOr (p2_b10_y1, xdown_f10_up)
   xdown_f10_a1 = BitwiseAnd (xdown_f10_seed, H_10)
   xdown_f10_b1 = Mul (xdown_f10_a1, u16_2)
   xdown_f10_c1 = Div (xdown_f10_seed, u16_2)
   xdown_f10_d1 = BitwiseAnd (xdown_f10_c1, H_10)
   xdown_f10_e1 = BitwiseOr (xdown_f10_b1, xdown_f10_d1)
   xdown_f10_y1 = BitwiseOr (xdown_f10_seed, xdown_f10_e1)
   Rvec = Concat <axis: int = 1> (p2_b0_y2, xdown_f1_y1, xdown_f2_y2, xdown_f3_y1, xdown_f4_y1, xdown_f5_seed, xdown_f6_seed, xdown_f7_y1, xdown_f8_y1, xdown_f9_y1, xdown_f10_y1, p2_b11_y2, p2_f12_y2)
   [hact] hact = BitwiseAnd (H, Rvec)
   [vact] vact = BitwiseAnd (V, Rvec)
   [R32] R32 = Cast <to: int = 12> (Rvec)
   [H32] H32 = Cast <to: int = 12> (hact)
   [V32] V32 = Cast <to: int = 12> (vact)
   [sf] sf = Gather <axis: int = 0> (sf_lut, cmod)
   [hf] hf = Gather <axis: int = 0> (hf_lut, cmod)
   [Sphys] Sphys = Mul (R32, sf)
   [Hphys] Hphys = Mul (H32, hf)
   [Vphys] Vphys = Mul (V32, sf)
   [nodephys] nodephys = BitwiseOr (Sphys, Hphys)
   [rowsN] rowsN = ScatterElements <axis: int = 1> (zero_rows, node_rows, nodephys)
   [comp_base] comp_base = ScatterElements <axis: int = 1> (rowsN, vert_rows, Vphys)
   ex_1_0_eq = Equal (V_0, ex_rcorr_1_0_val)
   ex_1_cond = Reshape (ex_1_0_eq, ex_shape1)
   ex_2_0_eq = Equal (V_4, ex_rcorr_2_0_val)
   ex_2_cond = Reshape (ex_2_0_eq, ex_shape1)
   ex_3_0_eq = Equal (S_0, ex_rcorr_3_0_val)
   ex_3_1_eq = Equal (V_0, ex_rcorr_3_1_val)
   ex_3_and = And (ex_3_0_eq, ex_3_1_eq)
   ex_3_cond = Reshape (ex_3_and, ex_shape1)
   ex_5_0_eq = Equal (H_0, ex_rcorr_5_0_val)
   ex_5_cond = Reshape (ex_5_0_eq, ex_shape1)
   ex_match = Concat <axis: int = 0> (ex_false, ex_1_cond, ex_2_cond, ex_3_cond, ex_5_cond)
   ex_match_u8 = Cast <to: int = 2> (ex_match)
   ex_idx = ArgMax <axis: int = 0, keepdims: int = 0, select_last_index: int = 0> (ex_match_u8)
   ex_update = Gather <axis: int = 0> (ex_add_table, ex_idx)
   comp = ScatterElements <axis: int = 1, reduction: string = "add"> (comp_base, ex_add_indices, ex_update)
   [evopen_f] evopen_f = Einsum <equation: string = "bcrs,c,sp,pq->brq"> (input, cat1_w, col_pair_w, sel0f)
   [odopenhi_f] odopenhi_f = Einsum <equation: string = "bcrs,c,sp,pq->brq"> (input, cat1_w, col_pair_w, sel_od)
   [ev32] ev32 = Cast <to: int = 12> (evopen_f)
   [odopenhi32] odopenhi32 = Cast <to: int = 12> (odopenhi_f)
   [openm] openm = BitwiseOr (ev32, odopenhi32)
   [evwall16_f] evwall16_f = Einsum <equation: string = "bcrs,c,sp,pq->brq"> (input, cat0_w, col_pair_w, sel0f)
   [odwallhi_f] odwallhi_f = Einsum <equation: string = "bcrs,c,sp,pq->brq"> (input, cat0_w, col_pair_w, sel_od)
   [evwall] evwall = Cast <to: int = 12> (evwall16_f)
   [odwallhi32] odwallhi32 = Cast <to: int = 12> (odwallhi_f)
   [wall] wall = BitwiseOr (evwall, odwallhi32)
   [black] black = BitwiseXor (openm, comp)
   [ce] ce = BitwiseAnd (comp, ce_mask)
   [co] co = BitwiseXor (comp, ce)
   [table] table = Concat <axis: int = 0> (zero_rows, ce, co, black, wall)
   [colorrows] colorrows = Gather <axis: int = 0> (table, color_idx_i)
   [output] output = BitwiseAnd (colorrows, colbits)
}
