<
   ir_version: 10,
   opset_import: ["" : 21]
>
task069_equal_final (float[1,10,30,30] input) => (bool[1,10,1,1] output) 
   <float16[11] colfrac = ..., int32[2] rev_ends =  {-2147483648,-2147483648}, int32[2] rev_steps =  {-1,-1}, float[1] ng_scale =  {0.48}, float16[9,1] presence = ..., int8 zp_i8 = ..., int8 yneg_i8 = ..., float small_scale =  {0.016276}, int64[1] one_i64 =  {1}, int8[1,10,1,1] codes_i8 = ..., int32[2] delta34 =  {3,4}, int32[2] axes23 =  {2,3}, int8 two_i8 = ..., int64 three_i64 =  {3}, int64 n30_2, int64 c10_dyn, int64[1] n31_2, int64[1] n29_2, int64[1] c11_dyn, int64[1] c9_dyn, float16[1,1,1,1] input_f16, float16[1] row_code, float16[1] row_log, float16[1] col_code, float16[1] col_log, float16[2] log_vec, float16[2] ratio_vec, int32[2] src_starts3, int32[2] src_ends3, int8[1,1,1,1] label_w_pad11, int8[1,1,1,1] label_w_i8, float[1,1,1,1] ng_pre, int8[1,1,1,1] ngq, int8[1,1,1,1] cyan_cp_01, int8[1,9,1,2] src_patch, int8[1,1,1,2] label_u8, int8[1,1,1,1] cyan_cp_02, int8[1,1,1,1] cyan_cp_03, int8[1,1,1,1] cyan_cp_04, int8[1,1,1,1] cyan_cp_05, int8[1,1,1,1] cyan_cp_06, int8[1,1,1,1] cyan_cp_07, int8[1,1,1,1] cyan_cp_08, int8[1,1,1,1] cyan_cp_09, int8[1,1,1,1] cyan_cp_10, int8[1,1,1,1] cyan_cp_11, int8[1,1,1,1] cyan_cp_12, int8[1,1,1,1] cyan_cp_13, int8[1,1,1,1] cyan_cp_14, int8[1,1,1,1] cyan_cp_15, int8[1,1,1,1] cyan_cp_16, int8[1,1,1,1] cyan_cp_17, int8[1,1,1,1] cyan_cp_18, int8[1,1,1,1] cyan_cp_19, int8[1,1,1,1] cyan_cp_20, int8[1,1,1,1] cyan_cp_21, int8[1,1,1,1] cyan_cp_22, int8[1,1,1,1] cyan_cp_23, int8[1,1,1,1] cyan_cp_24, int8[1,1,1,1] cyan_cp_25, int8[1,1,1,1] cyan_cp_26, int8[1,1,1,1] cyan_cp_27, int8[1,1,1,1] cyan_cp_28, int8[1,1,1,1] cyan_cp_29, int8[1,1,1,1] cyan_cp_30, int8[1,1,1,1] cyan_cp_31, int8[1,1,1,1] cyan_cp_32, int8[1,1,1,1] cyan_cp_33, int8[1,1,1,1] cyan_cp_34, int8[1,1,1,1] cyan_cp_35, int8[1,1,1,1] cyan_cp_36, int8[1,1,1,1] cyan_cp_37, int8[1,1,1,1] cyan_pad11, int8[1,1,2,1] anchors, int8[1,1,1,2] label_rev, int8[1,1,4,4] lab10, int8[1,1,1,1] sh0_b, int8[1,1,1,1] sh0_c, int8[1,1,1,1] sh1_a, int8[1,1,1,1] sh1_b, int8[1,1,1,1] sh1_c, int8[1,1,1,1] sh2_a, int8[1,1,1,1] sh2_b, int8[1,1,1,1] sh2_c, int8[1,1,1,1] sh3_a, int8[1,1,1,1] sh3_b, int8[1,1,1,1] sh3_c, int8[1,1,1,1] sh4_a, int8[1,1,1,1] sh4_b, int8[1,1,1,1] sh4_c, int8[1,1,1,1] sh5_a, int8[1,1,1,1] sh5_b, int8[1,1,1,1] sh5_c, int8[1,1,1,1] sh6_a, int8[1,1,1,1] sh6_b, int8[1,1,1,1] sh6_c, int8[1,1,1,1] sh7_a, int8[1,1,1,1] sh7_b, int8[1,1,1,1] sh7_c, int8[1,1,1,1] sh8_a, int8[1,1,1,1] sh8_b, int8[1,1,1,1] sh8_c, int8[1,1,1,1] sh9_a, int8[1,1,1,1] sh9_b, int8[1,1,1,1] sh9_c, int8[1,1,1,1] src_base>
{
   [c10_dyn] c10_dyn = Size (codes_i8)
   [n30_2] n30_2 = Mul (c10_dyn, three_i64)
   [n31_2] n31_2 = Add (n30_2, one_i64)
   [n29_2] n29_2 = Sub (n30_2, one_i64)
   [c11_dyn] c11_dyn = Add (c10_dyn, one_i64)
   [c9_dyn] c9_dyn = Sub (c10_dyn, one_i64)
   [ng_pre] ng_pre = CenterCropPad <axes: ints = [1]> (input, c11_dyn)
   [ngq] ngq = CastLike (ng_pre, zp_i8)
   [cyan_cp_01] cyan_cp_01 = CenterCropPad <axes: ints = [1]> (ngq, c9_dyn)
   [src_base] src_base = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_01, n30_2)
   [cyan_cp_11] cyan_cp_11 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_01, n29_2)
   [cyan_cp_12] cyan_cp_12 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_11, n31_2)
   [cyan_cp_13] cyan_cp_13 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_12, n30_2)
   [cyan_cp_14] cyan_cp_14 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_13, n29_2)
   [cyan_cp_15] cyan_cp_15 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_14, n31_2)
   [cyan_cp_16] cyan_cp_16 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_15, n30_2)
   [cyan_cp_17] cyan_cp_17 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_16, n29_2)
   [cyan_cp_18] cyan_cp_18 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_17, n31_2)
   [cyan_cp_19] cyan_cp_19 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_18, n30_2)
   [cyan_cp_20] cyan_cp_20 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_19, n29_2)
   [cyan_cp_21] cyan_cp_21 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_20, n31_2)
   [cyan_cp_22] cyan_cp_22 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_21, n30_2)
   [cyan_cp_23] cyan_cp_23 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_22, n29_2)
   [cyan_cp_24] cyan_cp_24 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_23, n31_2)
   [cyan_cp_25] cyan_cp_25 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_24, n30_2)
   [cyan_cp_26] cyan_cp_26 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_25, n29_2)
   [cyan_cp_27] cyan_cp_27 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_26, n31_2)
   [cyan_cp_28] cyan_cp_28 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_27, n30_2)
   [cyan_cp_29] cyan_cp_29 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_28, n29_2)
   [cyan_cp_30] cyan_cp_30 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_29, n31_2)
   [cyan_cp_31] cyan_cp_31 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_30, n30_2)
   [cyan_cp_32] cyan_cp_32 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_31, n29_2)
   [cyan_cp_33] cyan_cp_33 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_32, n31_2)
   [cyan_cp_34] cyan_cp_34 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_33, n30_2)
   [cyan_cp_35] cyan_cp_35 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_34, n29_2)
   [cyan_cp_36] cyan_cp_36 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_35, n31_2)
   [cyan_cp_37] cyan_cp_37 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_36, n30_2)
   [cyan_pad11] cyan_pad11 = CenterCropPad <axes: ints = [2, 3]> (cyan_cp_37, c11_dyn)
   input_f16 = CastLike (cyan_pad11, colfrac)
   [row_code] row_code = Einsum <equation: string = "bchw,cz,h->z"> (input_f16, presence, colfrac)
   [row_log] row_log = Log (row_code)
   [col_code] col_code = Einsum <equation: string = "bchw,cz,w->z"> (input_f16, presence, colfrac)
   [col_log] col_log = Log (col_code)
   [log_vec] log_vec = Concat <axis: int = 0> (row_log, col_log)
   [ratio_vec] ratio_vec = LeakyRelu <alpha: float = -0.637505> (log_vec)
   [src_starts3] src_starts3 = Cast <to: int = 6> (ratio_vec)
   [src_ends3] src_ends3 = Add (src_starts3, delta34)
   [label_w_pad11] label_w_pad11 = CenterCropPad <axes: ints = [1]> (codes_i8, c11_dyn)
   [label_w_i8] label_w_i8 = CenterCropPad <axes: ints = [1]> (label_w_pad11, c9_dyn)
   [src_patch] src_patch = Slice (src_base, src_starts3, src_ends3, axes23)
   [label_u8] label_u8 = QLinearConv (src_patch, ng_scale, zp_i8, label_w_i8, ng_scale, yneg_i8, ng_scale, zp_i8)
   [cyan_cp_02] cyan_cp_02 = CenterCropPad <axes: ints = [1]> (cyan_pad11, c10_dyn)
   [cyan_cp_03] cyan_cp_03 = CenterCropPad <axes: ints = [1]> (cyan_cp_02, c11_dyn)
   [cyan_cp_04] cyan_cp_04 = CenterCropPad <axes: ints = [1]> (cyan_cp_03, c9_dyn)
   [cyan_cp_05] cyan_cp_05 = CenterCropPad <axes: ints = [1]> (cyan_cp_04, c10_dyn)
   [cyan_cp_06] cyan_cp_06 = CenterCropPad <axes: ints = [1]> (cyan_cp_05, c11_dyn)
   [cyan_cp_07] cyan_cp_07 = CenterCropPad <axes: ints = [1]> (cyan_cp_06, c9_dyn)
   [cyan_cp_08] cyan_cp_08 = CenterCropPad <axes: ints = [1]> (cyan_cp_07, c10_dyn)
   [cyan_cp_09] cyan_cp_09 = CenterCropPad <axes: ints = [1]> (cyan_cp_08, c11_dyn)
   [cyan_cp_10] cyan_cp_10 = CenterCropPad <axes: ints = [1]> (cyan_cp_09, one_i64)
   [anchors] anchors = QLinearConv <pads: ints = [0, 0, 1, 1]> (cyan_cp_10, ng_scale, two_i8, label_u8, ng_scale, zp_i8, small_scale, zp_i8)
   [label_rev] label_rev = Slice (label_u8, axes23, rev_ends, axes23, rev_steps)
   [lab10] lab10 = QLinearConv <pads: ints = [2, 3, 0, 1]> (anchors, small_scale, yneg_i8, label_rev, ng_scale, zp_i8, ng_scale, yneg_i8)
   [sh0_b] sh0_b = CenterCropPad <axes: ints = [2, 3]> (lab10, n29_2)
   [sh0_c] sh0_c = CenterCropPad <axes: ints = [2, 3]> (sh0_b, n30_2)
   [sh1_a] sh1_a = CenterCropPad <axes: ints = [2, 3]> (sh0_c, n31_2)
   [sh1_b] sh1_b = CenterCropPad <axes: ints = [2, 3]> (sh1_a, n29_2)
   [sh1_c] sh1_c = CenterCropPad <axes: ints = [2, 3]> (sh1_b, n30_2)
   [sh2_a] sh2_a = CenterCropPad <axes: ints = [2, 3]> (sh1_c, n31_2)
   [sh2_b] sh2_b = CenterCropPad <axes: ints = [2, 3]> (sh2_a, n29_2)
   [sh2_c] sh2_c = CenterCropPad <axes: ints = [2, 3]> (sh2_b, n30_2)
   [sh3_a] sh3_a = CenterCropPad <axes: ints = [2, 3]> (sh2_c, n31_2)
   [sh3_b] sh3_b = CenterCropPad <axes: ints = [2, 3]> (sh3_a, n29_2)
   [sh3_c] sh3_c = CenterCropPad <axes: ints = [2, 3]> (sh3_b, n30_2)
   [sh4_a] sh4_a = CenterCropPad <axes: ints = [2, 3]> (sh3_c, n31_2)
   [sh4_b] sh4_b = CenterCropPad <axes: ints = [2, 3]> (sh4_a, n29_2)
   [sh4_c] sh4_c = CenterCropPad <axes: ints = [2, 3]> (sh4_b, n30_2)
   [sh5_a] sh5_a = CenterCropPad <axes: ints = [2, 3]> (sh4_c, n31_2)
   [sh5_b] sh5_b = CenterCropPad <axes: ints = [2, 3]> (sh5_a, n29_2)
   [sh5_c] sh5_c = CenterCropPad <axes: ints = [2, 3]> (sh5_b, n30_2)
   [sh6_a] sh6_a = CenterCropPad <axes: ints = [2, 3]> (sh5_c, n31_2)
   [sh6_b] sh6_b = CenterCropPad <axes: ints = [2, 3]> (sh6_a, n29_2)
   [sh6_c] sh6_c = CenterCropPad <axes: ints = [2, 3]> (sh6_b, n30_2)
   [sh7_a] sh7_a = CenterCropPad <axes: ints = [2, 3]> (sh6_c, n31_2)
   [sh7_b] sh7_b = CenterCropPad <axes: ints = [2, 3]> (sh7_a, n29_2)
   [sh7_c] sh7_c = CenterCropPad <axes: ints = [2, 3]> (sh7_b, n30_2)
   [sh8_a] sh8_a = CenterCropPad <axes: ints = [2, 3]> (sh7_c, n31_2)
   [sh8_b] sh8_b = CenterCropPad <axes: ints = [2, 3]> (sh8_a, n29_2)
   [sh8_c] sh8_c = CenterCropPad <axes: ints = [2, 3]> (sh8_b, n30_2)
   [sh9_a] sh9_a = CenterCropPad <axes: ints = [2, 3]> (sh8_c, n31_2)
   [sh9_b] sh9_b = CenterCropPad <axes: ints = [2, 3]> (sh9_a, n29_2)
   [sh9_c] sh9_c = CenterCropPad <axes: ints = [2, 3]> (sh9_b, n30_2)
   [output] output = Equal (sh9_c, codes_i8)
}
