<
   ir_version: 10,
   opset_import: ["" : 18],
   producer_name: "task187_final_candidate",
   doc_string: "
Task187 variant: rectangle masks start at border, preserving black interiors.
E/Q refit for border-start masks; removes two +1 Add nodes."
>
task187_bitset_opt (float[1,10,30,30] input) => (float16[1,10,1,1] output) 
   <int64[4] shape_seed =  {1,10,30,30}, int64[1] k3 =  {3}, int32[5] p0 =  {0,0,0,1,1}, int32[5] p1 =  {1,2,3,2,3}, int32[10] chmask_i32 =  {0,1,1,1,1,1,1,1,1,1}, uint8[29] coordsU = ..., uint8[1,1] base_startU = ..., uint8[1,1] base_lenU = ..., uint8 oneU = ..., uint8 fiveU = ..., int32[30] featw =  {33554433,33554434,33554436,33554440,33554448,33554464,33554496,33554560,33554688,33554944,33555456,33556480,33558528,33562624,33570816,33587200,33619968,33685504,33816576,34078720,34603008,35651584,37748736,41943040,50331648,67108864,100663296,167772160,301989888,570425344}, int32[5,1] p0r =  {0,0,1,0,1}, int32[5,1] p1r =  {2,3,2,1,3}, float16[10,3] E = ..., float16[4,3] Q = ..., int64[1] dim30_i64 =  {30}, int64[1] seed_shape, int64[1] ish, float[1,1,1,1] ihid, float16[1,1,1,1] input16, int32[1] rscore, int32[1] cscore, int32[4] rtv, int64[4] rti64, int32[4] ctv, int64[4] cti64, uint8[4] rti, uint8[4] cti, uint8[5,1] ra, uint8[5,1] rb, uint8[5,1] rlo, uint8[5,1] rhi, uint8[5] ca, uint8[5] cb, uint8[5] clo, uint8[5] chi, int32[5] cpow_hi, int32[5] cpow_lo, int32[5] cinterval, int32[5,1] rpow_hi, int32[5,1] rpow_lo, int32[5,1] rinterval, int32[5,1] rowa, int32[5,1] rowb, int32[5] cola, int32[5] colb, bool[5,5] rect, int64[2] rsh, int32[1,1,1,1] input32, int32[5,5] rowboth_and, bool[5,5] hok, int32[5,5] colboth_and, bool[5,5] vok, int32[5,1] rowboth, int32[5] colboth, bool[25,1] rectB, bool[3,1] rhid, float16[3,1] rectF, float16[3,1] valid3, int64[3,1] rectI64, uint8[3,1] rectU, uint8[3,1] rpU, uint8[3,1] cpU, int32[3,1] rp, int32[3,1] cp, uint8[3,1] srloU, uint8[3,1] srhiU, uint8[3,1] scloU, uint8[3,1] schiU, uint8[3,1] rlen3, uint8[3,1] clen3, uint8[4,1] rstart4, uint8[4,1] rlen4, uint8[4,1] cstart4, uint8[4,1] clen4, int32[5,1] rloI, uint8[5,1] rhiI, int32[5] cloI, int32[5] chiIp1, int32[5,1] rhiIp1, uint8[4,29] rdiff, bool[4,29] R4b, float16[1,1] R4, uint8[4,29] cdiff, bool[4,29] C4b, float16[1,1] C4, uint8[3,1] valid3U, uint8[3,1] rlen3v, int64[2] mask_shape, bool[1,1] R4bh, bool[1,1] C4bh, int64[1] k4h>
{
   [seed_shape] seed_shape = Shape (shape_seed)
   [ish] ish = CenterCropPad (shape_seed, seed_shape)
   [ihid] ihid = CenterCropPad (input, ish)
   [input16] input16 = CastLike (ihid, E)
   [input32] input32 = CastLike (ihid, chmask_i32)
   [rscore] rscore = Einsum <equation: string = "bchw,c,w->h"> (input32, chmask_i32, featw)
   [cscore] cscore = Einsum <equation: string = "bchw,c,h->w"> (input32, chmask_i32, featw)
   [k4h] k4h = Identity (seed_shape)
   [rtv] rtv, rti64 = TopK <axis: int = 0> (rscore, k4h)
   [ctv] ctv, cti64 = TopK <axis: int = 0> (cscore, k4h)
   [rti] rti = Cast <to: int = 2> (rti64)
   [cti] cti = Cast <to: int = 2> (cti64)
   [ra] ra = Gather <axis: int = 0> (rti, p0r)
   [rb] rb = Gather <axis: int = 0> (rti, p1r)
   [rlo] rlo = Min (ra, rb)
   [rloI] rloI = Cast <to: int = 6> (rlo)
   [rhi] rhi = Max (ra, rb)
   [rhiI] rhiI = Add (rhi, oneU)
   [rhiIp1] rhiIp1 = Cast <to: int = 6> (rhiI)
   [ca] ca = Gather <axis: int = 0> (cti, p0)
   [cb] cb = Gather <axis: int = 0> (cti, p1)
   [clo] clo = Min (ca, cb)
   [cloI] cloI = Cast <to: int = 6> (clo)
   [chi] chi = Max (ca, cb)
   [chiIp1] chiIp1 = Cast <to: int = 6> (chi)
   [cpow_hi] cpow_hi = Gather <axis: int = 0> (featw, chiIp1)
   [cpow_lo] cpow_lo = Gather <axis: int = 0> (featw, cloI)
   [cinterval] cinterval = Sub (cpow_hi, cpow_lo)
   [rpow_hi] rpow_hi = Gather <axis: int = 0> (featw, rhiIp1)
   [rpow_lo] rpow_lo = Gather <axis: int = 0> (featw, rloI)
   [rinterval] rinterval = Sub (rpow_hi, rpow_lo)
   [rowa] rowa = Gather <axis: int = 0> (rtv, p0r)
   [rowb] rowb = Gather <axis: int = 0> (rtv, p1r)
   [rowboth] rowboth = BitwiseAnd (rowa, rowb)
   [rowboth_and] rowboth_and = BitwiseAnd (rowboth, cinterval)
   [hok] hok = Equal (rowboth_and, cinterval)
   [cola] cola = Gather <axis: int = 0> (ctv, p0)
   [colb] colb = Gather <axis: int = 0> (ctv, p1)
   [colboth] colboth = BitwiseAnd (cola, colb)
   [colboth_and] colboth_and = BitwiseAnd (colboth, rinterval)
   [vok] vok = Equal (colboth_and, rinterval)
   [rect] rect = And (hok, vok)
   [rectB] rectB = Flatten <axis: int = 2> (rect)
   [rsh] rsh = Shape (rectB)
   [rhid] rhid = CenterCropPad (rectB, rsh)
   [rectF] rectF = CastLike (rhid, E)
   [valid3] valid3, rectI64 = TopK <axis: int = 0> (rectF, k3)
   [valid3U] valid3U = CastLike (valid3, coordsU)
   [rectU] rectU = Cast <to: int = 2> (rectI64)
   [rpU] rpU = Div (rectU, fiveU)
   [rp] rp = Cast <to: int = 6> (rpU)
   [cpU] cpU = Mod (rectU, fiveU)
   [cp] cp = Cast <to: int = 6> (cpU)
   [srloU] srloU = GatherElements <axis: int = 0> (rlo, rp)
   [srhiU] srhiU = GatherElements <axis: int = 0> (rhi, rp)
   [scloU] scloU = Gather <axis: int = 0> (clo, cp)
   [schiU] schiU = Gather <axis: int = 0> (chi, cp)
   [rlen3] rlen3 = Sub (srhiU, srloU)
   [rlen3v] rlen3v = Mul (rlen3, valid3U)
   [clen3] clen3 = Sub (schiU, scloU)
   [rstart4] rstart4 = Concat <axis: int = 0> (base_startU, srloU)
   [rlen4] rlen4 = Concat <axis: int = 0> (base_lenU, rlen3v)
   [cstart4] cstart4 = Concat <axis: int = 0> (base_startU, scloU)
   [clen4] clen4 = Concat <axis: int = 0> (base_lenU, clen3)
   [rdiff] rdiff = Sub (coordsU, rstart4)
   [R4b] R4b = Less (rdiff, rlen4)
   [mask_shape] mask_shape = Concat <axis: int = 0> (k4h, dim30_i64)
   [R4bh] R4bh = CenterCropPad (R4b, mask_shape)
   [cdiff] cdiff = Sub (coordsU, cstart4)
   [C4b] C4b = Less (cdiff, clen4)
   [C4bh] C4bh = CenterCropPad (C4b, mask_shape)
   [R4] R4 = CastLike (R4bh, E)
   [C4] C4 = CastLike (C4bh, E)
   [output] output = Einsum <equation: string = "jh,jw,jk,ok,sk,bshw->bohw"> (R4, C4, Q, E, E, input16)
}
