<
   ir_version: 10,
   opset_import: ["" : 21]
>
task014_argmax_selector_f (float[1,10,30,30] input) => (float[1,1,1,1] output) 
   <int32[2] axes_slice_i32 =  {2,3}, float[10] fgmask_f =  {0,1,1,1,1,1,1,1,1,1}, float[1] bias10_f =  {0}, float[1] half_f =  {0.5}, uint8[1] one_u8 = ..., int64[2] axes_hw =  {2,3}, float16[30] coord_h = ..., int64[1] axis_ch_i64 =  {1}, float16[1] half_h = ..., float16[1] neg_half_h = ..., float16[1] zero_h = ..., float[1,1] selector_f, int64[1] k64, float[1,1,1,1] masked_f, uint8[1,1,1,1] masked_u8, float[1,1,1,1] fg_f, uint8[1,1,1,1] fg_u8, float16[1,1,1,1] fg_h, float16[1,1] counts, float16 total_count, float16 max_count, float16 rare_count, bool[1,1] selector_b, float16[1,1,1,1] mask_h, float16[1] row_sum, float16[1] col_sum, float16[1] row2_sum, float16[1] col2_sum, float16[1] row_mean, float16[1] col_mean, float16[1] row2_mean, float16[1] col2_mean, float16[1] row_mean2, float16[1] col_mean2, float16[1] row_var, float16[1] col_var, float16[1] row_std, float16[1] col_std, float16[1] rstart0, float16[1] cstart0, float16[1] rend0, float16[1] cend0, uint8[1] rmin, uint8[1] cmin, uint8[1] rmax, uint8[1] cmax, uint8[1] rend, uint8[1] cend, int32[2] starts, int32[2] ends, uint8[1,1,1,1] mask_crop_u8, float[1,1,1,1] mask_crop_f, float[1,1] p, float[1] kf, float[1,1] bias, float[1,1,1,1] labels_f, int32[1,1,1,1] indices, float[1,1,1,1] zero_f_full, uint8[2] starts_u8, uint8[2] ends_u8, float16[1] rstartceil, float16[1] cstartceil, float16[1,1,1,1] mask1_h, uint8[1,1,1,1] mask1_u8>
{
   [""] fg_f = GroupNormalization <epsilon: float = 0.25, num_groups: int = 1> (input, fgmask_f, bias10_f)
   [""] fg_u8 = CastLike (fg_f, one_u8)
   [""] fg_h = Cast <to: int = 10> (fg_u8)
   [""] counts = ReduceL1 <keepdims: int = 0> (fg_h, axes_hw)
   [""] total_count = ReduceL1 <keepdims: int = 0> (counts)
   [""] max_count = ReduceMax <keepdims: int = 0> (counts)
   [""] rare_count = Sub (total_count, max_count)
   [""] selector_b = Equal (counts, rare_count)
   [""] selector_f = CastLike (selector_b, bias10_f)
   [""] k64 = ArgMax <axis: int = 1, keepdims: int = 0, select_last_index: int = 0> (selector_f)
   [""] masked_f = GroupNormalization <epsilon: float = 0.25, num_groups: int = 1> (input, selector_f, bias10_f)
   [""] masked_u8 = CastLike (masked_f, one_u8)
   mask_h = CastLike (masked_u8, coord_h)
   mask1_h = ReduceL1 <keepdims: int = 1> (mask_h, axis_ch_i64)
   mask1_u8 = CastLike (mask1_h, one_u8)
   row_sum = Einsum <equation: string = "bchw,h->b"> (mask_h, coord_h)
   col_sum = Einsum <equation: string = "bchw,w->b"> (mask_h, coord_h)
   row2_sum = Einsum <equation: string = "bchw,h,h->b"> (mask_h, coord_h, coord_h)
   col2_sum = Einsum <equation: string = "bchw,w,w->b"> (mask_h, coord_h, coord_h)
   row_mean = Div (row_sum, rare_count)
   col_mean = Div (col_sum, rare_count)
   row2_mean = Div (row2_sum, rare_count)
   col2_mean = Div (col2_sum, rare_count)
   row_mean2 = Mul (row_mean, row_mean)
   col_mean2 = Mul (col_mean, col_mean)
   row_var = Sub (row2_mean, row_mean2)
   col_var = Sub (col2_mean, col_mean2)
   row_std = Sqrt (row_var)
   col_std = Sqrt (col_var)
   rstart0 = BatchNormalization <epsilon: float = 0.0807076> (row_std, neg_half_h, row_mean, zero_h, zero_h)
   rstartceil = Ceil (rstart0)
   cstart0 = BatchNormalization <epsilon: float = 0.0807076> (col_std, neg_half_h, col_mean, zero_h, zero_h)
   cstartceil = Ceil (cstart0)
   rend0 = BatchNormalization <epsilon: float = 0.0807076> (row_std, half_h, row_mean, zero_h, zero_h)
   cend0 = BatchNormalization <epsilon: float = 0.0807076> (col_std, half_h, col_mean, zero_h, zero_h)
   rmin = CastLike (rstartceil, one_u8)
   cmin = CastLike (cstartceil, one_u8)
   rmax = CastLike (rend0, one_u8)
   cmax = CastLike (cend0, one_u8)
   rend = Add (rmax, one_u8)
   cend = Add (cmax, one_u8)
   [""] starts_u8 = Concat <axis: int = 0> (rmin, cmin)
   [""] starts = CastLike (starts_u8, axes_slice_i32)
   [""] ends_u8 = Concat <axis: int = 0> (rend, cend)
   [""] ends = CastLike (ends_u8, axes_slice_i32)
   [""] mask_crop_u8 = Slice (mask1_u8, starts, ends, axes_slice_i32)
   [""] mask_crop_f = CastLike (mask_crop_u8, bias10_f)
   [""] p = ReduceMean <keepdims: int = 0> (mask_crop_f, axes_hw)
   [""] kf = CastLike (k64, bias10_f)
   [bias] bias = BatchNormalization <epsilon: float = 0.5> (p, kf, half_f, bias10_f, half_f)
   [""] labels_f = GroupNormalization <epsilon: float = 0.954772, num_groups: int = 1> (mask_crop_f, kf, bias)
   [""] indices = CastLike (labels_f, axes_slice_i32)
   [""] zero_f_full = GroupNormalization <epsilon: float = 1e-05, num_groups: int = 1> (input, bias10_f, bias10_f)
   [""] output = ScatterElements <axis: int = 1, reduction: string = "none"> (zero_f_full, indices, labels_f)
}
