<
   ir_version: 10,
   opset_import: ["" : 18]
>
task255_v4_castlike (float[1,10,30,30] input) => (float[1,10,30,30] output) 
   <float[30] acw =  {257,257,257,257,25601,25601,25601,25601,25601,25601,25601,25600,25600,25600,25600,25600,25600,25600,25600,25612,25612,25612,25612,25612,25612,25612,2572,2572,2572,2572}, float ac_thr =  {564224}, float qscale =  {1}, uint8 u0 = ..., int64[2] pad_prev_u1 =  {1,-1}, int64[2] pad_next_u1 =  {-1,1}, uint8[30] coord30 = ..., uint8[30] pat_top = ..., uint8[30] pat_bottom = ..., uint8 pat_all = ..., uint8 u2 = ..., uint8 u12 = ..., uint8 u11 = ..., uint8 u132 = ..., uint8 u143 = ..., uint8 u1 = ..., float[10,4] ColorE =  {0.5,-0.5,0.5,0.5,0,1.73205,0.133975,-1.86603,0.707107,2.43916,-0.866025,-2.28024,-0.5,0.5,-0.5,-0.5,1,2.73205,-1.86603,-1.86603,0.707107,2.43916,-2.28024,-0.866025,1.22465e-16,1.73205,-1.86603,0.133975,-0.707107,1.02494,-0.866025,0.548188,-1,0.732051,0.133975,0.133975,-0.707107,1.02494,0.548188,-0.866025}, float[4] ColorS =  {2,-2,2,2}, int8[7,3] Eembed = ..., int64[1] shape1, uint8[1] coord30_h, uint8[1] pat_top_h, uint8[1] code_a_h, uint8[1] code_b_h, float[1] hscore_h, float[1] vscore_h, uint8[1] cvu, uint8[1] chu, uint8[1] hscore_u8, uint8[1] vscore_u8, int32[1] code_a_i, int32[1] code_b_i, int8[1,3] emb_a_i8, int8[1,3] emb_b_i8, float[1,3] emb_a, float[1,3] emb_b, bool[1] cleft, bool[1] cright, uint8[1] cleft_u8>
{
   vscore = Einsum <equation: string = "bcrw,ct,r->w"> (input, ColorE, acw)
   shape1 = Shape <end: int = 1, start: int = 0> (coord30)
   vscore_h = CenterCropPad <axes: ints = [0]> (vscore, shape1)
   cv = GreaterOrEqual (vscore_h, ac_thr)
   cvu = CastLike (cv, u0)
   pat_top_h = CenterCropPad <axes: ints = [0]> (pat_top, shape1)
   ncv = QLinearMatMul (cvu, qscale, u0, pat_top_h, qscale, u0, qscale, u0)
   vscore_u8 = CastLike (vscore_h, u0)
   coord30_h = CenterCropPad <axes: ints = [0]> (coord30, shape1)
   sum_v = QLinearMatMul (cvu, qscale, u0, coord30_h, qscale, u0, qscale, u0)
   hscore = Einsum <equation: string = "bcrw,ct,w->r"> (input, ColorE, acw)
   hscore_h = CenterCropPad <axes: ints = [0]> (hscore, shape1)
   ch = GreaterOrEqual (hscore_h, ac_thr)
   chu = CastLike (ch, u0)
   sum_h = QLinearMatMul (chu, qscale, u0, coord30_h, qscale, u0, qscale, u0)
   nch = QLinearMatMul (chu, qscale, u0, pat_top_h, qscale, u0, qscale, u0)
   hscore_u8 = CastLike (hscore_h, u0)
   vertical = Greater (ncv, nch)
   sumsel = Where (vertical, sum_v, sum_h)
   nsel = Where (vertical, ncv, nch)
   cnt = Div (nsel, pat_all)
   avg = Div (sumsel, cnt)
   cm1 = Sub (cnt, u1)
   half = Div (cm1, u2)
   first_u8 = Sub (avg, half)
   first = Cast <to: int = 6> (first_u8)
   score_first_v_u8 = Gather <axis: int = 0> (vscore_u8, first)
   score_first_h_u8 = Gather <axis: int = 0> (hscore_u8, first)
   score_first_u8 = Where (vertical, score_first_v_u8, score_first_h_u8)
   span_capped = Min (cm1, u11)
   last_u8 = Add (first_u8, span_capped)
   last = Cast <to: int = 6> (last_u8)
   score_last_v_u8 = Gather <axis: int = 0> (vscore_u8, last)
   score_last_h_u8 = Gather <axis: int = 0> (hscore_u8, last)
   score_last_u8 = Where (vertical, score_last_v_u8, score_last_h_u8)
   score_both_u8 = BitwiseAnd (score_first_u8, score_last_u8)
   main_full = Equal (score_both_u8, u143)
   top_last = Less (score_first_u8, u132)
   partial_rows_u = Where (top_last, pat_top, pat_bottom)
   rmain_u = Where (main_full, pat_all, partial_rows_u)
   branch_score_u8 = Where (vertical, hscore_u8, vscore_u8)
   branch_mod12 = Mod <fmod: int = 0> (branch_score_u8, u12)
   branch_small_code = Div (branch_mod12, u11)
   branch_big = GreaterOrEqual (branch_score_u8, u132)
   branch_big_code = Where (branch_big, u2, u0)
   branch_solid_code = BitwiseOr (branch_small_code, branch_big_code)
   branch_prev_code = Pad (branch_solid_code, pad_prev_u1, u2)
   branch_mid_code = BitwiseAnd (branch_solid_code, branch_prev_code)
   branch_next_code = Pad (branch_solid_code, pad_next_u1, u143)
   branch_code = BitwiseAnd (branch_mid_code, branch_next_code)
   row_code = Add (rmain_u, branch_code)
   cleft = LessOrEqual (coord30_h, first_u8)
   cright = GreaterOrEqual (coord30_h, last_u8)
   cleft_u8 = CastLike (cleft, u0)
   col_code = Where (cright, u2, cleft_u8)
   code_a = Where (vertical, row_code, col_code)
   code_a_h = CenterCropPad <axes: ints = [0]> (code_a, shape1)
   code_a_i = CastLike (code_a_h, first)
   emb_a_i8 = Gather <axis: int = 0> (Eembed, code_a_i)
   emb_a = CastLike (emb_a_i8, input)
   code_b = Where (vertical, col_code, row_code)
   code_b_h = CenterCropPad <axes: ints = [0]> (code_b, shape1)
   code_b_i = CastLike (code_b_h, first)
   emb_b_i8 = Gather <axis: int = 0> (Eembed, code_b_i)
   emb_b = CastLike (emb_b_i8, input)
   output = Einsum <equation: string = "birw,ot,t,it,rk,wk->borw"> (input, ColorE, ColorS, ColorE, emb_a, emb_b)
}
