<
   ir_version: 8,
   opset_import: ["" : 13]
>
task012 (float[1,10,30,30] input) => (float[1,10,30,30] output) 
   <float[10,1,7,10] w =  {173,60,-168,-168,-153,-153,97,75,261,-25,-60,108,538,-833,642,94,145,-249,-128,-52,-113,577,-1081,1229,-1022,557,-24,-23,-100,54,-113,-947,1411,3117,1184,-785,-491,408,137,-52,-147,481,-1080,1397,-1183,820,-156,-211,-110,144,46,101,575,-853,428,-113,302,-110,-96,-160,145,-46,-235,-149,103,-238,128,-64,174,114,-1879,-2145,-897,1127,-2145,-2145,-1461,1079,0,-1600,-1879,4885,2582,-6921,3127,4048,-1145,1079,521,-1079,-1879,2570,4061,-358,4048,1291,-2539,-836,0,0,436,-4958,-1145,6194,-412,-3739,3212,1079,0,-1067,-1879,2570,4061,776,4048,1836,-1145,-836,-12,-230,-1879,4885,1448,-4958,1448,4048,-1691,-303,1067,0,-1879,-2430,-1467,2521,-2430,-2430,-79,1079,0,-2145,-1879,-2145,-897,1127,-2145,-2145,-1461,1079,0,-1600,-1879,4885,2582,-6921,3127,4048,-1145,1079,521,-1079,-1879,2570,4061,-358,4048,1291,-2539,-836,0,0,436,-4958,-1145,6194,-412,-3739,3212,1079,0,-1067,-1879,2570,4061,776,4048,1836,-1145,-836,-12,-230,-1879,4885,1448,-4958,1448,4048,-1691,-303,1067,0,-1879,-2430,-1467,2521,-2430,-2430,-79,1079,0,-2145,-1879,-2145,-897,1127,-2145,-2145,-1461,1079,0,-1600,-1879,4885,2582,-6921,3127,4048,-1145,1079,521,-1079,-1879,2570,4061,-358,4048,1291,-2539,-836,0,0,436,-4958,-1145,6194,-412,-3739,3212,1079,0,-1067,-1879,2570,4061,776,4048,1836,-1145,-836,-12,-230,-1879,4885,1448,-4958,1448,4048,-1691,-303,1067,0,-1879,-2430,-1467,2521,-2430,-2430,-79,1079,0,-2145,-1879,-2145,-897,1127,-2145,-2145,-1461,1079,0,-1600,-1879,4885,2582,-6921,3127,4048,-1145,1079,521,-1079,-1879,2570,4061,-358,4048,1291,-2539,-836,0,0,436,-4958,-1145,6194,-412,-3739,3212,1079,0,-1067,-1879,2570,4061,776,4048,1836,-1145,-836,-12,-230,-1879,4885,1448,-4958,1448,4048,-1691,-303,1067,0,-1879,-2430,-1467,2521,-2430,-2430,-79,1079,0,-2145,-1879,-2145,-897,1127,-2145,-2145,-1461,1079,0,-1600,-1879,4885,2582,-6921,3127,4048,-1145,1079,521,-1079,-1879,2570,4061,-358,4048,1291,-2539,-836,0,0,436,-4958,-1145,6194,-412,-3739,3212,1079,0,-1067,-1879,2570,4061,776,4048,1836,-1145,-836,-12,-230,-1879,4885,1448,-4958,1448,4048,-1691,-303,1067,0,-1879,-2430,-1467,2521,-2430,-2430,-79,1079,0,-2145,-1879,-2145,-897,1127,-2145,-2145,-1461,1079,0,-1600,-1879,4885,2582,-6921,3127,4048,-1145,1079,521,-1079,-1879,2570,4061,-358,4048,1291,-2539,-836,0,0,436,-4958,-1145,6194,-412,-3739,3212,1079,0,-1067,-1879,2570,4061,776,4048,1836,-1145,-836,-12,-230,-1879,4885,1448,-4958,1448,4048,-1691,-303,1067,0,-1879,-2430,-1467,2521,-2430,-2430,-79,1079,0,-2145,-1879,-2145,-897,1127,-2145,-2145,-1461,1079,0,-1600,-1879,4885,2582,-6921,3127,4048,-1145,1079,521,-1079,-1879,2570,4061,-358,4048,1291,-2539,-836,0,0,436,-4958,-1145,6194,-412,-3739,3212,1079,0,-1067,-1879,2570,4061,776,4048,1836,-1145,-836,-12,-230,-1879,4885,1448,-4958,1448,4048,-1691,-303,1067,0,-1879,-2430,-1467,2521,-2430,-2430,-79,1079,0,-2145,-1879,-2145,-897,1127,-2145,-2145,-1461,1079,0,-1600,-1879,4885,2582,-6921,3127,4048,-1145,1079,521,-1079,-1879,2570,4061,-358,4048,1291,-2539,-836,0,0,436,-4958,-1145,6194,-412,-3739,3212,1079,0,-1067,-1879,2570,4061,776,4048,1836,-1145,-836,-12,-230,-1879,4885,1448,-4958,1448,4048,-1691,-303,1067,0,-1879,-2430,-1467,2521,-2430,-2430,-79,1079,0,-2145,-1879,-2145,-897,1127,-2145,-2145,-1461,1079,0,-1600,-1879,4885,2582,-6921,3127,4048,-1145,1079,521,-1079,-1879,2570,4061,-358,4048,1291,-2539,-836,0,0,436,-4958,-1145,6194,-412,-3739,3212,1079,0,-1067,-1879,2570,4061,776,4048,1836,-1145,-836,-12,-230,-1879,4885,1448,-4958,1448,4048,-1691,-303,1067,0,-1879,-2430,-1467,2521,-2430,-2430,-79,1079,0,-2145}, float[10] b =  {-3357,-3848,-3848,-3848,-3848,-3848,-3848,-3848,-3848,-3848}>
{
   output = Conv <group: int = 10, kernel_shape: ints = [7, 10], pads: ints = [3, 3, 3, 6]> (input, w, b)
}
