<
   ir_version: 10,
   opset_import: ["" : 21]
>
task107_direct_factor (float[1,10,30,30] input) => (float16[1,10,1,1] output) 
   <float[1,10,1,1] color_w =  {0,1,2,3,4,5,6,7,8,9}, uint8[1,30] coord = ..., uint8 one_u8 = ..., int64[2] ea_starts =  {0,4}, int64[2] ea_ends =  {4,5}, int64[2] eb_starts =  {1,4}, int64[2] eb_ends =  {5,5}, int64[2] edge_axes =  {2,3}, int64[2] pad_tr_ax =  {0,1}, int64[1] axes0 =  {0}, int64[1] axes1 =  {1}, uint8 five_u8 = ..., int64[1,2,1,3] pos_idx =  {0,0,1,0,1,0}, float16[2,2,2] C1 = ..., float16[2,2,2] C2 = ..., float16[2,10] cfeat = ..., float16[5,2] Q0 = ..., float16[5,2] Q1 = ..., float16[5,2] Q2 = ..., float16[5,2] Q3 = ..., float16[2,2] Scoef = ..., float16[2,3] ABselA = ..., float16[2,3] ABselB = ..., bool true_bool = ..., float16[2,30] coordfeat = ..., float16[3,2,2,2,3] Tleft = ..., float16[3,2,2] Tright = ..., int64[1] sh30, float[1,1,5,5] g32, uint8[1,1,5,5] g, uint8[1,1,4,1] edge_a, uint8[1,1,4,1] edge_b, bool[1,1,4,1] edge_eq, bool[1,1] hid_edge_eq, float16[1,1] edge_same, float16 nsame, uint8 nsame_u8, uint8 factor_m1, uint8 factor, uint8[1,2,1] pos_g, bool[1,2,1] pos_zero, uint8[1,30] quot, float16[1,1,1] pR, float16[1,1,1] pC, uint8[1] fm1v, uint8[2] ffeat_u8, float16[2] ffeat, uint8[1,2,5,5] cg_u8, int64[1] sh_cg, uint8[1,1,1,1] hid_cg_u8, float16[1,1,1,1] cg, uint8[2,30] qfeat_u8, uint8[1,1] hid_qfeat_u8, float16[1,1] qfeat, bool[1,30] qmask_b, bool[1,1] hid_qmask_b, float16[1,1] qmask, float16[1,1] remfeat, bool[1,1,1] pR0_tmp, bool[1,1,1] pC0_tmp, bool[1,2,1] pR_u8, bool[1,2,1] pC_u8, bool[1,1,1] hid_pR_u8, bool[1,1,1] hid_pC_u8>
{
   [sh30] sh30 = Shape <end: int = 2, start: int = 1> (coord)
   [g32] g32 = Conv <kernel_shape: ints = [1, 1], pads: ints = [0, 0, -25, -25]> (input, color_w)
   [g] g = Cast <to: int = 2> (g32)
   [cg_u8] cg_u8 = Pad <mode: string = "constant"> (g, pad_tr_ax, one_u8, axes1)
   [sh_cg] sh_cg = Shape <end: int = 2, start: int = 1> (cg_u8)
   [edge_a] edge_a = Slice (g, ea_starts, ea_ends, edge_axes)
   [edge_b] edge_b = Slice (g, eb_starts, eb_ends, edge_axes)
   [edge_eq] edge_eq = Equal (edge_a, edge_b)
   [hid_edge_eq] hid_edge_eq = CenterCropPad <axes: ints = [2]> (edge_eq, sh30)
   [edge_same] edge_same = Cast <to: int = 10> (hid_edge_eq)
   [nsame] nsame = ReduceSum <keepdims: int = 0> (edge_same)
   [nsame_u8] nsame_u8 = Cast <to: int = 2> (nsame)
   [factor_m1] factor_m1 = Sub (five_u8, nsame_u8)
   [factor] factor = Add (factor_m1, one_u8)
   [pos_g] pos_g = GatherND <batch_dims: int = 1> (g, pos_idx)
   [pos_zero] pos_zero = Less (pos_g, one_u8)
   [p_split] pR0_tmp, pC0_tmp = Split <axis: int = 1, num_outputs: int = 2> (pos_zero)
   [quot] quot = Div (coord, factor)
   [pR_u8] pR_u8 = Pad <mode: string = "constant"> (pR0_tmp, pad_tr_ax, true_bool, axes1)
   [hid_pR_u8] hid_pR_u8 = CenterCropPad <axes: ints = [1]> (pR_u8, sh_cg)
   [pR] pR = Cast <to: int = 10> (hid_pR_u8)
   [pC_u8] pC_u8 = Pad <mode: string = "constant"> (pC0_tmp, pad_tr_ax, true_bool, axes1)
   [hid_pC_u8] hid_pC_u8 = CenterCropPad <axes: ints = [1]> (pC_u8, sh_cg)
   [pC] pC = Cast <to: int = 10> (hid_pC_u8)
   [fm1v] fm1v = Unsqueeze (factor_m1, axes0)
   [ffeat_u8] ffeat_u8 = Pad <mode: string = "constant"> (fm1v, pad_tr_ax, one_u8, axes0)
   [ffeat] ffeat = Cast <to: int = 10> (ffeat_u8)
   [hid_cg_u8] hid_cg_u8 = CenterCropPad <axes: ints = [1]> (cg_u8, sh_cg)
   [cg] cg = Cast <to: int = 10> (hid_cg_u8)
   [qfeat_u8] qfeat_u8 = Pad <mode: string = "constant"> (quot, pad_tr_ax, one_u8, axes0)
   [hid_qfeat_u8] hid_qfeat_u8 = CenterCropPad <axes: ints = [1]> (qfeat_u8, sh30)
   [qfeat] qfeat = Cast <to: int = 10> (hid_qfeat_u8)
   [qmask_b] qmask_b = Less (quot, five_u8)
   [hid_qmask_b] hid_qmask_b = CenterCropPad <axes: ints = [1]> (qmask_b, sh30)
   [qmask] qmask = Cast <to: int = 10> (hid_qmask_b)
   remfeat = CenterCropPad <axes: ints = [1]> (coordfeat, sh30)
   [output] output = Einsum <equation: string = "bahw,tae,ec,bdhw,tdf,fc,Ir,hI,Jr,hJ,Kr,hK,Mr,hM,Zr,Ps,wP,Qs,wQ,Ns,wN,Os,wO,Ys,tg,gq,qABCj,juv,XAX,Br,Cr,ur,v,gz,zDEFk,kxy,XDX,Es,Fs,xs,y,ti,iU,UGHLl,lmn,XGX,Hr,Lr,mr,n,iV,VRSTW,Wop,XRX,Ss,Ts,os,p->bcrs"> (cg, C1, cfeat, cg, C2, cfeat, qfeat, Q0, qfeat, Q1, qfeat, Q2, qfeat, Q3, qmask, qfeat, Q0, qfeat, Q1, qfeat, Q2, qfeat, Q3, qmask, Scoef, ABselA, Tleft, Tright, pR, qfeat, qfeat, remfeat, ffeat, ABselB, Tleft, Tright, pC, qfeat, qfeat, remfeat, ffeat, Scoef, ABselA, Tleft, Tright, pR, qfeat, qfeat, remfeat, ffeat, ABselB, Tleft, Tright, pC, qfeat, qfeat, remfeat, ffeat)
}
