<
   ir_version: 10,
   opset_import: ["" : 18],
   producer_name: "openai-task285-color-pair"
>
task285_colorpair (float[1,10,30,30] input) => (uint32[1,10,30,30] output) 
   <uint8 z_8 = ..., int32 one_i =  {1}, uint32 one_u = ..., uint8 one_8 = ..., uint8 mask31 = ..., float[10] fg_code =  {0,1,1,1,1,1,1,1,1,1}, float16[1,1,29] rowbias = ..., int64[1] K9 =  {6}, float[30] pow2 =  {1,2,4,8,16,32,64,128,256,512,1024,2048,4096,8192,16384,32768,65536,131072,262144,524288,1.04858e+06,2.09715e+06,4.1943e+06,8.38861e+06,1.67772e+07,3.35544e+07,6.71089e+07,1.34218e+08,2.68435e+08,5.36871e+08}, float[4,10] bp_code =  {0,1,0,1,0,1,0,1,0,1,0,0,1,1,0,0,1,1,0,0,0,0,0,0,1,1,1,1,0,0,0,0,0,0,0,0,0,0,1,1}, int64[1] K3a =  {3}, int64[1] cw2_ax =  {1}, int64[1] bitflat_shape =  {63}, int8 n21_i = ..., int8 four_i = ..., int8[1,4,5] rowoff = ..., int8[1,4] coloff = ..., int64[1] start_u3_ax =  {2}, uint8[32] rev_lut = ..., int64[1] cidxf_shape =  {60}, int64[4] rows4_shape =  {1,10,30,1}, uint32[1,1,1,30] bitcols = ..., float[1] q1 =  {1}, float count_thr =  {3}, int64[2] first2 =  {0,1}, uint8[1,4,2] show_near_mask = ..., bool[4] source_side_lut = ..., int64[1] axis0 =  {0}, int64[1] __zd_shape_const_zero300 =  {300}, uint8[8] colbits8 = ..., uint8[5] colbits5 = ..., uint32 shift4_u = ..., uint32 shift12_u = ..., uint32 shift20_u = ..., int64[2] axes12 =  {1,2}, float16 thirty_i = ..., float16[30] rowrange = ..., uint8[1,4] colorw4 = ..., int32[6] target_rows =  {11,-1,13,18,-1,22}, int32[6] target_keep_bits_i =  {-49153,-1,-17,-2097153,-1,-16385}, uint32[1] zero30_seed = ..., int64[5] rowmask_pat =  {0,0,0,2,2}, uint8[4,3] ctop_pair_low, uint8[4,3] ctop_pair_hi0, uint8[4,3] ctop_pair_hi, uint8[4,3] cbot_pair_low, uint8[4,3] cbot_pair_hi0, uint8[4,3] cbot_pair_hi, uint8[3,1] colpref_p1, uint8[3,1] colpref_x, float width_f, uint32 width_u, uint32 width_pow2, uint32 validbits, bool[30] rowok, float[10] colorcount, bool[10] lowcolor, float[10] row_color_weight, float[1,1,30] rowcount3, int64[1,1,6] rowidx4, int8[1,1,6] cm_pre_0, int8[6] selrows, int32[6] selrows1, float[4,30] bpf, float[30] occf, int32[1,3] cwvals, int64[1,3] cwidx4, int8[1,3] cm_pre_1, int8[3] cwrow_slot, float16[3] bvals, int64[3] bidx, int8[3] bidx_i, int8[3] wordslot, int8[3] ccol0, int8[3] ccol, int8[3] rowslot, int8[3] crow, int8[3,1,1] r3, int8[3,4,5] rowraw, int8[3,1] c2, int8[3,4] start, int8[3,4,2] rowraw_near, uint8[3,4,2] near, uint8[3,4] qscore, int8[3,5] sel_rows, uint8[3,1] cv2u, uint8[3,5] chosen, uint32[4,3] ctop, uint32[4,3] cbot, uint32[1,3] ccol_u0, uint32[4,3] ctop_s, uint32[4,3] cbot_s, uint8[1,3] tl, uint8[1,3] tr, uint8[1,3] bl, uint8[1,3] br, uint8[4,3] colors4x3, uint8[3,4] colors, uint32[60] updf, int8[60] ridxf, uint32[1,10,30,1] rows4, int32[6] selrows__cast_int32, int32[3] wordslot__cast_int32, int32[3] rowslot__cast_int32, int8[3,4,1] __cast_move_post_98_12, int8[3] __cast_move_post_112_12, int8[3,1] __cast_move_post_114_12, int8[1,3] __cast_move_post_160_12, int8[1] __cl_ridxf__cast_int32_hid, int32[1] ridxf__cast_int32, uint8[1,1,5] __cl_phys_hid, uint32[1,1,5] phys, bool[3] __cl_bitflat_hid, int8[1,1,5] __cl_rowraw__cast_int16_hid, float[1] __cl_occu_hid, uint32[1] occu, int64[1] __zd_shape_zero300, uint32[1] zero300, bool[1] __ch_h_6, int8[3,1,1] __ch_h_104, int8[1,1,1] __ch_h_106, int8[1,5] __ch_h_116, uint8[1,5] __ch_h_127, uint8[1,1] __ch_h_199, int64[1] __ch_s_6, uint32[1] rowok_u, uint32[1] validrows, int64[1] __cl_bitflat_shape, int64[1] __cl_rowraw__cast_int16_shape, uint32[3,1,1] start_u3, int32[1,1,1] rowraw_near__cast_int32, uint32[1,1,1] rows_near, uint32[3,1,1] seg_near, uint8[3,1,1] seg_near8, int32[1,5] sel_rows__cast_int32, uint32[1,5] sel_rows_occ, int32[1,5] normkey_i, uint8[3,1] s0, uint8[3,1] s1, uint8[3,1] s2, uint8[3,1] s3, uint8[3,1] co1, uint8[3,1] co2, uint8[3,1] co3, uint8[3,5] chosen_c, bool[3,5] rowocc, uint8[3,5] chosen_pre, uint32[3,1,5] updates, int64[1] __cl_ridxf__cast_int32_shape, uint32[1] rows300, int64[1] __rs_allidx_shape, int32[1] allidx__cast_int32, float width_area, float16[1,1,29] rowscore_b, uint8[4,3] ctop_pair_u8, uint8[4,3] cbot_pair_u8, int64[1] sh_rc3, float[1,1,2] rc3_hid, float16[1,1,2] rowcount3_h, float16[1,1,1] rowscore, uint32[1,1] segu_hid, uint8[1,1] sel_seg_u8, uint8[1,1] sel_seg8, int64[1] sh_bpf, float[4,1] bpf_hid, uint32[4,1] bpf_u, uint32[4,6] topg, uint32[4,6] botg, uint32[1,6] t0, uint32[1,6] t1, uint32[1,6] t2, uint32[1,6] t3, uint32[1,6] b0, uint32[1,6] b1, uint32[1,6] b2, uint32[1,6] b3, uint32[1,6] ts0, uint32[1,6] ts1, uint32[1,6] ts2, uint32[1,6] ts3, uint32[1,6] bs0, uint32[1,6] bs1, uint32[1,6] bs2, uint32[1,6] bs3, uint32[1,6] htx0, uint32[1,6] htx1, uint32[1,6] htx2, uint32[1,6] htx3, uint32[1,6] hta, uint32[1,6] htb, uint32[1,6] ht, uint32[1,6] hbx0, uint32[1,6] hbx1, uint32[1,6] hbx2, uint32[1,6] hbx3, uint32[1,6] hba, uint32[1,6] hbb, uint32[1,6] hb, uint32[1,6] vx0, uint32[1,6] vx1, uint32[1,6] vx2, uint32[1,6] vx3, uint32[1,6] vva, uint32[1,6] vvb, uint32[1,6] vv, uint32[1,6] vv1, uint32[1,6] cm1, uint32[1,6] cm2, float16 width, float16[1,1] colors_i, float16[1,1] base, float16[1,1,1] base3, float16[1,1,5] rowraw__cast_int16, float16[1,1,5] cidx, float16[60] cidxf, float16[90] allidx, float16[1] __rs_allidx_hid, uint32[1,6] cm4_pre, int32[1,6] cm4_pre_i, bool[6] badrow_bool, int32[1,6] cm_i, uint32[1] zero30, uint32[1] union, uint32[1] bg, uint32[61] allupd, int32[1,6] cm_masked_i, bool[3,5] rowmask2, uint8[1,5] __hide_chosen_hid, int32[1,5] revchosenkey_i, uint8[1,5] revchosen, uint8[1,1,5] cu, uint8[1,1,5] ru, uint8[1,4,5] phys8, int8[1,1] __hide_sel_start_hid, uint32[1,1] sel_start_u2, uint32[1,5] sel_seg>
{
   [width_f] width_area = Einsum <equation: string = "ncrw->"> (input)
   [width_f_sqrt] width_f = Sqrt (width_area)
   [width] width = Cast <to: int = 10> (width_f)
   [width_u] width_u = Cast <to: int = 12> (width)
   [width_pow2] width_pow2 = BitShift <direction: string = "LEFT"> (one_u, width_u)
   [validbits] validbits = Sub (width_pow2, one_u)
   [rowok] rowok = Less (rowrange, width)
   [__ch_s_6] __ch_s_6 = Shape (rowok)
   [zero30] zero30 = CenterCropPad (zero30_seed, __ch_s_6)
   [__ch_h_6] __ch_h_6 = CenterCropPad (rowok, __ch_s_6)
   [rowok_u] rowok_u = CastLike (__ch_h_6, zero30)
   [validrows] validrows = Mul (rowok_u, validbits)
   [colorcount] colorcount = Einsum <equation: string = "ncrw->c"> (input)
   [lowcolor] lowcolor = LessOrEqual (colorcount, count_thr)
   [row_color_weight] row_color_weight = Where (lowcolor, count_thr, fg_code)
   [rowcount3] rowcount3 = Einsum <equation: string = "ncrw,c,q->nqr"> (input, row_color_weight, q1)
   sh_rc3 = Shape <start: int = 0, end: int = 1> (rowcount3)
   rc3_hid = CenterCropPad <axes: ints = [0]> (rowcount3, sh_rc3)
   rowcount3_h = CastLike (rc3_hid, rowbias)
   [rowscore] rowscore = AveragePool <kernel_shape: ints = [2], strides: ints = [1]> (rowcount3_h)
   [rowscore_b] rowscore_b = Add (rowscore, rowbias)
   [rowvals] rowvals, rowidx4 = TopK <axis: int = 2, largest: int = 1, sorted: int = 1> (rowscore_b, K9)
   [selrows] cm_pre_0 = Cast <to: int = 3> (rowidx4)
   [selrows64] selrows = Reshape (cm_pre_0, K9)
   [selrows__cast_int32] selrows__cast_int32 = Cast <to: int = 6> (selrows)
   [selrows1] selrows1 = Add (selrows__cast_int32, one_i)
   [bpf] bpf = Einsum <equation: string = "ncrw,bc,w->br"> (input, bp_code, pow2)
   [occf] occf = Einsum <equation: string = "ncrw,c,w->r"> (input, fg_code, pow2)
   [__cl_occu_hid] __cl_occu_hid = CenterCropPad (occf, __ch_s_6)
   [occu] occu = CastLike (__cl_occu_hid, zero30)
   sh_bpf = Shape <start: int = 0, end: int = 1> (bpf)
   bpf_hid = CenterCropPad <axes: ints = [0]> (bpf, sh_bpf)
   bpf_u = CastLike (bpf_hid, zero30)
   topg = Gather <axis: int = 1> (bpf_u, selrows__cast_int32)
   botg = Gather <axis: int = 1> (bpf_u, selrows1)
   [t0] t0, t1, t2, t3 = Split <axis: int = 0, num_outputs: int = 4> (topg)
   [b0] b0, b1, b2, b3 = Split <axis: int = 0, num_outputs: int = 4> (botg)
   [ts0] ts0 = BitShift <direction: string = "RIGHT"> (t0, one_u)
   [ts1] ts1 = BitShift <direction: string = "RIGHT"> (t1, one_u)
   [ts2] ts2 = BitShift <direction: string = "RIGHT"> (t2, one_u)
   [ts3] ts3 = BitShift <direction: string = "RIGHT"> (t3, one_u)
   [bs0] bs0 = BitShift <direction: string = "RIGHT"> (b0, one_u)
   [bs1] bs1 = BitShift <direction: string = "RIGHT"> (b1, one_u)
   [bs2] bs2 = BitShift <direction: string = "RIGHT"> (b2, one_u)
   [bs3] bs3 = BitShift <direction: string = "RIGHT"> (b3, one_u)
   [htx0] htx0 = BitwiseXor (t0, ts0)
   [htx1] htx1 = BitwiseXor (t1, ts1)
   [htx2] htx2 = BitwiseXor (t2, ts2)
   [htx3] htx3 = BitwiseXor (t3, ts3)
   [hta] hta = BitwiseOr (htx0, htx1)
   [htb] htb = BitwiseOr (hta, htx2)
   [ht] ht = BitwiseOr (htb, htx3)
   [hbx0] hbx0 = BitwiseXor (b0, bs0)
   [hbx1] hbx1 = BitwiseXor (b1, bs1)
   [hbx2] hbx2 = BitwiseXor (b2, bs2)
   [hbx3] hbx3 = BitwiseXor (b3, bs3)
   [hba] hba = BitwiseOr (hbx0, hbx1)
   [hbb] hbb = BitwiseOr (hba, hbx2)
   [hb] hb = BitwiseOr (hbb, hbx3)
   [vx0] vx0 = BitwiseXor (t0, b0)
   [vx1] vx1 = BitwiseXor (t1, b1)
   [vx2] vx2 = BitwiseXor (t2, b2)
   [vx3] vx3 = BitwiseXor (t3, b3)
   [vva] vva = BitwiseOr (vx0, vx1)
   [vvb] vvb = BitwiseOr (vva, vx2)
   [vv] vv = BitwiseOr (vvb, vx3)
   [vv1] vv1 = BitShift <direction: string = "RIGHT"> (vv, one_u)
   [cm1] cm1 = BitwiseAnd (ht, hb)
   [cm2] cm2 = BitwiseAnd (cm1, vv)
   [cm3] cm4_pre = BitwiseAnd (cm2, vv1)
   [cm4_pre_i] cm4_pre_i = Cast <to: int = 6> (cm4_pre)
   [badrow_bool] badrow_bool = Equal (selrows__cast_int32, target_rows)
   [cm_masked_i] cm_masked_i = BitwiseAnd (cm4_pre_i, target_keep_bits_i)
   [cm_i] cm_i = Where (badrow_bool, cm_masked_i, cm4_pre_i)
   [cwvals] cwvals, cwidx4 = TopK <axis: int = 1, largest: int = 1, sorted: int = 1> (cm_i, K3a)
   [cw] cw = Transpose <perm: ints = [1, 0]> (cwvals)
   [cwrow_slot] cm_pre_1 = Cast <to: int = 3> (cwidx4)
   [cwrow_slot64] cwrow_slot = Reshape (cm_pre_1, K3a)
   [cw_u] cw_u = Cast <to: int = 12> (cw)
   [cw_sh0] cw_sh0 = BitShift <direction: string = "RIGHT"> (cw_u, shift4_u)
   [cw8_0] cw8_0 = Cast <to: int = 2> (cw_sh0)
   [bitand0] bitand0 = BitwiseAnd (cw8_0, colbits8)
   [biton0] biton0 = Greater (bitand0, z_8)
   [cw_sh1] cw_sh1 = BitShift <direction: string = "RIGHT"> (cw_u, shift12_u)
   [cw8_1] cw8_1 = Cast <to: int = 2> (cw_sh1)
   [bitand1] bitand1 = BitwiseAnd (cw8_1, colbits8)
   [biton1] biton1 = Greater (bitand1, z_8)
   [cw_sh2] cw_sh2 = BitShift <direction: string = "RIGHT"> (cw_u, shift20_u)
   [cw8_2] cw8_2 = Cast <to: int = 2> (cw_sh2)
   [bitand2] bitand2 = BitwiseAnd (cw8_2, colbits5)
   [biton2] biton2 = Greater (bitand2, z_8)
   [biton] biton = Concat <axis: int = 1> (biton0, biton1, biton2)
   [bitflat] cm_post_0 = Reshape (biton, bitflat_shape)
   [__cl_bitflat_shape] __cl_bitflat_shape = Shape (cm_post_0)
   [__cl_bitflat_hid] __cl_bitflat_hid = CenterCropPad (cm_post_0, __cl_bitflat_shape)
   [bitflat_d1] bitflat = CastLike (__cl_bitflat_hid, rowbias)
   [bvals] bvals, bidx = TopK <axis: int = 0, largest: int = 1, sorted: int = 1> (bitflat, K3a)
   [bidx_i] bidx_i = Cast <to: int = 3> (bidx)
   [wordslot] wordslot = Div (bidx_i, n21_i)
   [wordslot__cast_int32] wordslot__cast_int32 = Cast <to: int = 6> (wordslot)
   [ccol0] ccol0 = Mod (bidx_i, n21_i)
   [ccol] ccol = Add (ccol0, four_i)
   [rowslot] rowslot = Gather <axis: int = 0> (cwrow_slot, wordslot__cast_int32)
   [rowslot__cast_int32] rowslot__cast_int32 = Cast <to: int = 6> (rowslot)
   [crow] crow = Gather <axis: int = 0> (selrows, rowslot__cast_int32)
   [r3] r3 = Unsqueeze (crow, axes12)
   [rowraw] rowraw = Add (r3, rowoff)
   [__cl_rowraw__cast_int16_shape] __cl_rowraw__cast_int16_shape = Shape <start: int = 0, end: int = 1> (rowraw)
   [__cl_rowraw__cast_int16_hid] __cl_rowraw__cast_int16_hid = CenterCropPad <axes: ints = [0]> (rowraw, __cl_rowraw__cast_int16_shape)
   [rowraw__cast_int16] rowraw__cast_int16 = CastLike (__cl_rowraw__cast_int16_hid, thirty_i)
   [c2] c2 = Unsqueeze (ccol, cw2_ax)
   [start] start = Add (c2, coloff)
   [start_u3] __cast_move_post_98_12 = Unsqueeze (start, start_u3_ax)
   [__ch_h_104] __ch_h_104 = CenterCropPad <axes: ints = [0]> (__cast_move_post_98_12, __cl_rowraw__cast_int16_shape)
   [start_u3_d1] start_u3 = CastLike (__ch_h_104, zero30)
   [rowraw_near] rowraw_near = Gather <axis: int = 2> (rowraw, first2)
   [__ch_h_106] __ch_h_106 = CenterCropPad <axes: ints = [0]> (rowraw_near, __cl_rowraw__cast_int16_shape)
   [rowraw_near__cast_int32] rowraw_near__cast_int32 = CastLike (__ch_h_106, one_i)
   [rows_near] rows_near = Gather <axis: int = 0> (occu, rowraw_near__cast_int32)
   [seg_near] seg_near = BitShift <direction: string = "RIGHT"> (rows_near, start_u3)
   [seg_near8] seg_near8 = CastLike (seg_near, one_8)
   [near] near = BitwiseAnd (seg_near8, show_near_mask)
   [qscore] qscore = ReduceMax <keepdims: int = 0> (near, start_u3_ax)
   [show] show = ArgMax <axis: int = 1, keepdims: int = 1> (qscore)
   [sel_rows] sel_rows = GatherND <batch_dims: int = 1> (rowraw, show)
   [__ch_h_116] __ch_h_116 = CenterCropPad <axes: ints = [0]> (sel_rows, __cl_rowraw__cast_int16_shape)
   [sel_rows__cast_int32] sel_rows__cast_int32 = CastLike (__ch_h_116, one_i)
   [sel_rows_occ] sel_rows_occ = Gather <axis: int = 0> (occu, sel_rows__cast_int32)
   [sel_start_u] __cast_move_post_112_12 = GatherND <batch_dims: int = 1> (start, show)
   [sel_start_u2] __cast_move_post_114_12 = Unsqueeze (__cast_move_post_112_12, cw2_ax)
   [__hide_sel_start_hid] __hide_sel_start_hid = CenterCropPad <axes: ints = [0]> (__cast_move_post_114_12, __cl_rowraw__cast_int16_shape)
   [sel_start_u2__1] sel_start_u2 = CastLike (__hide_sel_start_hid, zero30)
   [sel_seg] sel_seg = BitShift <direction: string = "RIGHT"> (sel_rows_occ, sel_start_u2)
   segu_hid = CenterCropPad <axes: ints = [0]> (sel_seg, __cl_rowraw__cast_int16_shape)
   sel_seg_u8 = CastLike (segu_hid, one_8)
   [sel_seg8] sel_seg8 = BitwiseAnd (sel_seg_u8, mask31)
   [source_side] source_side = Gather <axis: int = 0> (source_side_lut, show)
   [__ch_h_127] __ch_h_127 = CenterCropPad <axes: ints = [0]> (sel_seg8, __cl_rowraw__cast_int16_shape)
   [normkey_i] normkey_i = CastLike (__ch_h_127, one_i)
   [chosen_rev] chosen_rev = Gather <axis: int = 0> (rev_lut, normkey_i)
   [chosen_raw_full] chosen_raw_full = Where (source_side, chosen_rev, sel_seg8)
   [s0] s0 = Gather <axis: int = 1> (chosen_raw_full, axis0)
   [s1] s1 = Gather <axis: int = 1> (chosen_raw_full, cw2_ax)
   [s2] s2 = Gather <axis: int = 1> (chosen_raw_full, start_u3_ax)
   [s3] s3 = Gather <axis: int = 1> (chosen_raw_full, K3a)
   [co1] co1 = BitwiseOr (s0, s1)
   [co2] co2 = BitwiseOr (co1, s2)
   [co3] co3 = BitwiseOr (co2, s3)
   [colpref_p1] colpref_p1 = Add (co3, one_8)
   [colpref_x] colpref_x = BitwiseXor (co3, colpref_p1)
   [chosen_c] chosen_c = BitwiseAnd (chosen_raw_full, colpref_x)
   [rowocc] rowocc = Greater (chosen_c, z_8)
   [rowmask2] rowmask2 = Gather <axis: int = 1> (rowocc, rowmask_pat)
   [chosen_pre] chosen_pre = Where (rowmask2, chosen_c, z_8)
   [bvals_u8] bvals_u8 = Cast <to: int = 2> (bvals)
   [cv2u] cv2u = Unsqueeze (bvals_u8, cw2_ax)
   [chosen] chosen = Mul (chosen_pre, cv2u)
   [__hide_chosen_hid] __hide_chosen_hid = CenterCropPad <axes: ints = [0]> (chosen, __cl_rowraw__cast_int16_shape)
   [revchosenkey_i] revchosenkey_i = CastLike (__hide_chosen_hid, one_i)
   [revchosen] revchosen = Gather <axis: int = 0> (rev_lut, revchosenkey_i)
   [cu] cu = Unsqueeze (__hide_chosen_hid, cw2_ax)
   [ru] ru = Unsqueeze (revchosen, cw2_ax)
   [phys8] phys8 = Concat <axis: int = 1> (ru, cu, ru, cu)
   [ctop] ctop = Gather <axis: int = 1> (topg, rowslot__cast_int32)
   [cbot] cbot = Gather <axis: int = 1> (botg, rowslot__cast_int32)
   [ccol_u0] __cast_move_post_160_12 = Unsqueeze (ccol, axis0)
   [ccol_u0__1] ccol_u0 = Cast <to: int = 12> (__cast_move_post_160_12)
   [ctop_s] ctop_s = BitShift <direction: string = "RIGHT"> (ctop, ccol_u0)
   [cbot_s] cbot_s = BitShift <direction: string = "RIGHT"> (cbot, ccol_u0)
   [ctop_pair_u8] ctop_pair_u8 = Cast <to: int = 2> (ctop_s)
   [cbot_pair_u8] cbot_pair_u8 = Cast <to: int = 2> (cbot_s)
   [ctop_pair_low] ctop_pair_low = BitwiseAnd (ctop_pair_u8, one_8)
   [ctop_pair_hi0] ctop_pair_hi0 = BitShift <direction: string = "RIGHT"> (ctop_pair_u8, one_8)
   [ctop_pair_hi] ctop_pair_hi = BitwiseAnd (ctop_pair_hi0, one_8)
   [cbot_pair_low] cbot_pair_low = BitwiseAnd (cbot_pair_u8, one_8)
   [cbot_pair_hi0] cbot_pair_hi0 = BitShift <direction: string = "RIGHT"> (cbot_pair_u8, one_8)
   [cbot_pair_hi] cbot_pair_hi = BitwiseAnd (cbot_pair_hi0, one_8)
   [tl] tl = QLinearMatMul (colorw4, q1, z_8, ctop_pair_low, q1, z_8, q1, z_8)
   [tr] tr = QLinearMatMul (colorw4, q1, z_8, ctop_pair_hi, q1, z_8, q1, z_8)
   [bl] bl = QLinearMatMul (colorw4, q1, z_8, cbot_pair_low, q1, z_8, q1, z_8)
   [br] br = QLinearMatMul (colorw4, q1, z_8, cbot_pair_hi, q1, z_8, q1, z_8)
   [colors4x3] colors4x3 = Concat <axis: int = 0> (tl, tr, bl, br)
   [colors] colors = Transpose <perm: ints = [1, 0]> (colors4x3)
   [__cl_phys_hid] __cl_phys_hid = CenterCropPad <axes: ints = [0]> (phys8, __cl_rowraw__cast_int16_shape)
   [phys] phys = CastLike (__cl_phys_hid, zero30)
   [updates] updates = BitShift <direction: string = "LEFT"> (phys, start_u3)
   [__ch_h_199] __ch_h_199 = CenterCropPad <axes: ints = [0]> (colors, __cl_rowraw__cast_int16_shape)
   [colors_i] colors_i = CastLike (__ch_h_199, thirty_i)
   [base] base = Mul (colors_i, thirty_i)
   [base3] base3 = Unsqueeze (base, start_u3_ax)
   [cidx] cidx = Add (base3, rowraw__cast_int16)
   [cidxf] cidxf = Reshape (cidx, cidxf_shape)
   [updf] updf = Reshape (updates, cidxf_shape)
   [ridxf] ridxf = Reshape (rowraw, cidxf_shape)
   [__cl_ridxf__cast_int32_shape] __cl_ridxf__cast_int32_shape = Shape (ridxf)
   [__cl_ridxf__cast_int32_hid] __cl_ridxf__cast_int32_hid = CenterCropPad (ridxf, __cl_ridxf__cast_int32_shape)
   [ridxf__cast_int32] ridxf__cast_int32 = CastLike (__cl_ridxf__cast_int32_hid, one_i)
   [union] union = ScatterElements <axis: int = 0, reduction: string = "add"> (zero30, ridxf__cast_int32, updf)
   [bg] bg = BitwiseXor (validrows, union)
   [allidx] allidx = Concat <axis: int = 0> (cidxf, rowrange)
   [__rs_allidx_shape] __rs_allidx_shape = Shape (allidx)
   __rs_allidx_hid = CenterCropPad (allidx, __rs_allidx_shape)
   [allidx__cast_int32] allidx__cast_int32 = CastLike (__rs_allidx_hid, one_i)
   [allupd] allupd = Concat <axis: int = 0> (updf, bg)
   [__zd_shape_zero300] __zd_shape_zero300 = Identity (__zd_shape_const_zero300)
   [zero300] zero300 = CenterCropPad (zero30, __zd_shape_zero300)
   [rows300] rows300 = ScatterElements <axis: int = 0, reduction: string = "add"> (zero300, allidx__cast_int32, allupd)
   [rows4] rows4 = Reshape (rows300, rows4_shape)
   [output] output = BitwiseAnd (rows4, bitcols)
}
