<
   ir_version: 10,
   opset_import: ["" : 18]
>
task226_scalar_gather (float[1,10,30,30] input) => (uint8[1,10,30,30] output) 
   <float q_scale =  {0.0147}, uint8 q_xz = ..., uint8 x_zp = ..., uint8 R_B = ..., uint8[1,2,1,1] R_F = ..., uint8[1,2,1,1] R_M = ..., uint8[1,2,1,1] R_L = ..., uint8[1,1,1,1] C_F = ..., uint8[1,1,1,1] C_M = ..., uint8[1,1,1,1] C_L = ..., uint8[10,2,1,1] q_w = ..., int64[1,1,1,1] idx1 =  {1}, int64[1,1,1,1] idx2 =  {2}, int64[1,1,1,1] idx3 =  {3}, int64[1,1,1,1] idx5 =  {5}, int64[1,1,1,1] idx6 =  {6}, int64[1,1,1,1] idx8 =  {8}>
{
   r1_f = GatherElements <axis: int = 2> (input, idx1)
   r1 = Cast <to: int = 9> (r1_f)
   r3_f = GatherElements <axis: int = 2> (input, idx3)
   r3 = Cast <to: int = 9> (r3_f)
   r6_f = GatherElements <axis: int = 2> (input, idx6)
   r6 = Cast <to: int = 9> (r6_f)
   r8_f = GatherElements <axis: int = 2> (input, idx8)
   r8 = Cast <to: int = 9> (r8_f)
   c1_f = GatherElements <axis: int = 3> (input, idx1)
   c1 = Cast <to: int = 9> (c1_f)
   c2_f = GatherElements <axis: int = 3> (input, idx2)
   c2 = Cast <to: int = 9> (c2_f)
   c3_f = GatherElements <axis: int = 3> (input, idx3)
   c3 = Cast <to: int = 9> (c3_f)
   c5_f = GatherElements <axis: int = 3> (input, idx5)
   c5 = Cast <to: int = 9> (c5_f)
   c6_f = GatherElements <axis: int = 3> (input, idx6)
   c6 = Cast <to: int = 9> (c6_f)
   c8_f = GatherElements <axis: int = 3> (input, idx8)
   c8 = Cast <to: int = 9> (c8_f)
   nr8 = Not (r8)
   r3_and_nr8 = And (r3, nr8)
   nr1 = Not (r1)
   r6_and_nr1 = And (r6, nr1)
   rp1 = Where (r1, R_F, q_xz)
   rp2_i = Where (r3, q_xz, R_F)
   rp2 = Where (r1, rp2_i, R_B)
   rp3_i = Where (r8, R_M, R_B)
   rp3 = Where (r3, rp3_i, q_xz)
   rp4 = Where (r3_and_nr8, q_xz, R_M)
   rp5 = Where (r6_and_nr1, q_xz, R_M)
   rp6_i = Where (r1, R_M, R_B)
   rp6 = Where (r6, rp6_i, q_xz)
   rp7_i = Where (r6, q_xz, R_L)
   rp7 = Where (r8, rp7_i, R_B)
   rp8 = Where (r8, R_L, q_xz)
   row_code = Concat <axis: int = 2> (R_F, rp1, rp2, rp3, rp4, rp5, rp6, rp7, rp8, R_L)
   c8_mid_bg = Where (c8, C_M, R_B)
   cp1 = Where (c1, C_F, q_xz)
   p2_c2 = Where (c2, C_F, q_xz)
   p2_c3 = Where (c3, c8_mid_bg, R_B)
   cp2 = Where (c1, p2_c2, p2_c3)
   p3_c1 = Where (c1, C_F, c8_mid_bg)
   p3_c3 = Where (c3, p3_c1, q_xz)
   cp3 = Where (c2, p3_c3, c8_mid_bg)
   p4_c2 = Where (c2, q_xz, C_M)
   p4_c1 = Where (c1, p4_c2, C_M)
   p4_c8 = Where (c8, p4_c1, q_xz)
   cp4 = Where (c3, p4_c8, C_M)
   cp5 = Where (c5, C_M, q_xz)
   p6_c6 = Where (c6, C_M, q_xz)
   p6_c3 = Where (c3, C_L, R_B)
   p6_c1 = Where (c1, C_L, p6_c3)
   cp6 = Where (c5, p6_c6, p6_c1)
   p7_c8_zero_mid = Where (c8, q_xz, C_M)
   p7_c8_last_bg = Where (c8, C_L, R_B)
   p7_c6 = Where (c6, p7_c8_zero_mid, p7_c8_last_bg)
   p7_c5 = Where (c5, p7_c6, C_L)
   p7_c3 = Where (c3, C_L, q_xz)
   p7_c8_right = Where (c8, p7_c3, R_B)
   cp7 = Where (c1, p7_c5, p7_c8_right)
   cp8 = Where (c8, C_L, q_xz)
   col_code = Concat <axis: int = 3> (C_F, cp1, cp2, cp3, cp4, cp5, cp6, cp7, cp8, C_L)
   feat = BitwiseAnd (row_code, col_code)
   output = QLinearConv <pads: ints = [0, 0, 20, 20]> (feat, q_scale, x_zp, q_w, q_scale, R_B, q_scale, q_xz)
}
