<
   ir_version: 10,
   opset_import: ["" : 18]
>
task216_bitroi (float[1,10,30,30] input) => (uint8[1,10,30,30] output) 
   <int32[30] pow_w =  {1,2,4,8,16,32,64,128,256,512,1024,2048,4096,8192,16384,32768,65536,131072,262144,524288,0,0,0,0,0,0,0,0,0,0}, int64[1] sl0 =  {0}, uint32 one_u32 = ..., int32[1] one_i32 =  {1}, int64[1] unsq1 =  {1}, uint8 thirty_u32 = ..., int64[4] batch4 =  {0,0,0,0}, uint8[1] __cs_init_2_split = ..., uint8[1] __cs_init_2_split_0 = ..., uint8[1] __cs_init_2_split_1 = ..., uint8[1] ch3_i32_v = ..., int64[1] sl18_i32 =  {17}, int64[1] t3_i64 =  {3}, int64[1] t2_i64 =  {2}, int32[1] col30, uint8[1] cols_u, int64[4] corner_src, int32[4] corner_vals, float16[4] counts, uint8[4,1] cu, float16[1] cvf, int32[1] ends_pair, uint8[1] ht, float16[1] lg2c, float16[1] lgc, int32[4] low1, int32[4] low2, int32[9] low8, int32[4] neg1, int32[4] neg2, int32[17] new, uint8[1,2,1,1] pair, int32[4] rem, uint8[4,4] roi_u, float16[4,1,1,1] roiout, int32[1] row30, int64[1] rowidx, uint8[4] rows_u, int32[17] rowu, int32[4] rowvals, int32[1] rplus, int32[1] rseg, int32[1] rsel, uint8[4,1] ru, int32[4] runplus, int32[1] starts_pair, int32[1] wbit, uint8[1] wc, uint8[1] wc2, float16[1] wf, uint8[1] wh, uint8[1] width_u, int64[1] winner, float16[1] wlog, uint8[1] wr, uint8[1] wr2, uint8[1] wt, uint8[1] ww, uint8[4] x2, uint8[4,1] x2u, int32[17] xor, uint8[4] y2, uint8[4,1] y2u, uint8[4] __cs_concat_pair0, uint8[4] __cs_concat_pair1, uint8[8] __cs_concat_2, uint8[4,1] __cl_roi_f_hid, float16[4,1] roi_f, uint8 __cl_pads_hid, int64 pads, uint8[1] __cl_rows_u__cast_uint32_hid, uint32[1] rows_u__cast_uint32, int32[1] cols_i64, int32[1] __cast_move_post_38_12, uint32[1] csel, uint32[1] cseg, uint32[1] cplus, uint32[1] hbit, float16[1] hf, float16[1] hlog, uint8[1] height_u, int64[1] __cl_pads_shape, int64[1] input_shape, float[1,1,1,1] input_hid, float16[1,1,1,1] input_f16, uint8[1,1,1,1] input_u8, int32[1] rows_i32_h, int32[1,1,1,1] input_i32, int64[1] sl20_dyn, uint8[1] starts_hid, uint8[1] ends_hid, uint8[3] rowidx8_u8, int64[1] shape4_dyn, int64[1] rowu_len_minus, int64[1] rowu_len_plus, int32[1] prev_a, int32[1] prev_b, int32[1] prev, uint8[1,1,1,1] red4_hid, uint8[1,3,1,1] red3_hid, uint8[1,2,1,1] red2_hid, uint8[1,1,1,1] red1_hid, uint8[1] rowidx_u8, float16[1] wlg2_pre, float16[1] hlg2_pre, float16[1] width_f, float16[1] height_f, int32[1] corner_vals_hid, uint8[4] cols_u4>
{
   [input_shape] input_shape = CastLike (__cs_init_2_split_1, sl0)
   [shape4_dyn] shape4_dyn = Shape (batch4)
   [input_hid] input_hid = CenterCropPad <axes: ints = [1]> (input, input_shape)
   [input_u8] input_u8 = CastLike (input_hid, __cs_init_2_split_0)
   red4_hid = CenterCropPad <axes: ints = [1]> (input_u8, shape4_dyn)
   red3_hid = CenterCropPad <axes: ints = [1]> (red4_hid, t3_i64)
   red2_hid = CenterCropPad <axes: ints = [1]> (red3_hid, t2_i64)
   red1_hid = CenterCropPad <axes: ints = [1]> (red2_hid, unsq1)
   [input_f16] input_f16 = Cast <to: int = 10> (red1_hid)
   [input_i32] input_i32 = CastLike (input_u8, one_i32)
   [row30] row30 = Einsum <equation: string = "nchw,h->w"> (input_i32, pow_w)
   [sl20_dyn] sl20_dyn = Identity (sl18_i32)
   [rowu] rowu = Slice (row30, sl0, sl20_dyn, sl0)
   [col30] col30 = Einsum <equation: string = "nchw,w->h"> (input_i32, pow_w)
   [rowu_len_minus] rowu_len_minus = Sub (sl20_dyn, unsq1)
   [rowu_len_plus] rowu_len_plus = Add (sl20_dyn, unsq1)
   [prev_a] prev_a = CenterCropPad (rowu, rowu_len_minus)
   [prev_b] prev_b = CenterCropPad (prev_a, rowu_len_plus)
   [prev] prev = CenterCropPad (prev_b, sl20_dyn)
   [xor] xor = BitwiseXor (rowu, prev)
   [new] new = BitwiseAnd (xor, rowu)
   [rowvals] rowvals, rowidx = TopK <axis: int = 0, largest: int = 1, sorted: int = 1> (new, shape4_dyn)
   [rowidx_u8] rowidx_u8 = CastLike (rowidx, __cs_init_2_split_0)
   [neg1] neg1 = Neg (rowvals)
   [low1] low1 = BitwiseAnd (rowvals, neg1)
   [runplus] runplus = Add (rowvals, low1)
   [rem] rem = BitwiseAnd (rowvals, runplus)
   [neg2] neg2 = Neg (rem)
   [low2] low2 = BitwiseAnd (rem, neg2)
   [low8] low8 = Concat <axis: int = 0> (low1, low2, one_i32)
   [corner_vals] corner_vals, corner_src = TopK <axis: int = 0, largest: int = 1, sorted: int = 1> (low8, shape4_dyn)
   corner_vals_hid = CenterCropPad (corner_vals, shape4_dyn)
   [rowidx8_u8] rowidx8_u8 = Concat <axis: int = 0> (rowidx_u8, rowidx_u8, __cs_init_2_split_0)
   [rows_u] rows_u = Gather <axis: int = 0> (rowidx8_u8, corner_src)
   [__cl_rows_u__cast_uint32_hid] __cl_rows_u__cast_uint32_hid = CenterCropPad (rows_u, shape4_dyn)
   [rows_u__cast_uint32] rows_u__cast_uint32 = CastLike (__cl_rows_u__cast_uint32_hid, one_u32)
   [rows_i32_h] rows_i32_h = CastLike (__cl_rows_u__cast_uint32_hid, one_i32)
   [cvf] cvf = CastLike (corner_vals_hid, input_f16)
   [lgc] lgc = Log (cvf)
   [lg2c] lg2c = Selu <alpha: float = 1.67326, gamma: float = 1.44336> (lgc)
   [cols_u] cols_u = CastLike (lg2c, __cs_init_2_split_0)
   [cols_u4] cols_u4 = CenterCropPad (cols_u, shape4_dyn)
   [rsel] rsel = Gather <axis: int = 0> (rowu, rows_i32_h)
   [rseg] rseg = Div (rsel, corner_vals_hid)
   [rplus] rplus = Add (rseg, one_i32)
   [wbit] wbit = BitwiseXor (rseg, rplus)
   [wf] wf = CastLike (wbit, input_f16)
   [wlog] wlog = Log (wf)
   [wlg2_pre] wlg2_pre = Selu <alpha: float = 1.67326, gamma: float = 1.37012> (wlog)
   [width_u] width_u = CastLike (wlg2_pre, __cs_init_2_split_0)
   [cols_i64] cols_i64 = CastLike (cols_u, one_i32)
   [__cast_move_post_38_12] __cast_move_post_38_12 = Gather <axis: int = 0> (col30, cols_i64)
   [csel] csel = CastLike (__cast_move_post_38_12, one_u32)
   [cseg] cseg = BitShift <direction: string = "RIGHT"> (csel, rows_u__cast_uint32)
   [cplus] cplus = Add (cseg, one_u32)
   [hbit] hbit = BitwiseXor (cseg, cplus)
   [hf] hf = CastLike (hbit, input_f16)
   [hlog] hlog = Log (hf)
   [hlg2_pre] hlg2_pre = Selu <alpha: float = 1.67326, gamma: float = 1.37012> (hlog)
   [height_u] height_u = CastLike (hlg2_pre, thirty_u32)
   [x2] x2 = Add (rows_u, height_u)
   [y2] y2 = Add (cols_u4, width_u)
   [cu] cu = Unsqueeze (rows_u, unsq1)
   [ru] ru = Unsqueeze (cols_u4, unsq1)
   [x2u] x2u = Unsqueeze (x2, unsq1)
   [y2u] y2u = Unsqueeze (y2, unsq1)
   [roi_u] roi_u = Concat <axis: int = 1> (cu, ru, x2u, y2u)
   [__cl_roi_f_hid] __cl_roi_f_hid = CenterCropPad <axes: ints = [1]> (roi_u, shape4_dyn)
   [roi_f] roi_f = CastLike (__cl_roi_f_hid, input_f16)
   [roiout] roiout = RoiAlign <coordinate_transformation_mode: string = "half_pixel", mode: string = "avg", output_height: int = 1, output_width: int = 1, sampling_ratio: int = 0, spatial_scale: float = 1> (input_f16, roi_f, batch4)
   [width_f] width_f = CastLike (width_u, input_f16)
   [height_f] height_f = CastLike (height_u, input_f16)
   [counts] counts = Einsum <equation: string = "kchw,k,k->k"> (roiout, width_f, height_f)
   [winner] winner = ArgMax <axis: int = 0, keepdims: int = 1> (counts)
   [wr] wr = Gather <axis: int = 0> (cols_u, winner)
   [wc] wc = Gather <axis: int = 0> (rows_u, winner)
   [wh] wh = Gather <axis: int = 0> (width_u, winner)
   [ww] ww = Gather <axis: int = 0> (height_u, winner)
   [wr2] wr2 = Add (wr, wh)
   [wc2] wc2 = Add (wc, ww)
   [__cs_concat_pair0] __cs_concat_pair0 = Concat <axis: int = 0> (__cs_init_2_split_0, __cs_init_2_split_0, wr, wc)
   [starts_hid] starts_hid = CenterCropPad (__cs_concat_pair0, shape4_dyn)
   [starts_pair] starts_pair = CastLike (starts_hid, one_i32)
   [__cs_concat_pair1] __cs_concat_pair1 = Concat <axis: int = 0> (__cs_init_2_split, ch3_i32_v, wr2, wc2)
   [ends_hid] ends_hid = CenterCropPad (__cs_concat_pair1, shape4_dyn)
   [ends_pair] ends_pair = CastLike (ends_hid, one_i32)
   [pair] pair = Slice (input_u8, starts_pair, ends_pair)
   [ht] ht = Sub (thirty_u32, wh)
   [wt] wt = Sub (thirty_u32, ww)
   [__cs_concat_2] __cs_concat_2 = Concat <axis: int = 0> (__cs_init_2_split_0, __cs_init_2_split, __cs_init_2_split_0, __cs_init_2_split_0, __cs_init_2_split_0, __cs_init_2_split_1, ht, wt)
   [__cl_pads_shape] __cl_pads_shape = Shape (__cs_concat_2)
   [__cl_pads_hid] __cl_pads_hid = CenterCropPad (__cs_concat_2, __cl_pads_shape)
   [pads] pads = CastLike (__cl_pads_hid, sl0)
   [output] output = Pad <mode: string = "constant"> (pair, pads, __cs_init_2_split_0)
}
