<
   ir_version: 10,
   opset_import: ["" : 18]
>
task270_shift_u8_dupidx (float[1,10,30,30] input) => (float16[1,10,30,30] output) 
   <float[2,10] Psel =  {0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0}, float16[2,30] base = ..., float16[2,6] A = ..., float16[1,6,10] K = ..., uint8 one8 = ..., float[30] coord =  {0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29}, float16[2,3] upd_ppc = ..., float[1,10] Cenc =  {0,1,16,0,0,0,0,0,0,0}, uint8 sixteen_u8 = ..., int32 i32like =  {0}, int64[2] idx_shape2, uint8[1,1] Ridx8_hid, uint8[1,1] Cidx8_hid>
{
   cr8_code = Einsum <equation: string = "nchw,tc,h->tn"> (input, Cenc, coord)
   cr8_u = Cast <to: int = 2> (cr8_code)
   cr8_hiu = Div (cr8_u, sixteen_u8)
   cr8_lou = Mod <fmod: int = 0> (cr8_u, sixteen_u8)
   cr8 = Concat <axis: int = 0> (cr8_hiu, cr8_lou)
   cc8_code = Einsum <equation: string = "nchw,tc,w->tn"> (input, Cenc, coord)
   cc8_u = Cast <to: int = 2> (cc8_code)
   cc8_hiu = Div (cc8_u, sixteen_u8)
   cc8_lou = Mod <fmod: int = 0> (cc8_u, sixteen_u8)
   cc8 = Concat <axis: int = 0> (cc8_hiu, cc8_lou)
   pn = Einsum <equation: string = "nchw,tc->tn"> (input, Psel)
   pr = Einsum <equation: string = "nchw,tc,h->tn"> (input, Psel, coord)
   pc = Einsum <equation: string = "nchw,tc,w->tn"> (input, Psel, coord)
   pr2 = Einsum <equation: string = "nchw,tc,h,h->tn"> (input, Psel, coord, coord)
   pn8 = Cast <to: int = 2> (pn)
   pr8 = Cast <to: int = 2> (pr)
   pc8 = Cast <to: int = 2> (pc)
   pr2u = Cast <to: int = 2> (pr2)
   pn_cr8 = Mul (pn8, cr8)
   sr8 = Sub (pr8, pn_cr8)
   q_inner8 = Add (pr8, sr8)
   cr_inner8 = Mul (cr8, q_inner8)
   qru = Sub (pr2u, cr_inner8)
   sr2_8 = Mul (sr8, sr8)
   bothv = Greater (qru, sr2_8)
   up0 = Less (pr8, pn_cr8)
   dn0 = Greater (pr8, pn_cr8)
   [bothv8] bothv8 = Cast <to: int = 2> (bothv)
   [up8] up8 = Where (up0, one8, bothv8)
   [dn8] dn8 = Where (dn0, one8, bothv8)
   vcnt8 = Add (up8, dn8)
   hcnt8 = Add (vcnt8, one8)
   bothh = Greater (pn8, hcnt8)
   pn_cc8 = Mul (pn8, cc8)
   left0 = Less (pc8, pn_cc8)
   right0 = Greater (pc8, pn_cc8)
   [bothh8] bothh8 = Cast <to: int = 2> (bothh)
   [left8] left8 = Where (left0, one8, bothh8)
   [right8] right8 = Where (right0, one8, bothh8)
   upidx8 = Sub (cr8, up8)
   dnidx8 = Add (cr8, dn8)
   Ridx8 = Concat <axis: int = 1> (upidx8, dnidx8, cr8)
   idx_shape2 = Shape (Ridx8)
   Ridx8_hid = CenterCropPad (Ridx8, idx_shape2)
   Ridx = CastLike (Ridx8_hid, i32like)
   R = ScatterElements <axis: int = 1> (base, Ridx, upd_ppc)
   leftidx8 = Sub (cc8, left8)
   rightidx8 = Add (cc8, right8)
   Cidx8 = Concat <axis: int = 1> (leftidx8, rightidx8, cc8)
   Cidx8_hid = CenterCropPad (Cidx8, idx_shape2)
   Cidx = CastLike (Cidx8_hid, i32like)
   C = ScatterElements <axis: int = 1> (base, Cidx, upd_ppc)
   output = Einsum <equation: string = "ah,bh,ch,dh,eh,fh,aw,bw,cw,dw,ew,fw,aq,bq,cq,dq,eq,fq,nqk->nkhw"> (R, R, R, R, R, R, C, C, C, C, C, C, A, A, A, A, A, A, K)
}
