<
   ir_version: 10,
   opset_import: ["" : 18]
>
t367_input_crop_intpack (float[1,10,30,30] input) => (uint64[1,1,11,1] output) 
   <int32[1,10] CBi =  {1,0,0,0,0,0,0,0,0,0}, int32[20] Pi =  {1,2,4,8,16,32,64,128,256,512,1024,2048,4096,8192,16384,32768,65536,131072,262144,524288}, uint64[3,1] w = ..., int64[2] pr =  {0,10}, uint8[1] one8 = ..., bool bfalse = ..., int32 two_i32 =  {2}, int64[1] axd =  {1}, uint64[1,6,1,30] selc = ..., int64[1] three_i64 =  {3}, int64 n20, int64[1] n21, int64[1] n22, int64[1] n25, int64[1] n26, int64[1] n27, int64[1] n28, int64[1] n29, int32[1,1,1,1] xi, int32[1,1,1] B, int32[1,1,1] G, int32[1,1,1] ab22, int32[1,1,1] ab21, int32[1,1,1] ab, int32[1,1,1] gl, int32[1,1,1] gr, int32[1,1,1] nx, int32[1,1,1] E, int32[1,1,1] Et, int32[1,1,1] Eb, int32[1,1,1] Rt, int32[1,1,1] Rb, uint8[1,1,1] G8, uint8[1,1,1] Gp8r, uint8[1,1,1] Rt8, uint8[1,1,1] mrt8, uint8[1,1,1] Rb8, uint8[1,1,1] mrb8, bool[1,1,1] mbt, bool[1,1,1] mbb, float16[1,1,1] Rt_f16, float16[1,1,1] Rb_f16, float16[1,1,1] Eb_f16, float16[1,1,1] Et_f16, float16[1,1,1] mtf, float16[1,1,1] mbf, float16[1,1,1] pos, float16[1,1,1] neg, float16[1,1,1] duf, float16[1,1,1] csumf, int32[1,1,1] csum, int32[1,1,1] F, int32[1,1,3] lan, uint64[1,1,3] lan64, uint64[1,1,1] enc20, uint8[1,1,1] gr8, uint8[1,1,1,1] xG0, uint8[1,1,1,1] xG, int32[1,1,1,1] xiG, int64 n10, int32[1,1,1] be21, int32[1,1,1] be_extra, int32[1,1,1] be19, int32[1,1,1] be, uint64[1,1,1,1] sel_a23, uint64[1,1,1,1] sel_b19, uint64[1,1,1,1] sel_c20, uint64[1,1,1,1] sel_d21, uint64[1,1,1,1] sel_e22, uint64[1,1,1,1] sel, float[1,1,1,1] x29, uint8[1,1,1,1] x29u, uint8[1,1,1,1] x28, uint8[1,1,1,1] x27, uint8[1,1,1,1] x26, uint8[1,1,1,1] x25, uint8[1,1,1,1] x27b2, uint8[1,1,1,1] x26b2, uint8[1,1,1,1] x25b2, uint8[1,1,1,1] x22, uint8[1,1,1,1] x21, uint8[1,1,1,1] x, uint64[1,11,1] enc30>
{
   [n20] n20 = Size (Pi)
   [n21] n21 = Add (n20, axd)
   [n22] n22 = Add (n21, axd)
   [n25] n25 = Add (n22, three_i64)
   [n26] n26 = Add (n25, axd)
   [n27] n27 = Add (n26, axd)
   [n28] n28 = Add (n27, axd)
   [n29] n29 = Add (n28, axd)
   [x29] x29 = CenterCropPad <axes: ints = [2, 3]> (input, n29)
   [x29u] x29u = CastLike (x29, one8)
   [x28] x28 = CenterCropPad <axes: ints = [2, 3]> (x29u, n28)
   [x27] x27 = CenterCropPad <axes: ints = [2, 3]> (x28, n27)
   [x26] x26 = CenterCropPad <axes: ints = [2, 3]> (x27, n26)
   [x25] x25 = CenterCropPad <axes: ints = [2, 3]> (x26, n25)
   [x27b2] x27b2 = CenterCropPad <axes: ints = [2, 3]> (x25, n27)
   [x26b2] x26b2 = CenterCropPad <axes: ints = [2, 3]> (x27b2, n26)
   [x25b2] x25b2 = CenterCropPad <axes: ints = [2, 3]> (x26b2, n25)
   [x22] x22 = CenterCropPad <axes: ints = [2, 3]> (x25b2, n22)
   [x21] x21 = CenterCropPad <axes: ints = [2, 3]> (x22, n21)
   [x] x = CenterCropPad <axes: ints = [2, 3]> (x21, n20)
   [xi] xi = CastLike (x, two_i32)
   B = Einsum <equation: string = "nhij,kh,j->nik"> (xi, CBi, Pi)
   xG0 = CenterCropPad <axes: ints = [1]> (x, n21)
   xG = CenterCropPad <axes: ints = [1]> (xG0, axd)
   xiG = CastLike (xG, two_i32)
   G = Einsum <equation: string = "nhij,j->nih"> (xiG, Pi)
   [ab22] ab22 = CenterCropPad <axes: ints = [1]> (G, n22)
   [ab21] ab21 = CenterCropPad <axes: ints = [1]> (ab22, n21)
   [ab] ab = CenterCropPad <axes: ints = [1]> (ab21, n20)
   [be21] be21 = CenterCropPad <axes: ints = [1]> (G, n25)
   [be_extra] be_extra = CenterCropPad <axes: ints = [1]> (be21, n21)
   [be19] be19 = CenterCropPad <axes: ints = [1]> (be_extra, n22)
   [be] be = CenterCropPad <axes: ints = [1]> (be19, n20)
   gl = Mul (G, two_i32)
   gr = Div (G, two_i32)
   nx = BitwiseXor (gl, gr)
   E = BitwiseAnd (G, nx)
   [Et] Et = BitwiseAnd (E, be)
   [Eb] Eb = BitwiseAnd (E, ab)
   [Lt] Rt = BitwiseAnd (Et, gl)
   [Lb] Rb = BitwiseAnd (Eb, gl)
   G8 = CastLike (G, one8)
   [gr8] gr8 = CastLike (gr, one8)
   [Gp8r] Gp8r = Sub (G8, gr8)
   Rt8 = CastLike (Rt, one8)
   mrt8 = BitwiseAnd (Gp8r, Rt8)
   mbt = CastLike (mrt8, bfalse)
   Rb8 = CastLike (Rb, one8)
   mrb8 = BitwiseAnd (Gp8r, Rb8)
   mbb = CastLike (mrb8, bfalse)
   [Rt_f16] Rt_f16 = Cast <to: int = 10> (Rt)
   [Rb_f16] Rb_f16 = Cast <to: int = 10> (Rb)
   [Eb_f16] Eb_f16 = Cast <to: int = 10> (Eb)
   [Et_f16] Et_f16 = Cast <to: int = 10> (Et)
   [mtf] mtf = Cast <to: int = 10> (mbt)
   [mbf] mbf = Cast <to: int = 10> (mbb)
   [pos] pos = Sum (Rt_f16, Rt_f16, Eb_f16, mbf)
   [neg] neg = Sum (Rb_f16, Rb_f16, Et_f16, mtf)
   [duf] duf = Sub (pos, neg)
   [csum] csumf = CumSum (duf, axd)
   csum = CastLike (csumf, B)
   [F] F = BitwiseAnd (csum, B)
   lan = Concat <axis: int = 2> (B, F, G)
   lan64 = CastLike (lan, selc)
   enc20 = MatMul (lan64, w)
   enc30 = Pad (enc20, pr, "", axd)
   [n10] n10 = Size (CBi)
   [sel_a23] sel_a23 = CenterCropPad <axes: ints = [1]> (selc, n27)
   [sel_b19] sel_b19 = CenterCropPad <axes: ints = [1]> (sel_a23, n21)
   [sel_c20] sel_c20 = CenterCropPad <axes: ints = [1]> (sel_b19, n22)
   [sel_d21] sel_d21 = CenterCropPad <axes: ints = [1]> (sel_c20, n25)
   [sel_e22] sel_e22 = CenterCropPad <axes: ints = [1]> (sel_d21, n26)
   [sel] sel = CenterCropPad <axes: ints = [1]> (sel_e22, n10)
   [output] output = BitwiseAnd (enc30, sel)
}
